[
    {
        "unit_name": "UNIT ONE",
        "learning_content": [
            {
                "title": "Kia German ziada mukhtalif hai? Bunyadi Tips aur patterns",
                "content": "<p>German seekhna aam tor par mushkil qarar paya jata hai. Mark Twain ne 1880 mein mash'hoor andaz mein isey 'bhayanak German zuban' ka naam diya, woh issey slipshod, systemless, slippery aur haath se nikalne wali zuban keh kar ehtejaj karte thay (Mark Twain, 'The awful German language', The Tramp Abroad, 1880 (Harmondsworth: Penguin 1997), pp. 390–402).</p><p>Magar kya yeh sach hai?German seekhne mein aik cheez jo bohat madadgar hai woh yeh hai ke yeh aik systematic zuban hai, jo rules ko follow karti hai. In rules ko seekhne ke bohat se tareeke hain, aur kuch tips bhi hain jo aapko is zuban ko seekhne mein madadgar hongi.</p> <p>Agar aap step by step is zuban ko samajhte jain to aap yeh samajh jayenge ke yeh shayad aap sochte hain se ziada asaan hai. Yahan kuch basic principles diye gaye hain jahan German English se mukhtalif hai, aur jo aapke liye grammar shuru karne se pehle kaam aa sakte hain.</p>"
            },
            {
                "title": "Imalai - Baray huruf aur mukhtalif characters",
                "content": "<p>German ki spelling English se mukhtaliftarike se mukhtalif hai. Zarorat parne par Noun ke liye baray huruf.</p><p>German zuban un kam zubano mein se aik hai jo baray huruf siraf jumle ki shuruaat mein nahi balki jumle ke beech mein bhi istemal karti hai. English mein yeh siraf proper names, personal pronoun 'I' aur personifications, jaise 'Love' ke liye lagu hota hai.</p><p>German mein, tamam nouns hamesha baray huruf se likhe jaate hain, maslan:</p><p>Der Mann und die Frau arbeiten jeden Tag am Computer.</p><p>Har roz admi aur aurat apne computer par kam karte hain.</p><p>Note that the pronoun ich ('I') has no initial capital in German, but Sie (formal form of 'you') has.</p>"
            }
        ],
        "level": "A1",
        "id": 0
    },
    {
        "unit_name": "Unit 1",
        "learning_content": [
            {
                "title": "Alag Alag Alfaz",
                "content": "German alphabet mai kuch characters hain jo English alphabet mai mojood nahi hoty: <br>ß – the sharp ‘s’ <br />German mai yeh harf eszett ke naam se jana jata hai, iski talaffuz 's' ki tarha hoti hai, jaisa ke ‘sun’ ya ‘basic’ mai hota hai. German is harf ka istemal 'ei' aur 'ie' ke baad, aur 'a', 'o', 'u' ke baad karta hai jab woh lamba talaffuz hoty hain."
            },
            {
                "title": "The umlauts – ä, ö, ü",
                "content": "Yeh bohat zaroori hain. Yeh alfaz ki talaffuz aur matlab dono ko badal detay hain: <br> Mutter ka matlab ‘mother’ hota hai, lekin Mütter plural form hai aur iska matlab ‘mothers’ hota hai. Musste ka matlab 'had to' hota hai, lekin müsste ka matlab ‘should’ ya ‘ought to’ hota hai."
            },
            {
                "title": "Tin Gender",
                "content": "German mai tamam noum ya to masculine, feminine ya neuter hotay hain. Yeh unke singular article mai zahir hota hai: der masculine ke liye, die feminine ke liye, das neuter ke liye. <br />Yeh samajhna zaroori hai ke German mai gender grammatical hota hai, biological nahi jaisa ke English mai hota hai. Isska matlab yeh hai ke objects, concepts waghera jo English mai neuter (‘it’) hotay hain, woh German mai masculine, feminine ya neuter ho saktay hain: <br />der Tisch <br />the table (masculine) <br />die Tür <br />the door (feminine) <br />das Fenster <br />the window (neuter)"
            },
            {
                "title": "Endings",
                "content": "English aur German mai aik bara farq yeh hai ke German mai alfaz specific endings letay hain jab woh dosray words se taluq rakhtay hain. Jab bhi aap naya noun sekhtay hain, hamesha isske gender ke sath sikhen: behtareen tarika yeh hai ke aap noun ko usske article ke sath seekhen. Aap dekhenge ke yeh long term mai faida mand sabit hoga."
            }
        ],
        "level": "A1",
        "id": 1
    },
    {
        "unit_name": "Unit 1",
        "learning_content": [
            {
                "title": "Verbs",
                "content": "Ye wo alfaz hain jo aik jumlay ki 'karwai' ko bayan kartay hain, jaisay ke 'daurna', 'sochna'. Misaal ke taur par, German feal 'to go' jab 'I', 'he' aur 'they' ke sath istemal hota hai to iskay akhir mein tabdeel ho jata hai: Ich gehe (Mai chalta hoon), Er geht (Wo chalta hain), Sie gehen (Ye chaltay hain)."
            },
            {
                "title": "Articles and possessive adjectives",
                "content": "Ye wo alfaz hain jo aik sangya se jure hue hote hain jaise ki 'a', 'the', 'my' ya 'his'. Misaal ke taur par, German mein jab aik ghair muqarara muqam ('a') sangya se jura hota hai, to yeh jumlay ke mozoo (ein Mann) ya jumlay ki mafoom (einen Mann) ke sath tabdeel ho jata hai: Ist das ein Mann? (Kia wo aadmi hain?), Da drüben sehe ich einen Mann (Main wahan pe aik aadmi ko dekh sakta hoon)."
            },
            {
                "title": "Adjectives",
                "content": "Ye wo alfaz hain, jo sangya ki khasiyat ko bayan kartay hain, jaisay ke 'new' computer, an 'intelligent' woman, a 'beautiful' house, German adjectives jab wo aik sangya ke samnay hotay hain to unka kuch patern hota hai. German mein adjectives jab aik muzakar sangya (ein neuer Computer), aik maada sangya (eine intelligente Frau) ya aik na mardana na zanana sangya (ein schönes Haus) se jure hotay hain to unka akhir tabdeel ho jata hai."
            },
            {
                "title": "Cases",
                "content": "German ki ek sab se zaroori khasiyat ye hai ke aap jumlay ke aik noun ka kirdar us k akhir aur article ke form se jan sakte hain. Ye us ki sæt ko dikhatay hain. Misaal ke taur par, aik noun jumlay ka mozoo ho sakta hai, yani 'karta' jo kisi kaam mein ho: Der Hund beißt den Mann (Kutta aadmi ko kaat raha hai). Ya phir ke wo jumlay ka mafoom ho, i.e. kaam ka 'receiver': Der Hund beißt den Mann (Kutta aadmi ko kaat raha hai)."
            }
        ],
        "level": "A1",
        "id": 2
    },
    {
        "unit_name": "Unit 1",
        "learning_content": [
            {
                "title": "Moamlaat ka Tarteeb",
                "content": "<p>German zuban mein yeh bohat zaroori hai keh aap moamlaat ka sahih tarteeb jaanain. Finite verb hamesha doosri jaga per aati hai taqreban tamam afraad mein:</p><p>Er hat zwei Brüder.(Wo do bhai rakhta hai.)</p><p>Morgen fahre ich nach Manchester.(Kal main Manchester ja raha hoon.)</p><p>finite verb fiqra ke shuru mein orders aur bohat se sawalon mein ati hai:</p><p>Öffnet das Fenster!(Darwaza kholo, baraye meherbani.)</p><p>Hast Du morgen Zeit?(Kya tum kal farigh ho?)</p><p>Tenses hamesha akhir mein ate hain:</p><p>Ich kann morgen nicht kommen, weil ich nach Manchester fahre.(Main kal nahi aa sakta kyunke mai Manchester ja raha hoon.)</p><p>Agar do verb forms hoti hain, toh aik un mein se akhir mein jati hai:</p><p>Morgen muss ich nach Manchester fahren.(Kal mujhe Manchester jaana hoga.)</p>"
            },
            {
                "title": "Mazi ya Past Tense",
                "content": "<p>English mazi mein ya toh present perfect tense istemal hota hai (jab kuch haal hi mein hua ho ya present se connection ho: 'I was' etc)</p><p>Lekin German mein, aisa farq nahi parta. Dono jumlo mein finite verb form same hota hai:</p><p>Ich arbeite.(Main kaam kar raha hoon.)</p><p>Ich arbeite bei Harrods.(Main Harrods mein kaam karta hoon.)</p>"
            }
        ],
        "level": "A1",
        "id": 3
    },
    {
        "unit_name": "Unit 1",
        "learning_content": [
            {
                "title": "German ka Nizaam aur Asool",
                "content": "German ek bohat zyada systematic zubaan hai, aur buhat jaldi aapko ehsaas ho jayega ke kuch specific patterns bar bar roo baroo hotay hain. Agar aap ye dehaan mein rakhain toh aap dekhain ge ke, pehlay kuch haftoon ki kafi tedha learning curve ke baad, cheezain asaan hojain ge or aap inhe patterns ko samajh paain ge."
            },
            {
                "title": "Bhetareen Dictionary ki Talaash",
                "content": "Ek achi dictionary kharidein. Ye sirf aapko translations provide nahi karti balke aapko ye bhi batati hai ke kese aap unfamiliar words pronounce karain aur aapko important grammatical maloomati bhi deti hai, misaal ke taur par ke aik verb kis case ko leta hai ya aik noun ka plural kya hai. iss kitab ke dauraan, hum aapko batatay hai ke kese aap dictionaries ke saath kaam karain toh iss kisam ki maloomat mile aur isski kya relevancy hai."
            },
            {
                "title": "Jaanchna: Kuch Zaroori baatein",
                "content": "1. German mein capital letters kab istemal hotay hain?<br>2. Aap letter ß kab istemal kartey hain?<br>3. Umlauts ki kya importance hai?<br>4. German aur English istemaal hone wali gender mein kya farq hai?<br>5. Koi aisi misaal dejiye jahan German word apni ending change karta hai.<br>6. German word order par zyada asar dalne wala sab se bara principle kya hai?<br>7. ‘Main kaam kar raha hoon’ aur ‘Main kaam karta hoon’ mein German main kya faraq hai?"
            }
        ],
        "level": "A1",
        "id": 4
    },
    {
        "unit_name": "UNIT DO",
        "learning_content": [
            {
                "title": "Verbs in the present tense",
                "content": "Verbs mojooda zamane mein kya hoty hain? Aik verb aam tor par ye bayaan karta hai ke shakhs ya koi bhi dosra muzoo kya kar raha hota hai: ‘Mein cinema jata hoon’ ‘Wo apni chuttiyon ke bare mein sochti hai’ ‘Wo football khailte hain’"
            },
            {
                "title": "What is a verb?",
                "content": "Verb kya hai? Ye bhi aik halat ko bayan kar sakta hai: ‘Wo gussa hai’ ‘Wo wahan rehti hai’ ‘Wo mujhse mohabbat karte hain."
            },
            {
                "title": "Verbs in English",
                "content": "Angrezi mein, verbs ko sirf mojooda zamane mein teesray shakhs ki wahid form ke siwa kisi bhi form mein nahin rakha jata. Ap kehengy: ‘I go’, ‘you go’, ‘he/she/it goes’, ‘we go’, ‘you go’, ‘they go’."
            },
            {
                "title": "Verb Formation",
                "content": "German mein verbs ki formation English ki nisbat zyada hoti hai. Ap verb ki stem lete hain phir zaroori ending shamil karte hain. Stem wo form hota hai jo infinitive ke bina -en ya -n hota hai."
            }
        ],
        "level": "A1",
        "id": 5
    },
    {
        "unit_name": "Unit 2",
        "level": "A1",
        "learning_content": [
            {
                "title": "Finite aur Infinitive Verbs",
                "content": "Aik verb jiski ending hoti hai usko finite verb kehte hain (infinitive ke muqable jo kisi meaningful ending ka muzahir nahin hota). Ye aik ahem grammatical term hai, aur aap isko units mein kafi dekhenge."
            },
            {
                "title": "Verb Endings Detail mein",
                "content": "Agarcha aap ek shuruat karne wale hain, aap shayad zyada tar pehle aur doosre shakhs ki ek adaad (ich aur du ya Sie) ka istemal karte hain lekin verbs ke tamam endings ke baray mein jan'na zaroori hai. Yahan wo detail mein diye gaye hain."
            },
            {
                "title": "Verb Forms Aur Unke Istemal",
                "content": "<span>Ich ('I'): Pehle shakhs ki singular ke liye, aap stem ke sath -e jortay hain. Misal ke taur pe, 'Ich wohne in Frankfurt.' ka matlab hai 'Main Frankfurt mein rehta hoon.'<br>du/Sie ('you', singular): German mein adress karne ke do forms hain: informal aur formal. Agar aap ek shakhs se baat kar rahe hain, to informal adress du hai aur formal Sie hai (hamesha aik shuruati capital letter ke sath). Endings -st aur -en hain. Misal ke taur pe, 'Woher kommst du?' ka matlab hai 'Tum kahan se aye ho?' (informal)<br>er/sie/es ('he', 'she', 'it'): Teesre shakhsi ya cheez ke baray mein baat karte waqt, aap german mein er ke liye 'he', sie ke liye 'she' aur es ke liye 'it' ka istemal kartay hain aur stem ke sath -t shamil kartay hain.</span><br><table><tr><th></th><th>ich (I)</th><th>du (you, informal)</th><th>Sie (you, formal)</th><th>er/sie/es (he/she/it)</th><th>wir (we)</th><th>ihr (you, plural, informal)</th><th>Sie (you, plural, formal)</th><th>sie (they)</th></tr><tr><td>komm-en</td><td>komme</td><td>kommst</td><td>kommen</td><td>kommt</td><td>kommen</td><td>kommt</td><td>kommen</td><td>kommen</td></tr><tr><td>wohn-en</td><td>wohne</td><td>wohnst</td><td>wohnen</td><td>wohnt</td><td>wohnen</td><td>wohnt</td><td>wohnen</td><td>wohnen</td></tr><tr><td>hör-en</td><td>höre</td><td>hörst</td><td>hören</td><td>hört</td><td>hören</td><td>hört</td><td>hören</td><td>hören</td></tr></table>"
            }
        ],
        "id": 6
    },
    {
        "unit_name": "Unit 2",
        "learning_content": [
            {
                "title": "Introduction to Plural Forms",
                "content": "Hamam ab aam tor par asaan zaban ki shakal mai sikhain gai. 'We' (ham) liyai -en istemal hota hai jo aksar inﬁnitives mai bhi istemal hota hai. Jaisa ke:       <br>       <ul>       <li>Ham Cologne mai rehtai hain - Wir wohnen in Köln.</li>       <li>Ham German seekh rahe hain - Wir lernen Deutsch.</li>       </ul>"
            },
            {
                "title": "Informal and Formal 'You' in Plural",
                "content": "Singular ki tarha, zyada se zyada ek shakhs se bat karnai ke liyai informal (ihr) aur aik formal tariqa (Sie) dono istemal ho sakte hain. Dono ka istemal alag hai, jaise:       <br>       <ul>       <li>Aap kahan rehtai hain? (plural, informal) - Wo wohnt ihr?</li>       <li>Aap yahan kya kar rahe ho? (plural, informal) - Was macht ihr hier?</li>       <li>Aap kahan rehtai hain? (plural, formal) - Wo wohnen Sie?</li>       <li>Aap yahan kya kar rahe ho? (plural, formal) - Was machen Sie hier?</li>       </ul>"
            },
            {
                "title": "Usage of sie/Sie",
                "content": "Jab ap German seekhna start kartai hain, to 'sie' word ke mukhtalif matlab apko confuse kar sakte hain.         <br>       <ul>       <li>'sie' chote s ke sath 'she' ya 'they' ka matlab hota hai.</li>       <li>'Sie' bade S ke sath formal 'you' ke liyai istemal hota hai, dono singular mai bhi aur plural mai bhi.</li>       </ul>"
            }
        ],
        "level": "A1",
        "id": 7
    },
    {
        "unit_name": "Unit 2",
        "learning_content": [
            {
                "title": "One present tense in German",
                "content": "<p>Jaisa ke humne dekha, German mein sirf ek present tense hota hai, jo English ke simple aur continous present dono ko darshata hai. Jaise ki:</p>       <ul>       <li>Er trinkt Bier (He drinks beer or He is drinking beer)</li>       <li>Sie spielt Fußball (She plays football or She is playing football)</li>       </ul>"
            },
            {
                "title": "Exceptions",
                "content": "<p>German mein adhikatar verbs upar bataaye gaye niyam ko follow karte hain, lekin kuch apvaad (irregular forms) hote hain:</p>       <ul>       <li>Kuch verbs mein halki spelling variatoins hoti hai, ya unka stem vowel badalta hai (Unit 3 dekhe).</li>       <li>Sein aur haben (‘to be’ or ‘to have’) vishesh roop se irregular hote hain (Unit 4 dekhe).</li>        </ul>"
            },
            {
                "title": "Important pointers",
                "content": "<p>German verb endings ke mysteries ko aage explore karne se pehle, yeh sunishchit kar lein ki aapne is Unit se saari jaankari acche se samajh li hai.</p>"
            }
        ],
        "level": "A1",
        "id": 8
    },
    {
        "unit_name": "Unit 2",
        "learning_content": [
            {
                "title": "Exercise 2.2",
                "content": ""
            },
            {
                "title": "Informal Conversation Interview",
                "content": "<p>Ye aik choti si interview hai Alex Maschke ki, jo ke Berlin mai rehte hain. Mozoati verb forms se gaps ko pura karein.</p> t<p> ttExample: ttkommen → Woher ttdu? – Ich tt aus Frankfurt. tt→ Woher kommst du? – Ich komme aus Frankfurt. t</p> t<p>Jesa ke aap ne notice kiya hoga, Alex ko be takallufi se address kiya gaya hai. Sawalat ko formal mode mai (Sie form ka use kar ke) phir se likhein.</p>"
            },
            {
                "title": "Exercise 2.3",
                "content": "<p>Ghariab nawisi se mutaliq muqarara saron ki supply karein.</p> t<p> ttExample: ttAnna komm tt aus Wien. tt→ Anna kommt aus Wien. t</p>"
            }
        ],
        "level": "A1",
        "id": 9
    },
    {
        "unit_name": "Unit 2",
        "learning_content": [
            {
                "title": "Exercise 2.4",
                "content": "Mandarja zail jumlaat ka tarjuma karein: <br> 1. Mai Berlin mai rehta hoon. <br> 2. Woh beer peeta hai. <br> 3. Woh tennis khelti hai. <br> 4. Carla aur Sophia football khel rahi hain. <br> 5. Tum kahan se ho? (a) Tum aa rahi ho aur (b) Aap form use karein. <br> 6. Tum kahan rehte ho? (a) Tum, (b) Aap-form aur (c) Ihr form use karein."
            },
            {
                "title": "Checklist",
                "content": "1. Kya aap German verb ka stem form kar sakte hain? <br> 2. Singular mai verb endings kya hain? <br> 3. Plural mai endings kya hoti hain? <br> 4. German mai kitne tenses hote hain for the present?<br> 5. Kya aap finite verb ki tareef kar sakte hain?"
            }
        ],
        "level": "A1",
        "id": 10
    },
    {
        "unit_name": "Unit Teen: Verb ke mukhtalif Iqsam aur beqaaidah verbs",
        "learning_content": [
            {
                "title": "Maamooli aur Beqaaidah Shikal",
                "content": "German mein ziyada tar verbs ek maamooli pattern follow karte hain jahan ending sirf verb ke stem par lagti hai. Lekin kuch variations aise hote hain jahan spelling thori alag hoti hai. Ek beqaaidah verbs ki group bhi hoti hai jahan verb ke stem mein tabdeeli hoti hai."
            },
            {
                "title": "Beqaaidah Forms in English",
                "content": "English mein bhi maamooli aur beqaaidah verbs mein farq hota hai, lekin yeh aam tor par present tense par asar nahi karti, 'to be' aur 'to have' ke ilawa. In verbs ka Unit 4 mein tafseel se zikr kiya gaya hai."
            },
            {
                "title": "Spelling Variations - Aik Jaaiza",
                "content": "Stem endings ka -d ya -t<br/>Kuch German verbs hoti hain jahan stem -d ya -t par khatam hoti hai. Yeh mushkil hota hai ke du aur er/sie/es aur ihr ke -st endings ko pronounce kiya jaye agar -st ya -t seedha stem ke sath joda jaye. Isi liye in endings se pehle e rakha jata hai:<br/>Verbs jaise ke atmen aur regnen<br/>Verbs jaise ke atmen aur regnen, jahan stem aik consonant + n ya m par khatam hoti hai, isInko bhi additional e ki zaroorat hoti hai:<br/>infinite<br/>stem<br/>finite verb<br/>arbeiten<br/>arbeit<br/>du arbeitest<br/>kaam karna<br/>kosten<br/>kost<br/>es kostet<br/>iqsaam<br/>reden<br/>red<br/>ihr redet<br/>baat karna"
            }
        ],
        "level": "A1",
        "id": 11
    },
    {
        "unit_name": "Unit 3",
        "learning_content": [
            {
                "title": "Naamumkin fe'al k saath guta mien tabdeeli",
                "content": "German zabaan mein kuch verbs hotay hain jin ka 'present tense' mein stem mein a, e, or i vowel ka istemal hota hai. Ye tabdeeli sirf 'du' aur 'er/sie/es' forms par apply hoti hai. Kisi aur ending par asar nahi hota. Neeche kuch maamoolan istemal hone wale verbs key examples di gayi hain."
            },
            {
                "title": "Misalain",
                "content": "1) Kya aap Harry Potter parhna pasand kartay hain? Liest du gern Harry Potter?<br>2) Woh football match dekh raha hai. Er sieht ein Fußballspiel.<br>3) Woh pizza khaana pasand karti hai. Sie isst gern Pizza.<br>4) Kya aap German bolte hain? Sprichst du Deutsch?<br>5) Woh gyara baje tak soti hai. Sie schläft bis elf Uhr."
            },
            {
                "title": "Patterns ki talash",
                "content": "Ye tabdili sirf mehdood tadaad fe'al par apply hoti hai. Behtar yehi hai keh aap inhe yaad karlein. Kuch certain patterns apko predict karne mein madad karte hain. Aapko samajhne mein in patterns ka dhyaan rakhna ehem hai. Ye patterns neeche diye gaye hain:<br> a → ä <br> e → i <br> e → ie"
            },
            {
                "title": "Tafseelan Tabdeeli",
                "content": "Neeche diye gaye verbs mein se important verbs – apart from schlafen – woh hain jin ki pattern is tarha hai ki: <br> infinative → finite verb <br> schlafen → er schläft <br> essen → sie isst <br> sprechen → du sprichst <br> lesen → du liest <br>  sehen → er sieht <br> fahren → du fährst, er/sie/es fährt <br> halten→ du hältst, er/sie/es hält <br> tragen → du trägst, er/sie/es trägt <br> waschen → du wäschst, er/sie/es wäscht"
            }
        ],
        "level": "A1",
        "id": 12
    },
    {
        "unit_name": "Unit 3",
        "level": "A1",
        "learning_content": [
            {
                "title": "German Verbs with Vowel Change",
                "content": "<p>German mein kuch verbs hain jin ka 'e' vowel 'i' ya 'ie' mein change hojata hai. Jaisay 'sprechen' aur 'essen' aam misalain hain. Kuch dusray misalain niche di gayee hain:</p> <p>Er hilft Frau Maier - Woh Frau Maier ki madad karta hai.</p> <p>Triﬀst du heute Angelika? - Kya aap aaj Angelika se mil rahe hain?</p> <p>Er wirft den Ball zu Beckham - Woh ball Beckham ko phenkta hai.</p>"
            },
            {
                "title": "Verb 'nehmen' and its Variations",
                "content": "<p>Verb 'nehmen' bhi 'e' se 'i' mein change hota hai, lekin iske spellings mein ziyada variations hain. Zara dekhiye:</p> <p>ich nehme</p> <p>wir nehmen</p> <p>du nimmst</p> <p>ihr nehmt</p> <p>Sie nehmen</p> <p>Sie nehmen</p> <p>er/sie/es nimmt</p> <p>sie nehmen</p>"
            },
            {
                "title": "Example Sentences",
                "content": "<p>Yaha kuch misalain di gayee hain:</p> <p>Nimmst du Kaﬀee oder Tee? - Kya aap coffee ya tea lenge?</p> <p>Er nimmt ein heißes Bad - Woh garam pani ki bath le raha hai.</p>"
            },
            {
                "title": "Changes from e to ie",
                "content": "<p>Kuch verbs jin me e sound lamba bola jata hai, un me e vowel ie mein badal jata hai. Misal ke taur per, </p> <p>- geben → du gibst, er/sie/es gibt, matlab, 'dena'</p> <p>- helfen → du hilfst, er/sie/es hilft, matlab, 'madad karna'</p> <p>- treﬀen → du triﬀst, er/sie/es triﬀt, matlab, 'milna'</p> <p>- werfen → du wirfst, er/sie/es wirft, matlab, 'phenkna'</p> <p>- sehen → du siehst, er/sie/es sieht, matlab, 'dekhna'</p> <p>- lesen → du liest, er/sie/es liest, matlab, 'parhna'</p>"
            }
        ],
        "id": 13
    },
    {
        "unit_name": "Unit 3",
        "learning_content": [
            {
                "title": "Irregular Verbs",
                "content": "Irregular Verbs may vo hotay hain jin ki tahajji present tense mai tabdeel hojati hai. In verbs ko aap kisi bhi course kitab ya dictionary k pechay dekh saktay hain. Lekin yaad rakhain k har irregular verb ki tahajji present tense mai tabdeel nahi hoti."
            },
            {
                "title": "Other Irregular Verbs",
                "content": "Maziya Zarb mai do aur groups hotay hain jin ki tahajji regular pattern k mutabiq nahi hoti. Ye groups hain:   -sein aur haben yaani 'to be' aur 'to have' (Unit 4 dekhe)  -modal verbs (Unit 18 dekhe)"
            },
            {
                "title": "Exercise 3.2",
                "content": ""
            }
        ],
        "level": "A1",
        "id": 14
    },
    {
        "unit_name": "Unit 3",
        "learning_content": [
            {
                "title": "Exercise 3.3",
                "content": "<br>Yahan Hans Homann, aik naujawan television paishkar jis ka taluq Austria se hai, khud ke bare mein kiya kehte hain. Is maloomat ka istemaal karke unki mukhtasir tasveer likhen. Pehla jumla aap ke liye kar diya gaya hai. <br><ol><li> Mera naam Hans Homann hai. → Unka naam Hans Homann hai.</li><li> Main Vienna se hoon.</li><li> Main Austrian Television ke liye kaam karta hoon.</li><li> Main waziha taur par German bolta hoon, lekin English aur Spanish bhi bolta hoon.</li><li> Main detective novels parhne ka shoqeen hoon.</li><li> Main skiing aur swimming bhi bohot shoq se karta hoon.</li><li> Mujhe Marlene Dietrich ke purane films dekhne ka shoq hai.</li><li> Main aksar dair tak sota hoon.</li><li> Main safar karne ka shoqeen hoon.</li><li> Aur main hafte ke akhri dinon mein boorhoon ki madad karta hoon.</li></ol>"
            },
            {
                "title": "Exercise 3.4",
                "content": "<br>Niche diye gaye jumlo ko German mein translate karen:<br><ol><li> Wo kitab parta hai.</li><li> Peter German aur English bolta hai.</li><li> Hum German aur Spanish bolte hain.</li><li> Magda ko pizza khane ka shoq hai.</li><li> Main ik beer lunga, baraye meherbani.</li><li> Uske pass ek beer hai.</li><li> Wo aik T-shirt pehen raha hai.</li><li> Baarish ho rahi hai.</li></ol>"
            }
        ],
        "level": "A1",
        "id": 15
    },
    {
        "unit_name": "Unit 3",
        "learning_content": [
            {
                "title": "Checklist",
                "content": "<p>1 Kya aap yaad rakhsakte hain keh konse endings ke liye aik stem vowel change hai?<br> 2 Kya aap identify kar sakte hain keh aapko ek additional e kab use karna hai?<br> 3 Stem ke end par agar s sound hai tou apko kya yaad rakhna hai?<br> 4 Sabse common stem vowel changes konse hain?</p>"
            }
        ],
        "level": "A1",
        "id": 16
    },
    {
        "unit_name": "UNIT FOUR",
        "learning_content": [
            {
                "title": "Irregular verbs: haben and sein",
                "content": "Irregular verbs haben 'to have' aur sein ‘to be’ dono bohot zaruri hain. Ye German zaban mein, English ki tarah, kaafi irregular hotay hain."
            },
            {
                "title": "Different patterns",
                "content": "Unit 3 mein samjaya gaya tha, German mein irregular verbs ka stem vowel aksar change hota hai. Present tense mein yeh kabhi kabhi du aur er/sie/es forms ko affect karta hai. Sein English ki 'to be' k muqabley mein aur bhi zyada irregular verb hai jiska ending kaafi change hota hai.<br> Jaise ke English mein 'I am', 'you are', 'he/she/it is', 'we are', 'you are', 'they are'"
            },
            {
                "title": "Haben and sein – an overview",
                "content": "<h3>Haben aur Sein k verb forms ka Jaiza:</h3> <ul> <li> ich (I) <ul> <li>habe</li> <li>bin</li> </ul> </li>  <li> du (you, informal) <ul> <li>hast</li> <li>bist</li> </ul> </li> <li> Sie (you, formal) <ul> <li>haben</li> <li>sind</li> </ul> </li> <li> er/sie/es (he/she/it) <ul> <li>hat</li> <li>ist</li> </ul> </li> <li> wir (we) <ul> <li>haben</li> <li>sind</li> </ul> </li> </ul> "
            }
        ],
        "level": "A1",
        "id": 17
    },
    {
        "unit_name": "Unit 4",
        "learning_content": [
            {
                "title": "Haben Detail Mein",
                "content": "<p>Haben jo german mein 'have' ka matlab hota hai uski detail yaha pe bayan ki ja rahi hai.<br/>Kuch patterns hain haben ke jo yaad rakhne mein asani karte hain. <br/>Ich, wir, ihr aur sie ke liye endings kaafi regular hain: unhe aam taur par stem se juda jata hai:<br/>ich hab-e, wir hab-en, ihr hab-t, sie hab-en. <br/>Sirf du aur er/sie/es ke liye finite verb form irregular hoti hai – isme apko stem se b ko drop karna parta hai:<br/>du hast, er/sie/es hat.</p>"
            },
            {
                "title": "Haben Ka Istemal",
                "content": "<p>Haben kaafi zaruri verb hai jiska bohot istemal karte hain. Is ka istemal English ki 'to have' ki tarah hota hai:<br/>Ich habe gesungen.<br/>Yaani ke,<br/>Maine gaaya.<br/>Yaha kuch phrases bhi diye gaye hain jinme haben ka istemal hua hai:</p>"
            },
            {
                "title": "Mufeed Phrases",
                "content": "<p>Hunger haben ka matlab hota hai bhukha hona;<br/>Ich habe Hunger.<br/>Yaani,<br/>Mujhe bhukh lagi hai.<br/>Durst haben ka matlab hota hai pyaas hona;<br/>Er hat Durst.<br/>Yaani,<br/> Usse pyaas lagi hai.<br/>Isi tarah se aur phrases hain:</p>"
            }
        ],
        "level": "A1",
        "id": 18
    },
    {
        "unit_name": "Unit 4",
        "learning_content": [
            {
                "title": "Sein Detail Mai",
                "content": "Sein verb bohat irregular hai, aur isko by heart yaad kia jana parhta hai: ich bin, du bist, Sie sind, er/sie/es ist, wir sind, ihr seid, Sie sind, sie sind. Yahaan kuch misalain hain: <br> 'Ich bin aus Deutschland' ka matlab hai 'Main Germany se hon'. <br> 'Sind Sie Herr Schuhmacher?' ka matlab hai 'Kya aap Mr. Schuhmacher hain?' <br> 'Du bist sehr schön' ka matlab hai 'Aap bohat khoobsurat hain.' <br> 'Er ist Amerikaner' ka matlab hai 'Wo Amreeki hai'. <br> 'Sie ist Lehrerin' ka matlab hai 'Wo (female) aik ustad hain.' <br> 'Es ist schwer' ka matlab hai 'Yeh mushkil hai.' <br> 'Entschuldigung, wir sind verspätet' ka matlab hai 'Maazrat, hum late hain.' <br> 'Seid Ihr verheiratet?' ka matlab hai 'Kya aap shadi shuda hain?' <br> 'Wir sind aus Großbritannien' ka matlab hai 'Hum bara britaniya se hain.' <br> Aur Shakespeare ka famous dialogue: Sein oder Nicht-Sein. Das ist die Frage, jiska matlab hota hai 'Hona ya na hona, yehi sawal hai.'"
            },
            {
                "title": "Sein Ka Istemaal",
                "content": "Sein verb bohat ahem hai aur iski aksar zarurat padti hai. Yeh tenses aur doosre grammatical forms banane ke liye istemaal kiya jata hai.<br> German language mai sirf aik present tense hota hai. Iska istemaal English ke 'I am going' jese tense banane ke liye nahi hota. Jese 'Ich gehe'."
            }
        ],
        "level": "A1",
        "id": 19
    },
    {
        "unit_name": "Unit 4",
        "learning_content": [
            {
                "title": "Exercise 4.2",
                "content": "<p>Muzhairah verb form istamal kar ke mukhtasir mukalamaat ko mukammal karein.</p>"
            },
            {
                "title": "Exercise 4.3",
                "content": "<p>Ab poore maujooda tense (sab log: main, tum, woh, hum, tum, aap, woh) ke verbs (1) hona aur (2) hona ka poora likhain.</p>"
            },
            {
                "title": "Exercise 4.4",
                "content": "<p>Mandarja zail sentences ko German mein Translate karein:</p>                   <p>1- Hum New York se hain.</p>                   <p>2- Wo log Australia se hein.</p>                   <p>3- Mario Munich se hai.</p>                   <p>4- Kya aap Mr Becker hain?</p>                   <p>5- Uske paas aik behen hai.</p>                   <p>6- Kya aapke paas samay hai?(a) Tum form aur (b) Aap form ke saath.</p>"
            }
        ],
        "level": "A1",
        "id": 20
    },
    {
        "unit_name": "Unit 4",
        "learning_content": [
            {
                "title": "Content 1",
                "content": "<p>7 Woh logh talib ilm haan.<br>8 Berlin Germany ki dar-ul-hukumat hai.<br>9 Mere paas aik flat hai.<br>10 Hum bhooky hain.<p>"
            },
            {
                "title": "Checklist",
                "content": "<p>1 Kya aap dil se tamam mukammal verb forms (mojooda zamane mayn) sein ke yaad hain?<br>2 haben ke liye na mumkinat kya hain?<br>3 Kya aap kuch mufeed phrases yaad kar saktey hain haben ke saath?<p>"
            }
        ],
        "level": "A1",
        "id": 21
    },
    {
        "unit_name": "UNIT FIVE",
        "learning_content": [
            {
                "title": "Separable verbs in the present tense",
                "content": "<p>Aik separable verb kya hota hai? Ye wo verbs hain jo do hisson mein taqseem hoti hain: aik prefix aur verb ki infinitive.</p><p>Misal ke tor par: auf + stehen → aufstehen 'to get up'.</p>"
            },
            {
                "title": "Comparison with English",
                "content": "<p>Separable verbs ko English phrasal verbs se tashbeeh di jasakti hai, jo infinitive aur aik adverb ya preposition ka milaap hoti hain: 'to get up', 'to get on' waghera.</p>"
            },
            {
                "title": "Important separable verbs",
                "content": "<p>Separable verbs German mein kafi aam hain. Neechay kuch eham tareen hain: abfahren 'to depart', abholen 'to pick up', abwaschen 'to do the washing up', anfangen 'to start', ankommen 'to arrive', anrufen 'to phone', aufhören 'to stop', aufräumen 'to tidy up', aufstehen 'to get up', ausgehen 'to go out', einkaufen 'to go shopping', einladen 'to invite'.</p>"
            }
        ],
        "level": "A1",
        "id": 22
    },
    {
        "unit_name": "Unit 5",
        "learning_content": [
            {
                "title": "Jab aik detachable verb mojood hota hai",
                "content": "Jab aik detachable verb mojood hota hai, verb ka prefix usually alag hojata hai or sentence k end pr ajata hai. Eg:  <b>anrufen</b> → <i>Mr. Nolte rings his wife.</i>  <b>aufstehen</b> →  <i>Bernhard gets up at five o'clock in the morning.</i>  <b>ausgehen</b> → <i>Corinna goes out every day.</i>  <b>fernsehen</b> → <i>The children watch television every evening.</i>  <b>einkaufen</b> → <i>He goes shopping in the supermarket.</i>  <b>stattfinden</b> → <i>The meeting takes place on Monday.</i>"
            },
            {
                "title": "Jab sentence main do clauses hotay hain",
                "content": "Jab sentence main do clauses hotay hain, to split off prefix relevant clause k end pr ajata hai. Ye zaruri nahi k sentence k end pr ho. Eg:  <b>Clause 1: Ich stehe auf</b> → <i>I get up</i>  <b>Clause 2: und dann frühstücke ich.</b> → <i>and then I have breakfast.</i>  <b>Clause 1: Herr Carlsen sieht fern,</b> → <i>Mr Carlsen is watching television,</i>  <b>Clause 2: aber seine Kinder lesen.</b> → <i>but his children are reading.</i>"
            }
        ],
        "level": "A1",
        "id": 23
    },
    {
        "unit_name": "Unit 5",
        "learning_content": [
            {
                "title": "Context",
                "content": "<p>Dr Schuster sirf bara baje sonay jatay hain, lekin unhain paanch baje uth jana parta hai.</p>"
            },
            {
                "title": "Verbs can have more than one prefix",
                "content": "<p>Ek verb kaafi sari prefix ka istemal kar sakta hai. Yahan humnay 'kommen' verb ka istemal kia hai mukhtalif prefixes ke sath aur is se uska matlab tabdeel hota hai:</p> <p>ankommen ka matlab hota hai 'to arrive'</p><p>mitkommen ka matlab hota hai 'to come along'</p><p>weiterkommen means 'to get on'</p><p>hereinkommen means 'to come in'</p><p>herauskommen means 'to come out'</p><p>nachkommen means 'to come later'</p><p>zurückkommen means 'to come back'</p><p>Aur ek example hai 'steigen' verb ki: einsteigen ka matlab hota hai 'to get in/on', umsteigen ka matlab hota hai 'to change' aur aussteigen ka matlab hota hai 'to get out/oﬀ'</p><p>Prefiex ka matlab jan kar ap often guess kar saktay hain. Lakin ye hamesha nahi hota, is liye separable verbs ko yaad karna parta hai</p></p>"
            },
            {
                "title": "How to find out whether a verb is separable",
                "content": "<p>Aap ye maloom kar saktay hain ke aik verb alag ho sakta hai ya nahi, achi dictionary check kar ke. Agar verb alag ho sakta hai to us ke peechay 'sep' likha hua ho ga."
            },
            {
                "title": "Common Separable prefixes",
                "content": "<p>Common separable prefixes yeh hain:ab-, an-, auf-, aus-, ein-, mit-, nach-, vor-, zu-, zurück-</p><p>Aap in prefixes ke examples upar diye gaye sath mein dekh saktay hain.</p> "
            }
        ],
        "level": "A1",
        "id": 24
    },
    {
        "unit_name": "Some inseparable prefixes",
        "learning_content": [
            {
                "title": "Inseparable Prefixes",
                "content": "<p>There are also preﬁxes which are inseparable. They include be-, er-, ge- and ver-. Frequently used verbs with inseparable preﬁxes are bezahlen ‘to pay’, erzählen ‘to tell’, verdienen ‘to earn’, verkaufen ‘to sell’ and verstehen ‘to understand’.</p><p> As you can see, these preﬁxes do not separate from the verb.</p>"
            },
            {
                "title": "More about separable verbs",
                "content": "<p>As a beginner you will probably use separable verbs most often as explained above. However, separable verbs occur also in the imperative, in combination with modal verbs, and in the perfect and future tense.</p><p> If you cannot ﬁnd a separable verb in a verb list or dictionary, look up the verbs without its prefix.</p>"
            }
        ],
        "level": "A1",
        "id": 25
    },
    {
        "unit_name": "Unit 5",
        "learning_content": [
            {
                "title": "Ishtehaar 5.4",
                "content": "<b>Translate the following sentences:</b> <br> 1. Main saat bajay utha.<br> 2. Main apna kaam 8 bajay shuru karta hoon.<br> 3. Meeting peer (Monday) ko ho rahi hai.<br> 4. Train kab rawana ho gi?<br> 5. Train kab pohnche gi?<br> 6. Michael saman thik kar raha hai aur us ke bache television dekh rahay hain. <br> 7. Aap cinema k liye saath a rahe hain?"
            }
        ],
        "level": "A1",
        "id": 26
    },
    {
        "unit_name": "Unit 5",
        "learning_content": [
            {
                "title": "1 to 5 - Questions",
                "content": "<p>1 Kaunsa hissa verb ka alag kiya jata hai?<br/> 2 Ye ek sentence me kaha jata hai?<br/> 3 Agar ek sentence me zyada se zyada clause ho to kya hota hai?<br/> 4 Aap kaise check kar sakte hain ke verb alag hai?<br/> 5 Kya aap ko pata hai ke kaunse prefixes non-separable hain?</p>"
            }
        ],
        "level": "A1",
        "id": 27
    },
    {
        "unit_name": "UNIT CHEH",
        "learning_content": [
            {
                "title": "Imperatives",
                "content": "Imperatives yani hukum kiya jaye. Yeh kisi ko hukum ya dastur dene ke liye istemal kiya jata hai."
            },
            {
                "title": "Imperative kya hai?",
                "content": "Imperative ka istemal hukum dene ya logon ko kuch karne ke liye hukam dene ke liye kiya jata hai."
            },
            {
                "title": "Imperative ko English main kaise istemal kiya jata hai",
                "content": " Edge se jao! Apni kitaben kholo! Khirki band karo! Chahe aap sirf ek shakhs se baat kar rahe hon ya kai logo se, isme koi farq nahi parta. "
            },
            {
                "title": "German main imperative ki char alag shaklein",
                "content": "German main imperative thora mazeed uljha hua hai. Yahan alag shaklein hain jo is par depend karti hain ki aap sirf ek shakhs se baat kar rahe hain ya zyada se zyada. German imperative main formal aur informal mode of address ka bhi tafawut karta hai."
            },
            {
                "title": "Imperatives - ek jhalak",
                "content": " Yahan imperative ki alag-alag shaklon ka ek jhalak hai. Lekin yaad rahain ke sirf English ko Roman Urdu main tabdeel kiya gaya hai, German ko nahi. "
            }
        ],
        "level": "A1",
        "id": 28
    },
    {
        "unit_name": "Unit 6",
        "learning_content": [
            {
                "title": "Imperatives in more detail",
                "content": "Ap dekh sakte Hen, 'du', 'Sie' aur 'ihr' form mukhtalif patterns follow karte hen. Formal command ya imperative singular aur plural mein same hoti hai."
            },
            {
                "title": "Addressing one person informally (du form)",
                "content": "Informal singular ya 'du' form kisi aik shakhs se baat karne ke liye istemal hoti hai jisse aap quite familiar hen – bachon, family ya qareebi dost. Aap verb ke stem ka istemal karke imperative bnate hen baghair kisi ending ke:<br>Komm her! ( Yahan Aao!) <br>Trink weniger (Kum Piyo)<br>Warte (Ruko)<br>Atme schneller (Tez Saans lo)<br>Sprich leise (Aram se bolo)<br>Lies die Zeitung (Akhbar parho)."
            },
            {
                "title": "Irregular forms",
                "content": "Jo verbs kuch variation rakhtei hen unke present tense mein, un mein thori variation hoti hai imperative ke liye:<br>Verbs jin ka end d, t, consonant + m ya consonant + n se hota hai woh stem ke end mein 'e' add karte hen.<br>Verbs jin mein stem vowel change hota hai un mein same stem vowel change hota hai imperative mein.<br>But verbs jo a se ä mein change hoti hen, woh change nahi karte. Woh sirf stem ka use karte hen imperative form banane ke liye: <br>Anfangen (Shuru Karo)<br>Haben (Rukhna)<br>Sein (Ho Jao)."
            }
        ],
        "level": "A1",
        "id": 29
    },
    {
        "unit_name": "32, Unit 6",
        "learning_content": [
            {
                "title": "Separable Verbs",
                "content": "Judag ho karne wali verbs apne prefix ko alag kar deti hain aur usko finite verb ke baad ya clause ke end pe rakh deti hain. <br> 'Haben' aur 'sein' jaisi regular verbs ki tarah behave karte hain. Verb ke stem ka istamaal karein."
            },
            {
                "title": "Ek Shakhs ko Rasmi Tareekay se Khitab Karna (Sie form)",
                "content": "Jab aap apne kisi qareebi se nahi balke kisi ek shakhs ko khitab kar rahe hon, to formal singular ya Sie form istamaal karein. <br> Ye bas present-tense Sie form ka istamaal hai. Informal ki nisbat formal imperative mein personal pronoun 'Sie' bhi shamil hota hai. Verb ke baad 'Sie' aane se aap samajh sakte hain ke ye imperative hai: <br>kommen → Kommen Sie, bitte. <br> Please come."
            },
            {
                "title": "Zyada se Zyada Ek Shakhs ko Rasmi Tareeqay se Khitab Karna (ihr form)",
                "content": "Informal plural tab istamaal hota hai jab aap kam se kam do logon ya aapke waqif logon ---- bachon, family ya doston ---- se khitaab kar rahe hote hain."
            },
            {
                "title": "Hab-en",
                "content": "Hab Geduld. <br> Sabar rakho."
            },
            {
                "title": "sei-n",
                "content": "sei <br> Hoshiar raho."
            }
        ],
        "level": "A1",
        "id": 30
    },
    {
        "unit_name": "Unit 6",
        "learning_content": [
            {
                "title": "Tashkeel",
                "content": "<p>Informal plural wesi banai jati hai jese second person plural (ihr): verb ke stem me t jodte hain.<p> Verbs jinki stem d, t, consonant + m ya consonant + n per khatam hoti hain, unke ending stem me -et hota hai.<p>Separable verbs apna prefix alag kar deti hain.</p>"
            },
            {
                "title": "Misalen",
                "content": "<p>kommen → Kommt, bitte! Yani, Baraye mehrbani aye.<p>warten Wartet auf uns! Yani Humein intezaar kare.<p>aufhören Hört mit dem Reden, yani baten karna band kare.</p>"
            },
            {
                "title": "Ikhtitami Taqreeb",
                "content": "<p>Agar aap zyada se zyada logon se formal tariqe se baat kar rahe hain, to aap Sie plural form ka istemal karte hain. Formal imperative singular aur plural ke beech farq nahi karta, yahi wajah hai keh yeh bilkul isi tarah banaya jata hai: <p> kommen → Kommen Sie, meine Herren. Yani, Sajjanon, baraye mehrbani aye. <p> warten Warten Sie! Yani, Intezaar Karein! <p> eintreten Bitte treten Sie ein. Yani, Baraye mehrbani andar ayein.</p>"
            },
            {
                "title": "Zuban Ka Pehla Muqam",
                "content": "<p> Jaisa keh aap ne dekha hai, German ke tamam imperative forms ek important feature rakhte hain: verb sentence me pehle position per hota hai. Yeh structure English se bohat milta julta hai. </p>"
            },
            {
                "title": "Dastaviqi Nishan",
                "content": "<p> Likhri German me, aap command form ke bad aksar an exclamation mark lagate hain. Is se command form me takhleeq ki gayi baat per zyada zor dalta hai.</p>"
            },
            {
                "title": "Aksariyat Ka Istemal",
                "content": "<p> German me imperative kaafi frequently use hota hai. Is ka istemal batameezi ya rudeness nahi hota. English isi tarah ke structures ka zyada istemal karti hai, aksar sawal me. </p>"
            }
        ],
        "level": "A1",
        "id": 31
    },
    {
        "unit_name": "Unit 6",
        "learning_content": [
            {
                "title": "Form, jab kisi sey kuch karne ke liye pucha jata hai",
                "content": "<p>'Kya aap khidki khol sakte hain, baraye meherbani?' Yeh baat yaad rakhen ke German zaban men aksar isi tarah ke jumle use hote hain, lekin kuch waqt ke liye imperatives ke liye tayyar rahen.</p>"
            },
            {
                "title": "Advice dena apne close friend ko unke health ke baray men",
                "content": "<p>Aap apne kareebi dost ko uski sehat ke bare mein mashwara de rahe hain. Niche diye gaye sentences ko command form mein likhen, lekin du form ka istemal karen.<br> <b>for example:</b> mehr Zeit für sich selber / haben → Hab mehr Zeit für dich selber!</p>"
            }
        ],
        "level": "A1",
        "id": 32
    },
    {
        "unit_name": "Unit 6",
        "learning_content": [
            {
                "title": "Exercise 6.4",
                "content": "<p>Baraye mashq karne ke liye, niche die gae jumle ko translate karen. Pehle German ke Sie form me, phir du form aur akhir mein ihr form me.<br/>1. Braaye meherbani shuru karain.<br/>2. Khirki kholen.<br/>3. Kya aap mujhe bill la sakten hain, braaye meherbani.<br/>4. Hoshiyar rahen.</p>"
            },
            {
                "title": "Checklist",
                "content": "<p>1. German me kitne mukhtalif command shapes hote hain?<br/>2. Aap kaise singular informal command banatay hain?<br/>3. Kya normal verb variations command formation me apply hoti hain?<br/>4. Aap kaise formal command ko pehchante hain?</p>"
            },
            {
                "title": "Unit 6",
                "content": "<p>Yeh unit number 35 hai.</p>"
            }
        ],
        "level": "A1",
        "id": 33
    },
    {
        "unit_name": "Unit 7",
        "learning_content": [
            {
                "title": "Do Qisam Ke Sawalat",
                "content": "Mukhtalif qisam ke sawalaat hote hain. Pehla woh hota hai jo sawaal lafz (interrogative) se shuru hota hai aur zyada ‘kholta’ hai. Doosra woh hota hai jo aik mukammal fiel se shuru hota hai aur ‘han’ ya ‘nahi’ ke jawab ki zaroorat hoti hai. Ye dono qisam ke sawalat English aur German zaban mein aam taur par istemal hote hain."
            },
            {
                "title": "Tafseel ke sath Interrogative ya ‘w-questions’",
                "content": "Yahan aham sawal lafzon aur un ke English mutaradifat ki fahrist di gai hai:<br>wer? - who?<br>was? - what?<br>wo? - where?<br>woher? - where . . . from?<br>wohin? - where . . . (to)?<br>Interrogative sawalaat jaise ke, ‘Aap kahan se aaye hain?’ aur ‘Aap kahan rehte hain?’"
            },
            {
                "title": "Han Ya Nahi Ka Sawal",
                "content": "Is qisam ke sawalaat jaise ke, ‘Kya aap ke paas behen bhai hain?’ aur ‘Kya yeh aap ka mobile hai?’"
            }
        ],
        "level": "A1",
        "id": 34
    },
    {
        "unit_name": "Unit 7",
        "learning_content": [
            {
                "title": "Jab tumhara naam kiya hai?",
                "content": "<p>German Bei sawal karte hue 'wie' istemal hota hai jab hum kisi ka naam ya address pochte hain. English mein iski tarjuma 'how' hoti hai lekin yahan pe iska matlab 'what' hota hai.</p> <p>Misal ke taur pe:</p> <p>Wie ist dein Name? yani 'tumhara naam kiya hai?'</p> <p>'was' istemal karna galat hoga is situation mein.</p>"
            },
            {
                "title": "wo, wohin aur woher ka istemal",
                "content": "<p>German mein 'wo' ka matlab 'where' hota hai. Agar hum kisi jagah ki taraf ya uss se hatne ki bat kar rahe hain to hum 'wohin' ya 'woher' istemal karte hain.</p>"
            },
            {
                "title": "Misaalein",
                "content": "<p>Yahan kuch misaal di gai hain jo yeh batati hain ki sawal karne wale lafzon ka istemal kis tarah hota hai.</p> <p>Wer ist das? yani 'wo kon hai?'</p> <p>Wo wohnst du? yani 'tum kahan rehte ho'</p> <p>Woher kommen Sie? yani 'aap kahan se aaye hain'</p> <p>Wohin fährt Juliane nächstes Wochenende? yani 'Juliane agle hafte kahan ja rahi hai'</p> <p>Wie ist deine E-Mail-Adresse? yani 'tumhari E-mail id kya hai?'</p> <p>Wie viel kosten 100 Gramm Mozzarella? yani '100 gram Mozzarella ki kimat kya hai?'</p> <p>Wie oft gehst du aus? yani 'tum kitni bar bahar jate ho?'</p>"
            }
        ],
        "level": "A1",
        "id": 35
    },
    {
        "unit_name": "Unit 7",
        "level": "A1",
        "learning_content": [
            {
                "title": "Jaga aur Muqam",
                "content": "<p>'Jahan hai church?' ya 'Aap kahan ja rahe hain is sham?' jaise sawalat kaise poochte hain. Aise hi, 'Aap kahan se aa rahe hain?' iss bare main bhi janain ge. </p>"
            },
            {
                "title": "Pesha aur Kaam ki Jagah",
                "content": "<p>'Aap kiya karte hain zindagi main?' dosre lafzon main 'Aap ka pesha kiya hai?' kaise poochtay hain. Agar aap janna chahta hain k koi konse compani main kam karta hai to german main aap aise sawaal puchtay hain: 'Aap kaha kam kartay hain?' ya phir 'Aap kiskay liye kam kartay hain?' </p>"
            },
            {
                "title": "Sawal k Alfaz Pehle Position main",
                "content": "<p>Sawal ka lafz sawal main pehle position pe hota hai. Ye alf finite verb ke sath dosri idea ka part hota hai, phir subject ata hai.<br/>  For example: 'Kahan se aaye ho?' ya phir 'Juliane weekend pe kahan jayegi?'</p>"
            },
            {
                "title": "Haan aur Naah wale Sawalat Detail main",
                "content": "<p>Dosre type ke sawal ka jawab sirf 'Haan' ya 'Naah' hota hai. Jaisa ke aap dekh sakte hain, iss main koi sawal lafz nahi hota. Balkay finite verb pehli position main hota hai.  For example: 'Kya Peter Berlin se aata hai?' ya 'Kya aap Hotel 'Zur Sonne' main rehtay hain?' ya 'Kya tum pasand kartay ho peenay ko?'</p>"
            }
        ],
        "id": 36
    },
    {
        "unit_name": "Unit 7",
        "learning_content": [
            {
                "title": "Farq between English and German Questions",
                "content": "German is much simpler than English in this respect.English often uses the verb ‘do’ to form this kind of question: ‘Does Peter come from Berlin?’ ‘Do you stay in the hotel “Zur Sonne”?’ ‘Do you like drinking?’ <br/>In German, these structures do not exist. It is suﬃcient to move the ﬁnite verb to the beginning of the sentence. Here are some more examples:<br/> Do you speak German?<br/> Does he work for MTV Germany? <br/> Does she really run 10 km each day?"
            }
        ],
        "level": "A1",
        "id": 37
    },
    {
        "unit_name": "Unit 7",
        "learning_content": [
            {
                "title": "Exercise 7.3",
                "content": "<p>Ye angrezi moujooda sawalat ko roman urdu mai translate karien. Aap 'you' k liye 'du' aur 'Sie' dono forms ka istemaal karien.</p> <br>                   <ol>                   <li>Tumhara naam kya hai?</li>                    <li> Tum kahan se ho?</li>                    <li>Tumhara e-mail address kya hai?</li>                    <li>Abhi time kya hai?</li>                   <li> Kiya tum shadi shuda ho?</li>                   <li> Kiya tumhein bachay hain?</li>                   <li> Kiya tum angrezi bolte ho?</li>                   </ol>"
            }
        ],
        "level": "A1",
        "id": 38
    },
    {
        "unit_name": "Unit 7",
        "learning_content": [
            {
                "title": "Question Word Usage",
                "content": "<p>1 Ap kaun sa sawaal lafz istemaal karte hain jab aap naam ya pata ke liye poochte hain?<br> 2 Aap yes or no question mein finite verb ko kahan rakhenge?<br>3 Aap 'w-question' mein finite verb ko kahan rakhenge?</p>"
            },
            {
                "title": "Describing Directions",
                "content": "<p>4 Agar aap kisi ko kisi jagah se aa rahe ya kisi manzil ko ja rahe hain describe karna chahte hain, to aapko konse sawaal lafze istemaal karne ki zaroorat hoti hai?</p>"
            }
        ],
        "level": "A1",
        "id": 39
    },
    {
        "unit_name": "UNIT EIGHT: Nouns and Gender",
        "learning_content": [
            {
                "title": "Noun kya hai?",
                "content": "<p>A noun ek lafz hota hai jiska istemal insaan ya cheez ko naam dene ke liye hota hai, ek aala ya khayal: a woman, a boat, friendship, democracy. Bohot sari zubanein hain jinmein nouns kisi na kisi gender mein hote hain - yeh masculine, feminine ya neuter ho sakte hain.</p>"
            },
            {
                "title": "English mein Biological gender",
                "content": "<p>English zuban mein, nouns ki gender unki avastha ke hisab se hoti hai: cheezein, objects, janwar aur khayalat neuter ('it') hoti hain, female vyakti feminine ('she') hote hain aur male vyakti masculine ('he') hote hain. Is tarah se nouns ko classify karne ko 'biological' gender kaha ja sakta hai. German zuban mein iska istemaal grammatical gender ke liye kiya gaya hai, jismein koi aysi rishta nahi hota hai.</p>"
            },
            {
                "title": "German mein teen genders",
                "content": "<p>German zuban mein, saare nouns masculine, feminine ya neuter hote hain. Inhe pehchanna mumkin hota hai definite article ('the' in English) se, jo har ek gender ke liye alg hota hai: der masculine ke liye hota hai, die female ke liye aur das neuter ke liye:</p><br><p>Masculine: der (misal: der Mann, der Tisch) yani, the man, the table<br>Feminine: die (misal: die Frau, die Tür) yani, the woman, the door<br>Neuter: das (misal: das Kind, das Fenster) yani, the child, the window</p><p>note kare ki plural mein in teeno groups ka same article hota hai: die Männer ‘the men’, die Frauen ‘the women’, die Kinder 'the children'.</p>"
            }
        ],
        "level": "A1",
        "id": 40
    },
    {
        "unit_name": "Unit 8",
        "level": "A1",
        "learning_content": [
            {
                "title": "Germanski nouns ki Gender",
                "content": "Jaisa ke aap dekh sakte hain, woh nouns jinka natural gender wazeh hota hai, unka gender guess karna asaan hota hai: der Mann mard hai aur die Frau aurat. Lekin afsos ke saath, aksar nouns ki gender samajhna mushkil hota hai. Germanski words 'table', 'door' aur 'window' ke liye, misal ke taur par, tamam mukhtalif groups se taluk rakhte hain. Yeh pasand karna behtar hai ke aap naye noun ko uski gender ke saath seekhen: der Tisch, die Tür, das Fenster."
            },
            {
                "title": "Noun ki gender kaisey dhundhein",
                "content": "Aam taur per, aik dictionary mein noun ki gender word ke baad di jati hai. Sab se aam mukhtasirat hain: m (masculine), f (feminine), nt (neuter). Phir bhi, kuch aesay ishare bhi hain jo aap ko samajhne mein madadgar sabit ho sakte hain ke noun mardana, aurat ya phir neutral hai. Aik ishara noun ke end mein ane wala hai. Kuch aisay groups bhi hain jin mein tamam nouns ki genders same hain. Yaha ek overview hai."
            },
            {
                "title": "Masculine nouns ke liye clues",
                "content": "<p>Zaroori endings:</p><p>Jab aap noun ke end pe ye endings dekhein, iska matlab hai ke noun mardana hai:</p><p>-er, misal ke tor par, der Computer, der Wecker (computer, alarm clock)</p><p>-ig, misal ke tor par, der Honig, der Käfig (honey, cage)</p><p>-ismus, misal ke tor par, der Idealismus, der Kapitalismus (idealism, capitalism)</p><p>-ling, misal ke tor par, der Frühling, der Schilling (spring, shilling)</p><p>-or, misal ke tor par, der Motor, der Reaktor (engine, reactor)</p><p>Groups of nouns:</p><p>Aisay bhi kuch groups hain jo mardana hain:</p><p>Male persons, misal ke tor par, der Vater, der Sohn (father, son)</p><p>Names of days and months, misal ke tor par, der Montag, der August (Monday, August)</p><p>Names of seasons, misal ke tor par, der Sommer, der Winter (summer, winter)</p><p>Makes of cars, misal ke tor par, der BMW, der Jaguar (BMW, Jaguar)</p><p>Alcoholic drinks, misal ke tor par, der Whisky, der Wein (whisky, wine)</p><p>'Beer' ek exception hai aur neuter hai: das Bier</p>"
            }
        ],
        "id": 41
    },
    {
        "unit_name": "Unit 8",
        "learning_content": [
            {
                "title": "Clues for feminine nouns",
                "content": "Yeh ending aksar indicate karti hain k noun feminine hai:<br/> Yeh bhi note karen k taqreeban 90% nouns jo -e se khatam hotay hain wo feminine hotay hain: die Adresse  yani 'address', die Flasche yani 'bottle', die Krawatte yani 'tie'<br/>Lekin kuch ahem istisna hain jaise k der Name yani 'name' aur der Käse yani 'cheese'.<br/> Kuch aise nouns bhi hain jo feminine hotay hain:<br/>Mashoor istisnayen hain: das Mädchen yani ‘girl’, das Veilchen yani ‘violet’."
            },
            {
                "title": "Clues for neuter nouns",
                "content": "Doosray do genders ki tarhan, kuch khaas endings aapko yeh batati hain k noun neuter hai. Sabse ahem hain:<br/>-ei<br/>die Bäckerei, die Türkei <br/>Yani bakery, Turkey<br/>Aur isi tarah ki kuch aur istisnaen hain. Neeche diye gye hain: <br/>-enz, -heit, -ie, -ion, -keit, -tät, -schaft, -ung, -ur<br/>Aur female persons, names of motorbikes and ships, names of trees and flowers."
            }
        ],
        "level": "A1",
        "id": 42
    },
    {
        "unit_name": "Unit 8",
        "learning_content": [
            {
                "title": "Nouns Capitalization",
                "content": "<p>Yaad rakhain ke German mai har noun koi capital letter se shuru hota hai:</p>  <p>Der Computer hat eine neue (The computer has a new)</p> <p> Tastatur. (keyboard.)</p>  <p>Wie heißt das Kino? (What is the name of the cinema?) </p> <p>Ye aapko madad kar sakta hai German sentence mai noun ko dhundne mai.</p>"
            },
            {
                "title": "Compound Nouns",
                "content": "<p> Aapne dekha hoga ke German bolne wale log lambay alfazon ka istamal pasand karte hain. Grammar ke terms mai ek word jo se ziada se ziada nouns se muntaqil hota hai, use compound noun kehte hain. Is case mai last noun gender ko define kartha hai:</p> <p> de Wein + die Flasche = > die Weinﬂasche (wine bottle)</p> <p> das Telefon + die Nummer = das Telefonnummer (telephone number)</p> <p> der Computer + das Spiel = das Computerspiel (computer game)</p>"
            },
            {
                "title": "Types of Nouns",
                "content": "<p>Kuch khaas type ke nouns bhi hote hain:</p> <p>-chen das Mädchen, das Märchen (girl, fairy tale)</p> <p>-lein das Fräulein, das Männlein (Miss, little man)</p> <p>-ma das Klima, das Thema (climate, theme/topic)</p> <p>-ment das Dokument, das Instrument (document, instrument)</p> <p>-o das Kino, das Büro (cinema, office)</p> <p>-um das Album, das Zentrum (album, centre)</p> <p>Young persons das Baby, das Kind (baby, child)</p> <p>Infinitives used as nouns das Singen, das Tanzen (singing, dancing)</p> <p>Names of most metals das Silber, das Gold (silver, gold)</p>"
            }
        ],
        "level": "A1",
        "id": 43
    },
    {
        "unit_name": "Plurals of articles",
        "learning_content": [
            {
                "title": "Moarif Aar Maqarir",
                "content": "Ap phle hi dekh chuke hain keh tehqiqi aar moarif teen mukhtalif wahid hote hain: der, die and das. Jamid sab dee hain.<p>"
            },
            {
                "title": "Ghair Moarif Maqarir",
                "content": "Ghair moarif maqarir (Jo English mai ‘a’ hota hai) muzakkar naam lye 'ein', moannis naam lye 'eine' or munsalik naam lye phir 'ein' hota hai."
            },
            {
                "title": "Maqarir tabdeel hosakte hain",
                "content": "Zyada pechida dhanchon mein, dono moarif aur ghair moarif aar maqarir thore se badal sakte hain. Mazeed malomat ke liye, units 10–14 dekhein."
            },
            {
                "title": "Ahem Nishandahi ka Khulasa",
                "content": "Ye aik khulasa hai jo ahem isharat ka kaam deti hai, keh German mai naun ka jins kesay pechan sakte hain. Masculine '(jins muzakar) ein, Feminine (jins maada) eine Neuter (jins munsalik) ein'"
            }
        ],
        "level": "A1",
        "id": 44
    },
    {
        "unit_name": "Unit 8",
        "learning_content": [
            {
                "title": "Exercise 8.1",
                "content": ""
            },
            {
                "title": "Exercise 8.2",
                "content": ""
            }
        ],
        "level": "A1",
        "id": 45
    },
    {
        "unit_name": "Unit 8",
        "learning_content": [
            {
                "title": "Exercise 8.4",
                "content": "<p>Translate the following sentences.</p><br><p>1 Ferrari bohat tez hai.</p><p>2 Mez aur khirki tooti hui hai.</p><p>3 Beti ka naam Marianna hai.</p><p>4 Akhbar bohat mehnga hai.</p><p>5 Gulab bohat khubsurat hai.</p><p>6 Cinema band hai. (closed = geschlossen)</p><p>7 Football team buri hai.</p><p>8 Beer ki qeemat 2 euro hai.</p><p>9 Sheher ke markaz bohat purana hai.</p><p>10 Kya computer naya hai?</p><p>11 Larki paanch saal ki hai aur larka saat saal ka hai.</p><p>12 Cheese France se hai.</p>"
            }
        ],
        "level": "A1",
        "id": 46
    },
    {
        "unit_name": "Unit 8",
        "learning_content": [
            {
                "title": "Kyun gender German ki taleem kay liye itna important hai? Grammatical gender ka kya matlab hai?",
                "content": "<p> Ye samajhna bohat zaroori hai kyun gender German language kay liye itna important hai. Grammatical gender ka matlab yeh hota hai kih German language main har noun ka aik gender hota hai jo masculine, feminine ya neuter ho sakta hai.</p>"
            },
            {
                "title": "Kya aap masculine, feminine, neuter nouns kay liye deﬁnite and indeﬁnite articles pesh kar saktay hain?",
                "content": "<p>German zabaan main har noun ya toh masculine, feminine ya neuter hota hai. In sab ki apni definite aur indefinite articles hoti hain. Yeh samajhna zaroori hai kyun kih yeh articles German grammar ka aham hissa hain.</p>"
            },
            {
                "title": "Konse indicators yeh wazahat kartay hain kih aik noun masculine, feminine, neuter hai?",
                "content": "<p> Nouns kih gender ko identify karnay ka aik tariqah yeh hai kih aap noun kih ending par nazar dalain. Mukhtalif genders ki mukhtalif endings hoti hain.</p>"
            },
            {
                "title": "Kya aap wo categories list kar saktay hain jis main nouns aam taur par masculine, feminine, neuter hotay hain?",
                "content": "<p>German zabaan main kuch specific rules hain jin ki base par nouns ko unki gender milti hai. In rules ki samajh bohat zaroori hai.</p>"
            },
            {
                "title": "German nouns ki spelling kis tarah distinctive hai?",
                "content": "<p>German nouns ki spelling unki uniqueness aur distinctiveness ka sabab hoti hai. Har noun ki spelling uski gender aur meaning ko represent karti hai.</p>"
            }
        ],
        "level": "A1",
        "id": 47
    },
    {
        "unit_name": "Unit Nine",
        "level": "A1",
        "learning_content": [
            {
                "title": "Plural of nouns",
                "content": "Jab nouns sirf aik item ki taraf reference kartay hain, to grammatically woh singular form ma hotay hain. Agar aap ek se zyada item ke baare me baat kar rahe hain to aap plural ka istemaal kartay hain."
            },
            {
                "title": "Plurals in English",
                "content": "<p>English me, nouns kay plural forms banana relatively asaan hota hai - aam taur par sirf '-s' shamil kiya jata hai:</p><p>'a cigarette' → 'two cigarettes', 'a house' → 'ﬁve houses'.</p><p>Exceptions include: 'a woman' → 'two women', 'a child' → 'three children'.</p>"
            },
            {
                "title": "Patterns in German",
                "content": "<p>German kay pas plural forms banana kay liye kai tareeqay hotay hain. Is liye ya mashwara hai kay jab ek nai word seekhain to us ka plural form bhi seekhain. </p><p>But as with gender there are patterns for typical endings, or plural formations for masculine, feminine and neuter nouns. </p><p>Here is an overview.</p>"
            },
            {
                "title": "Clues for masculine nouns",
                "content": "<pre>Adding -e The great majority of masculine nouns form their plural by just adding -e:</pre>"
            }
        ],
        "id": 48
    },
    {
        "unit_name": "Unit 9",
        "learning_content": [
            {
                "title": "Noun Endings: -er, -el or -en",
                "content": "Noun jo -er, -el ya -en khatam hotay hain, in mein aksar koi tabdeeli nahi hoti hai ya kabhi kabhi umlaut shaamil hota hai. Yaad rakhein, ye sirf hidayaat hain, kuchh ajeeb iktitafat hain jaisa ke der Mann → die Männer."
            },
            {
                "title": "Feminine Noun Indications",
                "content": "-n ya -en ka izafa. Aksar khawateen ke naam -n ya -en ka izafa karti hain:"
            },
            {
                "title": "Umlaut + -e Ending",
                "content": "Kuch aam istemal kiye jane wale female nouns mein Umlaut: + -e ka izafa hota hai. Misal ke liye: der Beruf (job) → die Berufe (jobs), der Film (film) → die Filme (films), der Tisch (table) → die Tische (tables)"
            },
            {
                "title": "Nouns with no ending or just umlaut",
                "content": "Kuch nouns khatam nahi hotay hain ya sirf umlaut hotay hain. Misal ke liye: der Kuchen (cake) → die Kuchen (cakes), der Apfel (apple) → die Äpfel (apples)"
            },
            {
                "title": "Noun endings: -n or -en",
                "content": "Bohat saray noun -n ya -en khatam hotay hain. Misal ke liye: die Frau (woman) → die Frauen (women), die Zeitung (newspaper) → die Zeitungen (newspapers), die Tasse (cup) → die Tassen (cups), die Sprache (language) → die Sprachen (languages)"
            },
            {
                "title": "Noun endings: -e + umlaut",
                "content": "Kuch nouns -e + umlaut k sath khatam hotay hain. Misal ke liye: die Hand (hand) → die Hände (hands), die Stadt (city) → die Städte (cities)"
            }
        ],
        "level": "A1",
        "id": 49
    },
    {
        "unit_name": "Unit 9",
        "learning_content": [
            {
                "title": "Neuter nouns: Adding -e",
                "content": "Aksariyat neuter nouns mein humein -e jodna parta hai magar koi umlaut nahi:  - das Bein (tang) ban jata hai die Beine (tangain) mein end hone wala '-e' - das Haar (baal) ban jata hai die Haare (baal) mein '-e' end hone wala - das Jahr (saal) ban jata hai die Jahre (saal) mein '-e' end hone wala"
            },
            {
                "title": "Neuter nouns: Adding umlaut + -er",
                "content": "Aik aam ending '-er' hoti hai, jahan asal stem vowel mein a, o, ya u hota hai:  - das Kind (bacha) ban jata hai die Kinder (bachay) mein '-er' end hone wala - das Buch (kitab) ban jati hai die Bücher (kitaben) mein, jahan umlaut + '-er' hai"
            },
            {
                "title": "Nouns ending in -chen or -lein",
                "content": "Nouns jo '-chen' ya '-lein' pe khatam hote hain, plural mein un mein koi tabdeeli nahi ati:  - das Mädchen (ladki) ban jati hai die Mädchen (ladkian) mein, jahan koi ending nahi hoti"
            },
            {
                "title": "Foreign words",
                "content": "Jin foreign words ko German mein English ya French se 'import' kiya gaya hota hai, un mein aam tor pe '-s' add hota hai:  - der Chef (boss) ban jata hai die Chefs (bosses) mein - die Party (party) ban jati hai die Partys (parties) mein - das Team (team) ban jati hai die Teams (teams) mein"
            }
        ],
        "level": "A1",
        "id": 50
    },
    {
        "unit_name": "Unit 9",
        "learning_content": [
            {
                "title": "Taraash plural Dictionary se",
                "content": "<p>Agar aap ko aik noun ka plural form nahin maloom, aap dictionary mein isko talashi sakty hain. Plural form aam tor per teesry number per diya jata hai, jo gender aur noun ka genitive ending k baad ata hai:</p><br><p>Beruf m, -(e)s, -e occupation, job → Yahan plural diya gaya hai -e: Berufe</p><br> <p>Reise f, -, -n journey, trip → Yahan plural diya gaya hai -n: Reisen</p>"
            },
            {
                "title": "Plural mein Umelaut ki Zarorat",
                "content": "<p>Agar aap noun ki ending dekh rahy hain or wahan -¨ diya hua hai, iska matlab hai k aik umlaut ki zarorat hai. <br>Vater m, -s, -¨ father → Is liye plural Väter hona chahye. <br>Kuch cases mein umlaut k sath sath dosri ending bhi chahye hoti hai: Hand f, -, -¨e hand → Yahan apko umlaut or -e dono add karne parenge: Hand turns into Hände</p>"
            },
            {
                "title": "Yaad Rekhne waly Points",
                "content": "<p>Yahan most common plural noun endings ka aik summary hai: <br> -e <br>-er (+ umlaut) <br>-n or -en <br>-s <br> koi ending nahi <br> Nouns jin k endings -chen or -lein hain: das Mädchen → die Mädchen <br> Nouns jinhon ne -el, -en, -er k sath endings: der Spiegel → die Spiegel <br> Aksar woh umlaut add karte hain: der Vater → die Väter</p>"
            }
        ],
        "level": "A1",
        "id": 51
    },
    {
        "unit_name": "Unit 9",
        "learning_content": [
            {
                "title": "Mashq 9.1",
                "content": "Diye gaye maloomat ka istemal karte hue, darj zeel ismin jama banaen. Pehla aap ke liye kar diya gaya hai"
            },
            {
                "title": "Mashq 9.2",
                "content": "Darj zeel ismin jama dijiye. Misal ke taur par: die Flasche → die Flaschen"
            },
            {
                "title": "",
                "content": ""
            }
        ],
        "level": "A1",
        "id": 52
    },
    {
        "unit_name": "UNIT DAS",
        "learning_content": [
            {
                "title": "Char Cases",
                "content": "<p>Ye Unit app ko German ke basic rules par aik mukhtasir jaiza denay ki koshish karay ga jin ka talluq cases se hai. Unit 11-14 har case ko detail main samjhaen ge aur examples aur exercises den ge.</p>"
            },
            {
                "title": "Cases kia hain?",
                "content": "<p>Nouns (jaisa ke 'aadmi', 'ghar', 'kutta') aik sentence main mukhtalif kirdar ada kartay hain. Misal ke taur par, aik noun jo ho raha hai us ka agent ho sakta hai ( 'Dog bites man') ya phir woh position main ho sakta hai jahan verb ka action us par ho ( 'Dog bites man'). German main, ye mukhtalif kirdar case ke zariye signal kiye jatay hain. Mukhtalif cases ko endings main dikhaya jata hai.</p>"
            },
            {
                "title": "Ye English se kaise muqabla karta hai?",
                "content": "<p>English main, noun ye mukhtalif kirdar sentence main ada karta hai. Aap jante hain ke aik noun tab subject hota hai jab woh verb se pehle ata hai. Agar yeh object hai, toh woh verb ke bad ata hai. Lekin aam tor par case zahir nahi hota, siwaye jab aap pronouns use karte hain: 'he'/'she’/'it' etc.: <br/>Peter loves Mary. <br/>He loves her. <br/>Mary loves Peter. <br/>She loves him.</p>"
            },
            {
                "title": "German main char cases",
                "content": "<p>German main char mukhtalif cases hain. Har case ko sentence ke aik khas kirdar, ya 'function', se jora ja sakta hai.</p>"
            }
        ],
        "level": "A1",
        "id": 53
    },
    {
        "unit_name": "Unit 10",
        "learning_content": [
            {
                "title": "Nominative Case",
                "content": "<p>Nominative case tab use hota hai jab kisi noun ko sentence ka subject banaya jata hai, yani ki jo 'action' ho raha hai uska 'agent' ('Kon kar raha hai action?'):</p> <p>The man is reading. (Mard padh raha hai.)</p>"
            },
            {
                "title": "Accusative Case",
                "content": "<p>Jab koi noun sentence main direct object ban jata hai, yaani 'action' ka 'receiver', to German main normally accusative case use hota hai ('Kin ya kya par asar kar raha hai action?'):</p><p>Der Mann liest einen Roman. (Mard ek novel padh raha hai.)</p>"
            },
            {
                "title": "Dative Case",
                "content": "<p>Dative case tab istemal hota hai jab kisi verb ke saat ek second object bhi ho, matlab indirect object ('Kis ke liye, ya kiske liye kia jaa raha hai action?').</p><p>Der Mann gibt der Frau einen Roman. (Mard aurat ko novel de raha hai.)</p>"
            },
            {
                "title": "Genitive Case",
                "content": "<p>Genitive case tab use hota hai jab do noun ke beech ka rishta batana ho. Ye batata hai ki ek cheez dusri ke 'belongs' hai.</p><p>Der Hut des Mannes. (Mard ka topi.)</p>"
            },
            {
                "title": "Why are cases important?",
                "content": "<p>Cases decide karte hain ki definite articles ('the' – der, die, das), indefinite articles ('a' – ein, eine, ein) aur nouns ke saath linked words ke endings kya honge (Units 11–14 ke liye aur dekhen). Dekhiye ek quick overview ki kis tarah se ye chaar cases affect karte hain indefinite article aur the definite article.</p>"
            },
            {
                "title": "The indefinite article",
                "content": "<p>Nominative, Accusative, Dative, Genitive</p><p>Masculine: ein, einen, einem, eines<p><p>Feminine: eine, eine, einer, einer<p><p>Neuter: ein, ein, einem, eines<p>"
            }
        ],
        "level": "A1",
        "id": 54
    },
    {
        "unit_name": "Yaqeeni Artikel",
        "learning_content": [
            {
                "title": "Faktors jinhain case tayyar kar rahe hain",
                "content": "<p>Case tayyar karne ke liye teen faktors hote hain. Hum ne un mein se aik ko upar wazeh kiya hai: case noun ka role tay karta hai jo sentence mein play kar raha hota hai; kya yeh subject hai ya object?</p><br><p>Do aur factors hain, jo decide karte hain ki kis case ka use hona chahiye: verb, aur sentence mein prepositions.</p>"
            },
            {
                "title": "Verbs",
                "content": "<p>Verb muktasir ke case ko tay karti hain: </p><br><ul><li>Zyadatar verbs accusative ki zaroorat hoti hai.</li><br><li>Kuch specific verbs hamesha dative ki zaroorat hoti hain (jaise, helfen ‘to help’ ya gehören ‘to belong’).</li><br><li>Bohot kam verbs genitive case ko leti hain.</li></ul><p>Agar aapke pass aik verb hai jo dative case ki zaroorat hoti hai, to German sentence mein object ko dative mein hi rakha jata hai, bhale hi yeh English mein direct object ho:</p><br><p>Der Mann hilft der Frau.</p><br><p>The man helps the woman.</p><br><p>German mein, 'the woman' dative case (der Frau) mein hota hai kyunke helfen wo verb hai jis ke baad aapko hamesha dative use karna hota hai.</p>"
            },
            {
                "title": "Prepositions",
                "content": "<p>German mein prepositions (jaise English mein ‘at’, ‘on’, ‘to’, ‘for’) aik specific case ki zaroorat hoti hai.</p><br><table> <tr> <th>nominative</th> <th>accusative</th> <th>dative</th> <th>genitive</th> </tr> <tr> <td>der (mardana)</td> <td>den (mardana)</td> <td>dem (mardana)</td> <td>des (mardana)</td> </tr> <tr> <td>die (khawateen)</td> <td>die (khawateen)</td> <td>der (khawateen)</td> <td>der (khawateen)</td> </tr> <tr> <td>das (neuter)</td> <td>das (neuter)</td> <td>dem (neuter)</td> <td>des (neuter)</td> </tr></table>"
            }
        ],
        "level": "A1",
        "id": 55
    },
    {
        "unit_name": "Unit 10",
        "learning_content": [
            {
                "title": "Grammar Principle: Case usage in Prepositions",
                "content": "<p>Kuch prepositions accusative ko consider kartay hain (for example 'durch' which means 'through' ya 'für' which means 'for').</p><p>Kuch prepositions dative ko consider kartay hain (for example 'mit' which means 'with' or 'von' which means 'from').</p><p>Genitive ko consider karnay wali Prepositions buhat kam hoti hain.</p>"
            },
            {
                "title": "Accusative Case Example",
                "content": "<p>Agar apki pas koi aisi preposition hai jo accusative case ko consider karti hai, toh German sentence mei object must be accusative, kahin wo English mai indirect object kyun na ho.</p><p>Example: 'Ich kaufe einen Roman für meinen Freund'. English translation would be 'I’m buying a novel for my friend'.</p><p>English mai, 'for my friend' indirect object hain, but in German 'für meinen Freund' accusative case mai hota hai because 'für' einnek esi preposition hai jiske baad accusative case ko consider karna padhta hai.</p>"
            },
            {
                "title": "Summary of Basic Principles",
                "content": "<p>Cases ka use teen principles par tay hota hai:</p><ol><li>Whether the noun is the subject or the object of the sentence,</li><li>The verb, and</li><li>Any prepositions used.</li></ol><p>Yeh khasi ahmiyat rakhta hai ke aap yeh sekhen ke konse verbs dative leti hain or konse prepositions konse case ko govern karti hain.</p>"
            }
        ],
        "level": "A1",
        "id": 56
    },
    {
        "unit_name": "Unit 10",
        "learning_content": [
            {
                "title": "Mashq 10.2",
                "content": "Mashq 10.2 main aapko mukhtalif sets of sentences deya gaya hain. Aapko in sentences se objects identify karne hain aur unhen 1 aur 2 main number karna hain. Kya aap yeh samajh sakte hain ke kon sa object accusative case main hai aur kon sa dative case main? Aap oper diye gaye tables ko check kar sakte hain endings ke liye.  Misal ke toor pe, 'Sie gibt dem Mann eine Zigarette.' main, 'dem Mann' (1), aur 'eine Zigarette' (2) hain.  (1) 'dem Mann' dative case main hote hain (ise kuch dia ja raha hai)  (2) 'eine Zigarette' accusative case main hota hai."
            },
            {
                "title": "Mashq 10.3",
                "content": "Neeche diye gaye dono tables main aapko wo endings ke against tick lagana hai jo nominative se different hain. Aapko har ek ke liye ek example diya gaya hai.  Mutaen shay: accusative dative genitive masculine einen einem eines feminine eine einer einer neuter ein einem eines  Makhsos shay: accusative dative genitive masculine den dem des feminine die der der neuter das dem des."
            }
        ],
        "level": "A1",
        "id": 57
    },
    {
        "unit_name": "Unit 10",
        "learning_content": [
            {
                "title": "Checklist",
                "content": "<p>1. Kitne asool German k cases ko govern karte han?<br> 2. Kya aap inn principles ko provide kar sakty han?<br> 3. Aap kon sa case subject k liye use karte han?<br> 4. Aap normally kon sa case direct object k liye use karte han?<br> 5. Aap normally kon sa case indirect object k liye use karte han?<br> 6. Kon si words ya words k parts change hojate han jab aap different cases use karte han?<br> 7. Kab ek 'indirect' object accusative case me hota hai?<br> 8. Kab ek 'direct' object dative case me hota hai?</p>"
            }
        ],
        "level": "A1",
        "id": 58
    },
    {
        "unit_name": "Unit Gyara",
        "level": "A1",
        "learning_content": [
            {
                "title": "Nominative case kiya hai?",
                "content": "<p>German mein nominative case ka istemal tab hota hai jab noun subject hota hai sentence mein -  yani koi shakhs ya cheez jo koi kaam kar rahi ho.<br></p>"
            },
            {
                "title": "Nominative case ke misal",
                "content": "<p>Yahan kuch misalon mein nouns nominative case mein diye gaye hain:<br> <ul><li>Der Mann hört Musik. - Aadmi music sun raha hai.</li> <li>Die Frau liest das Buch. - Aurat kitab parh rahi hai.</li><li>Das Kind kauft einen Apfel. - Bacha seb khareed raha hai.</li><li>Die Gäste wollen es nicht. - Mehman isey nahi chahte.</li></ul></p>"
            },
            {
                "title": "Nominative case mein endings",
                "content": "<p>Jaisa ke Unit 10 mein bataya gaya tha, cases German mein ahem hain kyun ke wo nouns se jure alag alag alfaz ke endings par asar dalte hain. Yahan sabse aam endings ka jayeza diya gaya hai:<br></p>"
            },
            {
                "title": "Sein aur werden ke baad nominative case",
                "content": "<p>Sein 'to be' aur werden 'to become' ke baad bhi nominative case ka istemal hota hai:<br></p>"
            },
            {
                "title": "Modiﬁer",
                "content": "<p> <ul><li>Mard - der Mann</li><li>Aurat - die Frau</li><li>Bache - das Kind</li><li>Mehman - die Gäste</li></ul></p>"
            },
            {
                "title": "Muayaan articles",
                "content": "<p><ul><li>ein Mann - aik mard</li><li>eine Frau - aik aurat</li><li>ein Kind - aik bacha</li><li>Gäste - mehman</li></ul></p>"
            },
            {
                "title": "Manfi article",
                "content": "<p><ul><li>kein Mann - koi mard nahi</li><li>keine Frau - koi aurat nahi</li><li>kein Kind - koi bacha nahi</li><li>keine Gäste - koi mehman nahi</li></ul></p>"
            },
            {
                "title": "Possessive",
                "content": "<p><ul><li>mein Mann - mera mard</li><li>meine Frau - meri aurat</li><li>mein Kind - meri bacha</li><li>meine Gäste - mere mehman</li></ul></p>"
            }
        ],
        "id": 59
    },
    {
        "unit_name": "Unit 11",
        "learning_content": [
            {
                "title": "Jumla formation",
                "content": "<p>Woh aik dilchasp insan hai. Yeh aik acha din hoga. Lekin yeh hamesha wazeh nahi hota, kyun ke aap kabhi kabhi German mein in verbs ke sath unmei aur indefinite article ka istemal nahi kartey. Woh aik engineer hai. Woh aik ustaad banney wali hai.</p>"
            },
            {
                "title": "How to spot the nominative case",
                "content": "<p>Muzo hamesha jumla ki shuruaat par nahi hota: <br/>Kal class Berlin ja rahi hai. <br/>Khana khaney ke baad, woh ek espresso peeta hai.<br/>Aik asan tareeka yeh hai ke jumla ka muzo talash karne ke liye 'Kaun ya kya kar raha hai?' pooche. Kal kon Berlin ja raha hai? Class. Kaun Espresso pee raha hai? Woh pee raha hai.</p>"
            }
        ],
        "level": "A1",
        "id": 60
    },
    {
        "unit_name": "Unit 11",
        "learning_content": [
            {
                "title": "Exercise 11.3",
                "content": "<p><b>Translate the following sentences.</b></p> <p>1 Yeh aik ghar hai.<br/>2 Ghar bohat purana hai.<br/>3 Admi ka naam Mario hai.<br/>4 Woh aik engineer hai.<br/>5 Akhbar bohat dilchasp hai.<br/>6 Aldi Germany mein aik supermarket hai.<br/>7 Bache kon hain?</p>"
            },
            {
                "title": "Checklist",
                "content": "<p>1 Jab noun nominative case mein hota hai toh iska sentence mein kya kaam hota hai?<br/>2 Kaunse do verbs ke baad aap nominative use karte hain?<br/>3 Kaise aap sentence mein subject ko spot kar sakte hain?</p>"
            }
        ],
        "level": "A1",
        "id": 61
    },
    {
        "unit_name": "Unit Bara (UNIT TWELVE)",
        "learning_content": [
            {
                "title": "Quboolia Surat (The accusative case)",
                "content": "German adat ke mutabiq, jab ism moa'ni maf'ool banta hai, yani jumla mei'amal ka markaz banta hai, to hum Quboolia case istemaal karte hai. Misal ke taur par, <p> Der Mann kauft den Computer. (mard computer khareedta hai.</p> Muzakar istilaahat mei tabdeelian aa jati hain. Quboolia case me, muzakar nouns ke liye moarif (jaise der, yar aik dia gaya article) taqseem karte hain:  • der ko den bana dia jata hai or • aik ko einen bana dia jata hai. Jabkay ma'annas, khasiya tammaz, Jama' Mazi mei koi tabdeelian aati hi nahi."
            },
            {
                "title": "Quboolia Case mei Izafiyat (Endings in the accusative case)",
                "content": "<p> Yahan aam moarifat ke Quboolia Izafiyat ka jaiza hai:</p> Jaisa ke aap dekh sakte hain, tamam muzakar moarifat ki izafiyat -en hoti hai. "
            },
            {
                "title": "Moarifat (Modifiers)",
                "content": "<table> <tbody> <tr><th>Moarif (Modifier)</th><th>Muzakar (Masculine) </th><th>  Ma'annas (Feminine) </th><th> Khasiya tammaz (Neuter) </th><th> Jama' Mazi (Plural) </th> </tr>  <tr><td> Moarif Haqiqi (Definite articles) </td><td> den Mann </td><td> die Frau </td><td> das Kind </td><td> die Gäste </td></tr>  <tr><td> Moarif Ghair Haqiqi (Indefinite articles) </td><td> einen Mann </td><td> eine Frau </td><td> ein Kind </td><td> – Gäste </td></tr>  <tr><td> Moarif Manfi (Negative article) </td><td> keinen Mann </td><td> keine Frau </td><td> kein Kind </td><td> keine Gäste </td></tr>  <tr><td> Hamiati (Possessive) </td><td> meinen Mann </td><td> meine Frau  </td><td> mein Kind </td><td> meine Gäste </td></tr>  </tbody> </table>"
            }
        ],
        "level": "A1",
        "id": 62
    },
    {
        "unit_name": "Unit 12: Accusative Case in German Language",
        "learning_content": [
            {
                "title": "Accusative Case Usage with Verbs",
                "content": "Aap accusative case zyadatar verbs k baad use kartay hain. Darasal, German verbs jo aik (direct) object letay hain, accusative case letay hain. Accusative case laynay walay verbs ko hum transitive verbs kehtay hain. Dictionary mein, headword k baad 'vt' ki mukhtasir form hogi jo is ki nishandahi kar rahi hoti hai. Agar aap aik verb daakhilay par aik 'vt' dekhtay hain, toh aap jantay hain k yeh verb accusative case leta hay.<br>"
            },
            {
                "title": "Accusative Case Usage with Prepositions",
                "content": "Aap accusative case kuch prepositions k baad bhi istemal kartay hain. Mandarjah zel prepositions hamesha accusative case laytay hain:<br/bis until<br/durch through<br/für for<br/gegen against, round<br>ohne without<br>um around, at<br>Ta'luq bananay k liye, ye misalain samajhain:<br><i>Hum abhi aik surang k zariye guzar rahay hain.</i><br><i>Kya aap is company k liye kaam kartay hain?</i><i>Woh is offer k khilaf hain.</i>"
            },
            {
                "title": "Examples of Accusative Case Usage",
                "content": "Nominative - Accusative<br>der Stuhl - Mein Stuhl khareed raha hoon.<br>die CD - Woh CD sunn raha hai.<br>das Auto - Kya aap car drive karte hain?<br>ein Regenschirm (m) - Mere paas aik chhatri hai.<br>eine Cola (f) - Mein aik Coca Cola lun ga.<br>ein Bier (n) - Woh aik beer pi rahi hai.<br>der Hunger - Mujhe bhook nahi hai.<br>ihr Bruder (m) - Woh apnay bhai ki yaad kar rahi hai."
            }
        ],
        "level": "A1",
        "id": 63
    },
    {
        "unit_name": "Unit 12",
        "learning_content": [
            {
                "title": "Accusative case ka istimal",
                "content": "Accusative case zyada tar direct object k liye istimal kiya jata hai sentence me. Lekin ye verb ya certain prepositions k upar bhi depend karta hai. Yani k aik sentence me 1 se zyada accusative form ho saktay hain. <br> <br> Na bholain k, feminine, neuter, aur plural nouns k sath, modifier k endings accusative me change nahi hoti aur wohi rehti hain jaisi k nominative me hoti hain."
            },
            {
                "title": "Zyada se zyada ek accusative sentence me",
                "content": "Jaisa k upar samjhaya gaya hai, accusative case ka use sirf noun k position pe depend nahi hota jaisa k English me direct object hota hai. Accusative case ka use verb aur kuch prepositions k upar bhi depend hota hai. Yani k ek sentence me zyada se zyada ek accusative form bhi ho sakta hai."
            },
            {
                "title": "Accusative case – Asal points",
                "content": "Accusative case zyada tar direct object k liye sentence me istimal hota hai. Lekin is ka use verb aur kuch prepositions k upar bhi determine hota hai."
            }
        ],
        "level": "A1",
        "id": 64
    },
    {
        "unit_name": "Unit 12",
        "learning_content": [
            {
                "title": "Instructions",
                "content": "<p>You are given a context you need to translate only the English content to Roman Urdu and make the content better. Divide the content into the following pieces: unit_name, learning_content. In the learning_content, we can have multiple titles and content related to that title. Note that there can be multiple titles and contents and we have a level that will be A1.</p>"
            },
            {
                "title": "Translation Task",
                "content": "<p>Translate the following sentences:</p> <ul> <li>Main aik coffee aur chai lunga.</li> <li>Main aik bottle beer lunga.</li> </ul>"
            },
            {
                "title": "Further Instructions",
                "content": "<p>Create this JSON object. Remember you just need to convert only the English to Roman Urdu, not German to Roman Urdu and make the content better and easily readable for the reader. The content will be shown on HTML and CSS so use <b>&lt;br&gt;</b> and <b>&lt;tab&gt;</b> tags so that formatting of the content is better for the reader when they see the content on the web page.</p>"
            }
        ],
        "level": "A1",
        "id": 65
    },
    {
        "unit_name": "Unit 12",
        "learning_content": [
            {
                "title": "Context Translations",
                "content": "<p>3 Wo mera bhai aik sausage kha raha hai.</p> <p>4 Wo admi computer khareed raha hai.</p> <p>5 Wo aurat video recorder khareed rahi hai.</p> <p>6 Bacha kitab parh raha hai.</p> <p>7 Kitab meri behan k liye hai.</p> <p>8 CD mery bhai k liye hai.</p> <p>9 Hum park se guzar rahy hain.</p> <p>10 Mein is idea k haq mein hoon. ('in favour of' = ke liye)</p>"
            },
            {
                "title": "Checklist Queries",
                "content": "<ol><li>Kab aap accusative case ka istemal kartay ho?</li> <li> Kya accusative case main tamam nouns k liye modifier endings change ho sakti hain?</li> <li>Lughat main aap kese maloom karain gay k verb accusative case lay ga ya nahi?</li> <li>Kya aap kuch verbs aur prepositions ka naam bata saktay hain jo accusative case require kartay hain? </ol>"
            }
        ],
        "level": "A1",
        "id": 66
    },
    {
        "unit_name": "UNIT THIRTEEN",
        "learning_content": [
            {
                "title": "<h2>Dative Case kiya hai?</h2>",
                "content": "<p>Dative case ka istemal mukhtalif cheezon ya logon k liye kiya jata hai, jin par kuch kia gaya ho. Misal k tor par: 'Der Lehrer gibt der Frau ein Buch' jo k english mein 'The teacher gives the woman a book' hota hai.</p>"
            },
            {
                "title": "<h2>Dative Case mein Tabdeeli</h2>",
                "content": "<p>Dative case mein, modifier (jaise k muarif aitraz, e.g der, ya ghair muarif aitraz, e.g ein) tabdeel hojata hai. Ye har jins k liye lagu hota hai: muzakar, moannis aur khas. Jama mein, aapko -en ya -n bhi shamil karna parta hai.</p>"
            },
            {
                "title": "<h2>Dative Case mein Ikhtitam</h2>",
                "content": "<p>Yahan, un sabse aam modifiers k liye dative forms ka aik jaiza hai: Yeh yaad rakhain k <ul><li> muzakar aur khas ikhtitamain aik jaisi hoti hain: -em shamil karein </li><li> moannis ikhtitam k liye -er shamil karein </li><li> Jama k liye modifier mein -en aur naam mein -en ya -n shamil karein.</li></ul></p><br><table><thead><tr><th>Modifier</th><th>Muzakar</th><th>Moannis</th><th>Khas</th><th>Jama</th></tr></thead><tbody><tr><td>Muarif Aitraz</td><td>dem Mann</td><td>der Frau</td><td>dem Kind</td><td>den Gästen</td></tr><tr><td>Ghair Muarif Aitraz</td><td>einem Mann</td><td>einer Frau</td><td>einem Kind</td><td>– Gästen</td></tr><tr><td>Manfi Aitraz</td><td>keinem Mann</td><td>keiner Frau</td><td>keinem Kind</td><td>keinen Gästen</td></tr><tr><td>Malkiyat</td><td>meinem Mann</td><td>deiner Frau</td><td>seinem Kind</td><td>unseren Gästen</td></tr></tbody></table>"
            }
        ],
        "level": "A1",
        "id": 67
    },
    {
        "unit_name": "Unit 13",
        "learning_content": [
            {
                "title": "Verbs Jo Dative Case Ke Zaroorat Rakhtay Hain",
                "content": "Kuch verbs hain jin k baad hum dative case use kartay hain. Sab se zaroori hain: helfen ‘maddad karna’, danken ‘shukriya adaa karna’, gehören ‘kisi ki milkiyat mein hona’, folgen ‘peecha karna’. Yeh verbs yaad karne ki koshish karen. Iska istemaal check karen:<br>der Mann - Mein dem Mann ki peecha kar raha hoon (I follow the man).<br>die Mutter - Bacha Maa ki milaap rakhta hai (The baby resembles the mother).<br>das Kind - Mein bachay ka shukriya kar raha hoon (I’m thanking the child).<br>die Gäste - Mein mehmanon ki madad kar raha hoon (I  help the guests)."
            },
            {
                "title": "Dative After Prepositions",
                "content": "Kuch prepositions k baad bhi dative ka use hota hai. Yeh hain:<br>aus: from, out of<br>außer: apart from<br>bei: at, near<br>gegenüber: opposite<br>mit: with, by (for means of transport)<br>nach: after, to<br>seit: since, for<br>von: from<br>zu: to<br> In ki kuch misaalein:<br>Er kommt aus der Türkei - Woh Turkey se hain (He’s from Turkey)<br>Außer den Meiers sind alle da - Siwaye Meiers, sab yahan hain (Except for the Meiers, everybody is here)<br>Ich arbeite bei der Firma Meier - Mai Meier company k liye kaam karta hoon (I work for (the company) Meier)<br>Er wohnt gegenüber der Kirche - Woh church k muqabil rehta hai (He lives opposite the church)<br>Ich fahre mit dem Auto - Mai car se jaoun ga (I’ll go by car)<br>Nach der Arbeit gehe ich  einkaufen - Kaam k baad, mai khareedari karne jaoun ga (After work, I’ll go shopping)<br>Wir fahren zu meiner Freundin - Hum meri dost k ghar ja rahay hain (We’ll go to my girlfriend’s)."
            }
        ],
        "level": "A1",
        "id": 68
    },
    {
        "unit_name": "Zyada se zyada ek dfa muarrikh ki Mojudgi",
        "learning_content": [
            {
                "title": "Muarykh in a Sentence",
                "content": "German main Muarykh fail ya preposition ki waja se hakoomat hoti hai, Ye aam hai ke wo sentence ya clause main se zyada aik baar aa raha ho. Nichay di gai misalain dekhen: <br>       <i>Ich helfe dem Jungen mit seinem Mantel.<br>       I help the boy with his coat. <br>        Sie folgen dem Mann und dann der Frau mit ihren Freunden. <br>       They follow the man and then the woman and her friends.</i>"
            },
            {
                "title": "Muarykh Case – The main points",
                "content": "German language main Muarykh case ka istimal Indirect object ke liye hota hai. Lekin ye kuch khaas failon aur kuch prepositions ke baad aa sakta hai. <br>       Sabhi nominative se mukhtalif hain: <br>       - masculine aur neuter endings hain -em <br>       - feminine endings hain -er <br>       - plural endings hain -en jo modifier ke sath juda hua hota hai aur -en ya -n jo noun ke sath joda hota hai. <br>       <i>For more information on prepositions see Unit 24. <br>       For more information on pronouns see Unit 15. <br>       For dative endings in adjectives see Unit 23.</i>"
            }
        ],
        "level": "A1",
        "id": 68
    },
    {
        "unit_name": "Unit 13",
        "learning_content": [
            {
                "title": "Translation Exercise",
                "content": ""
            },
            {
                "title": "Example Sentences",
                "content": "<p>1. Wo larki baby ko kitab daiti hai. </br>2. Paulina bacche ko CD deti hai. </br> 3. Wo dada ko sharaab ki botal deta hai. </br> 4. Wo us aadmi ke peeche hai. </br> 5. Yeh telephone driver ke paas hai. </br> 6. Peter larki madad karta hai. </br> 7. Wo bachon ko football deta hai. </p>"
            }
        ],
        "level": "A1",
        "id": 69
    },
    {
        "unit_name": "Unit 13",
        "level": "A1",
        "learning_content": [
            {
                "title": "Teeno ahem cheezain jinhon ne dative case ka use tay kerdia",
                "content": "Which three factors determine the use of the dative case?"
            },
            {
                "title": "Kia dative case mein tamam nouns ke modifier endings ko tabdeel karna parta hai?",
                "content": "Do modiﬁer endings have to change for all nouns in the dative case?"
            },
            {
                "title": "Kya aap dative case ke liye sabse am modifier endings ka naam bata sakte hain?",
                "content": "Can you name the dative endings for the most common modiﬁers?"
            },
            {
                "title": "Dative case mein kia noun ke end par bhi endings hoti hain?",
                "content": "Are there also endings to the noun itself in the dative case?"
            }
        ],
        "id": 70
    },
    {
        "unit_name": "UNIT FOURTEEN",
        "learning_content": [
            {
                "title": "The genitive case",
                "content": "<p>Kya hai genitive case? Genitive case zahir karta hai malikiyat ya ownership: Yeh hai mera baap ka bag.</p> <p>German mai kya mukhtalif hai? English aur German ka istemal bohat mushaba hai. Aik asal farq hai alfaz ka tarteeb. Jahan English mai genitive construction pehle ata hai, wahan German mai wo amooman noun ke bad ata hai. Niche diye gaye misalen dekhen:</p>"
            },
            {
                "title": "What’s different in German?",
                "content": "<p>Das ist die Tasche meines Vaters. Yeh hai mera baap ka bag.</p> <p>Das ist das Auto meiner Tante. Woh hain meri phuphi ki car.</p> <p>Das ist das Spielzeug meines Babys. Yeh hai mere bachay ki khilonay.</p> <p>Das ist die Meinung der Gäste. Woh hai mehmaano ki raye.</p><p>Jaisa ke maqool aur dative case, genitive bhi asar dalta hai khatimay pe(for example the indefinite and definite articles).</p>"
            },
            {
                "title": "Endings in the genitive case",
                "content": "<p>Yaha kuch aam khatimay ka jaiza hai genitive case mai:</p> <p>modifier masculine feminine neuter plural</p> <p>definite des Mannes der Frau des Kindes der Gäste</p> <p>indefinite eines Mannes einer Frau eines Kindes –</p> <p>possessive meines Mannes meiner Frau meines Kindes meiner Gäste</p>"
            }
        ],
        "level": "A1",
        "id": 71
    },
    {
        "unit_name": "Unit 14: German Genitive Case",
        "learning_content": [
            {
                "title": "Jinhen se asalat haasil hoti hai",
                "content": "<p>Jaisa ke aap dekh sakty hain, maardudhalat mein 'modiﬁers' muzakkar aur jinseeki mukhaalif, khufia aissam mein -es khatam hoti hain aur muanas aur Jamaat (tadaad zyada) aissam -er mein khatam hoti hain.</p>"
            },
            {
                "title": "Muzakkar aur Jins-e-khufia aissam",
                "content": "<p>Muzakkar aur Jins-e-khufia aissam aksar choty aissam (jasy ke der Mann → des Mannes) mein -es shamil kar detay hain aur zyada tar do ya do se zyada wazan (hecrat / silsilay) waly aissam mein -s shamil kar detay hain ( jasy ke der Computer → des Computers).</p>"
            },
            {
                "title": "Muanas ya Jamaat aissam koi khatma nhai letay",
                "content": "<p>Aissam jo muanas ya jamaat hotay hain, un mein koi khatma nhain hota.</p>"
            },
            {
                "title": "Koi apostrophe (saf-e-tar) nahi",
                "content": "<p>Jab muzakkar ya neuter nouns mein 's' shamil kiya jata hai, tab German mein koi apostrophe (saf-e-tar) nahi hota. Jab aap kisi shakhs ke naam ki taraf ishara karte hain, tab bhi yehi baat lagu hoti hai: for example, 'Das ist Peters Buch (Yeh Peter ki kitab hai)'</p>"
            },
            {
                "title": "Prepositions ke baad Genitive case",
                "content": "<p>Kuch prepositions hote hain jinhain Genitive case chahiye hota hai. Zada tar aam ye hote hain: Trotz (bawajud), Während (doran), Wegen (because of), (An)statt (bajaye). </p><p>Misaal ke liye, 'Während seiner Zeit' (uske doran ka wakt) aur 'Trotz ihres hohen Alters' (uski umar ke bawajood).</p><p>Shuruati satah par in forms ka istemal krna kam hi hota hai, lekin inka ilam hona acha hai.</p>"
            },
            {
                "title": "Baat cheet ki German",
                "content": "<p>Baat cheet ki German mein, genitive ko bara formal aur purana samjha jata hai. Isay replace karne ka aam tariqa 'von + dative' ka istemal hai:</p> <p>'Das ist das Auto meines Bruders' ko 'Das ist das Auto von meinem Bruder' mein tabdeel kiya jata hai.</p>"
            }
        ],
        "level": "A1",
        "id": 72
    },
    {
        "unit_name": "Unit 14: Zarf-e-Muzßf Ñlaih (Genitive Case) - Asal Nukta",
        "learning_content": [
            {
                "title": "Zarf-e-Muzßf Ñlaih (Genitive case) samajna",
                "content": "<p>Zarf-e-Muzßf Ñlaih do muzakkar aur mu'annis isim (nouns) ke darmiyan milkiyati talluk bayan karta hai. Angrezi aur German bhasha mein istemal bahut milta julta hai, lekin yaad rakhein ki sariniaze (modifiers) ke liye akhirat badal jati hain:</p> <ul><li>-es muzakkar aur alf sifat wale isim ke liye</li><li>-er zanana aur Jama' (plural) isim ke liye. </li></ul> <p>Matloba hay ke hazf (neuter) aur muzakkar isim main -(e)s lazim karain.</p>"
            },
            {
                "title": "Zarf-e-Muzßf Ñlaih (Genitive case) aam misalain aur mashq",
                "content": "<p>Yahan kuch aam misalain aur mashq kiya gaya hai:</p><p>Example: Das ist die neue Freundin meines Vaters.</p><p>Misal ki tarjama: Yeh meray walid ka naya dost hai.</p>"
            },
            {
                "title": "Zaida malumaat ke liye",
                "content": "<p>Zaida malumat ke liye harf-e-jar (prepositions) dekhein Unit 24.</p><p>Sifaat (pronouns) ke liye Unit 15 dekhein.</p><p>Maful bihi (dative) sifat ki akhiriyon ke liye Unit 25 dekhein. </p>"
            }
        ],
        "level": "A1",
        "id": 73
    },
    {
        "unit_name": "Unit 14",
        "learning_content": [
            {
                "title": "Exercise 14.3",
                "content": "<br>Translate the following sentences:<br>1<br>Ye mere bhai ki kitab hai.<br>2<br>Ye meri behan ki car hai.<br>3<br>Ye mere bachay ke dost hain.<br>4<br>Ye Paula ka bag hai.<br>5<br>Ye Boris Becker ki ghalati thi.<br>"
            },
            {
                "title": "Checklist",
                "content": "<br>1<br>Genitive case istemal karne ke do factors kon se hain?<br>2<br>Kya genitive case mein tamam nouns ke liye modifier endings change hoti hain?<br>3<br> Aap common modifiers ke endings ka naam bata sakte hain?<br>4<br>Kya genitive case mein noun ki khud mein bhi endings hoti hain?<br>"
            }
        ],
        "level": "A1",
        "id": 74
    },
    {
        "unit_name": "UNIT FIFTEEN: Personal Pronouns",
        "learning_content": [
            {
                "title": "Personal pronouns kiya hain?",
                "content": "<p>Aik personal pronoun aik lafz hota hai jo noun ki jagha leta hai, aam tor par aik shakhs ya cheez k liye: </p><p>Sara aik quiche laye gi. Wo aik quiche laye gi. </p><p>Ye aik noun group ya poori phrase ki jagha bhi le sakta hai: </p><p>Mere parosi ka ghar chori ho gaya hai. Ye chori ho gaya hai.</p>"
            },
            {
                "title": "Personal pronouns in German",
                "content": "<p>Ye german mai personal pronouns hain: </p><p>Jaisa k aap shayad pehle se jaante honge, German mai logon ko address karne k liye mukhtalif modes hote hain. Doston aur bachon k liye du/ihr ka istemal karein, aur jin logon ko aap achi tarah se nahi jaante hain aur jo aap se barhe hain, un k liye polite Sie ka istemal karein.</p>"
            },
            {
                "title": "",
                "content": "<table><tr><th>singular</th><th>plural</th></tr><tr><td>First person</td><td>ich<br>I<br>wir<br>we<br></td></tr><tr><td>Second person</td><td>du<br>you (informal)<br>ihr<br>you (informal)<br>Sie<br>you (formal)<br>Sie<br>you (formal)<br></td></tr><tr><td>Third person</td><td>er<br>he<br>sie<br>they<br>sie<br>she<br> es<br>it<br></td></tr></table>"
            }
        ],
        "level": "A1",
        "id": 75
    },
    {
        "unit_name": "Unit 15",
        "learning_content": [
            {
                "title": "Points to watch out for",
                "content": "<b>Verb endings:</b>Aakhir kar verb German mein badaltay hain jaisay subject hota hai. Ye hai aik mukhtasar summary regular verb endings ki.<br> <b>Spelling for ‘I’ and ‘you’:</b>Yahan note karain ke ich ‘I’ in German is amooman spelled with a lower-case i jab ye sentence ke aagay nahi hota. Formal ‘you’ Sie dosray hath par hamesha capital letter se start hota hai.<br> <b>Pronouns in German use the grammatical gender:</b>German mein, third-person pronouns grammatical gender ke mutabiq rakhay jatay hain. Ye English se mukhtalif hai, jahan third-person pronouns biologiocal gender par based hote hain: ‘he’/‘she’ for logon k liye, or ‘it’ for  cheezon ya concepts k liye.<br> <b>Masculine nouns:</b>Yahan note karain ke masculine nouns are replaced by er, insaano, janwaro or cheezon par farq nahi parta..<br> <b>Feminine nouns:</b>Feminine amooman sie se replace kiye jatay hain."
            }
        ],
        "level": "A1",
        "id": 76
    },
    {
        "unit_name": "Neuter nouns aur Pronouns ka Introduction",
        "learning_content": [
            {
                "title": "Neuter Nouns",
                "content": "Neuter nouns ko German language mein 'es' ky zariye replace kiya jata hai. Maslan. 'The kid is beautiful.' ko hum 'Es ist schön.' mein tabdeel kar saktay hain."
            },
            {
                "title": "Pronouns Variation",
                "content": "German language zara complex hai English ky comparison mein jab hum baat kar rahe hotay hain pronouns ki. Mehnat lazmi hai jab hum personal pronouns objects ki tarah use kar rahe hotay hain. Lekin English mein sirf kuch pronouns hi change hotay hain, baaki sab wese ky wese rehtay hain chahe aap unhen subject ky tor par use karain ya object ky:"
            },
            {
                "title": "Pronouns in accusative and dative cases",
                "content": "German mein takreeban tamam pronouns apni shakal badal letay hain. Aur yeh bhi depend kartay hain ky aap unhen accusative case mein istmal kar rahe hain ya dative. Maslan, agar pronoun kisi noun ky jaga ky kaam kar raha hota hai jo kay jumlay ki object ki haisiyat ikhtiyar karti hai, to phir pronoun ko mozu case mein hona parta hai, accusative ya dative"
            }
        ],
        "level": "A1",
        "id": 77
    },
    {
        "unit_name": "Unit 15",
        "learning_content": [
            {
                "title": "Accusative pronouns for the direct object",
                "content": "<p>Agar pronoun ek sentence main direct object hota hai, toh ye accusative form main hota hai:</p><p>'I see the man' translate hota hai 'Main usay dekhta hun'</p><p>'He buys the car' translate hota hai 'Wo car khareedta hai'</p><p>Aur yahan aur examples hain jin main pronoun direct object hai:</p><p>'Do you see me?' translate hota hai 'Kya tum mujhe dekhte ho?'</p><p>'I love you' translate hota hai 'Main tumse mohabbat karta hoon'</p><p>'Do you like her?' translate hota hai 'Kya tum usay pasand karte ho?'</p><p>'The laptop? I bought it.' translate hota hai 'Laptop? Main ne khareeda hai.'</p><p>'He is going to visit us.' translate hota hai 'Wo humain milne aane wala hai.'</p><p>'The CDs. Have you seen them?' translate hota hai 'CDs. Kya tumne unhe dekha hai?'</p>"
            },
            {
                "title": "Accusative pronouns after prepositions",
                "content": "<p>Note karein ke accusative case main similar condition 'through', 'for', 'against', 'without' aur 'around' jaisay prepositions k baad bhi hoti hai:</p><p>'The flowers are for you.' translate hota hai 'Phool tumhare liye hain.'</p><p>'I wouldn’t like to go without you.' translate hota hai 'Main tumhare bagair nahi jana chahta.'</p>"
            },
            {
                "title": "Pronouns in the dative case",
                "content": "<p>Agar pronoun ek sentence main indirect object hai, toh aapko dative pronoun ki zaroorat hoti hai:</p><p>'She shows the man the book.' translate hota hai 'Woh admi ko kitab dikhata hai.'</p>"
            }
        ],
        "level": "A1",
        "id": 78
    },
    {
        "unit_name": "Dative pronouns ba'ad prepositions aur verbs",
        "level": "A1",
        "learning_content": [
            {
                "title": "Dative pronouns ka istemaal ba'ad kuch prepositions aur verbs",
                "content": "Kuch khas prepositions aur verbs ke ba'ad dative pronoun ka istemaal bhi zaroori hota hai. Kuch aham verbs jo dative case ka istemaal karte hain we hain: tankhwa 'shukriya', madad 'madad', peecha 'peecha' <br>. Prepositions jo dative case mein liye jaate hain we hain: alawa 'alawa', se 'se, bahar', kareeb 'paas, kareeb', samne 'baraks', saath 'saath', ke ba'ad 'ke ba'ad, ki taraf', se 'se, liye', se 'se', ki taraf 'ki taraf'."
            },
            {
                "title": "Tamam form",
                "content": "Ye ek list hai zamairein dative case mein: <br> me 'mai', tum 'tum (informal)', tum 'tum', aap 'aap (formal)', aap 'aap', wo 'wo (male)', us 'us, wo', wo 'wo (female)', us 'us, wo', ye 'ye', us 'us', hum 'hum', hum 'hum, us', tum 'tum (informal)', tum 'tum', aap 'aap (formal)', aap 'aap', wo 'wo (they)', in 'in'.<br> Dhyan de us aur tum accusative case mein bhi wahi hain."
            },
            {
                "title": "Misaal",
                "content": "Mujhe botal-e-sharab do, barae karam. <br> Kya ye mobile tumhara hai? <br> Mai uske saath kaam nahi kar sakta. <br> Mujhe aapka shukriya ada karna chahiye.<br> Zyada tafseel ke liye prepositions dekhein Unit 24.<br>"
            }
        ],
        "id": 79
    },
    {
        "unit_name": "15. Istemaal Dative Pronouns",
        "level": "A1",
        "learning_content": [
            {
                "title": "Aam Istemaal walay Jumlay jo Dative case ya Dative pronoun mangtay hain",
                "content": "<p>Mazameen men kuch aise tadaad walay jumlay bhi hain jo dative case aur aam taur par aik dative pronoun ki zaroorat hoti hai:</p><p> <br> Wie geht es dir/Ihnen/euch? <br_> How are you? (Aap ka kaisa hai?)<br>_  Es geht mir gut. <br_> I am well. (Mujhe acha hai.)<br>_  Es tut mir Leid. <br_> I am sorry. (Mujhe ma'azrat chahye.)<br>_  Meine Nase/Mein Kopf tut mir weh. <br_> My nose/My head hurts. (Mera naak/Sir dard kar rha hai.)<br>_  Mir ist kalt/warm. <br_> I am cold/warm. (Mujhe thand/garmai lag rahi hai.)</p>"
            },
            {
                "title": "Sikhane ka Tip",
                "content": "<p>Lastly– don’t feel overwhelmed by the sheer number of different pronouns in German. As a beginner you will mostly use the nominative form (ich, du, er, sie, es etc.) and some common phrases (Wie geht es dir? etc.). The more exposure you have to the language, the more you will get used to the diﬀerent forms and the more conﬁdent you will feel about dealing with them.</p><p>Antim– German zuban men diﬀerent pronouns ki tadaad se na ghabrain. As a beginner aap aam taur par nominative form istemaal karain ge (jaisa ke ich, du, er, sie, es etc.) aur kuch aam phrases (jaisa ke Wie geht es dir? etc.). Zaban se aap jitna mukammil honge, aap in diﬀerent forms ki aadat karain ge aur inhen deal karne ke liye aap more conﬁdent mehsoos karain ge.</p>"
            },
            {
                "title": "Ibtedaai warzish 15.1",
                "content": ""
            },
            {
                "title": "Ibtedaai warzish 15.2",
                "content": ""
            }
        ],
        "id": 80
    },
    {
        "unit_name": "Unit 15",
        "learning_content": [
            {
                "title": "Exercise 15.4",
                "content": "<p>Es exercise kay sentences ko roman urdu main translate karein. Du aur Sie 'you' kay form kay sath. </p>"
            },
            {
                "title": "Sentence Translation",
                "content": "<p>1. Mujhe call karein. <br> 2. Phool aap kay liye hain. <br> 3. Kya aap humein visit karne wale hain? <br> 4. Aap kaise hain? <br> 5. Mein theek hoon. <br> 6. Kya aap meri madad kar sakte hain? <br> 7. Mujhe afsos hai. </p>"
            },
            {
                "title": "",
                "content": ""
            }
        ],
        "level": "A1",
        "id": 81
    },
    {
        "unit_name": "Unit 15",
        "learning_content": [
            {
                "title": "Kya aap accusative case mai saare personal pronouns jante hai?",
                "content": "Yeh checklist aapko accusative case mai saare personal pronouns yaad karne mai madad karega."
            },
            {
                "title": "Kya aap dative case mai saare personal pronouns jante hai?",
                "content": "Yeh checklist aapko dative case mai saare personal pronouns memorize karne mai madad karega."
            },
            {
                "title": "Grammatical gender ka kya matlab hota hai? Yeh personal pronouns ke liye kyun zaruri hai?",
                "content": "Grammatical gender personal pronouns ki understanding ke liye bohat zaruri hai. Yeh aapko pronouns ko behtar samajhne mai madad karta hai."
            },
            {
                "title": "Kaise faisle kare ki zaban ki kis surat mai personal pronoun ka istemal karain dative ya accusative case?",
                "content": "Yeh hawale se yeh checklist aapko sahi faisle lene mai madad dega ke aapko personal pronoun ka istemal kab aur kaise karna chahiye accusative ya dative case mai."
            }
        ],
        "level": "A1",
        "id": 82
    },
    {
        "unit_name": "UNIT SIXTEEN: Malikana sifat ke adjectives",
        "level": "A1",
        "learning_content": [
            {
                "title": "Malikana sifat ke adjectives kya hain?",
                "content": "<p> Malikana sifat woh lafz hain jaise ke 'mera', 'tumhara', 'uska', 'uski' jo iss baat ki nishaandahi karte hain ke kuch kisi ki milkiyat hai. </p>"
            },
            {
                "title": "Estemaal Angrezi aur German zabano mai",
                "content": "<p> Malikana sifat Angrezi aur German zuban mai kuch isi terhan estemaal hoti hain. Agar koi cheez mardane shakhs ki milkiyat mai hai, to mardana zamir 'uska' istemal hota hai keh yeh uski hai. Agar koi cheez kisi khawateen ki ya zyada se zyada logon ki milkiyat mai ho, to aap khawateen ka zamir 'uski' ya jamid zamir jaise 'humara' ya 'un ka' chunte hain. </p>"
            },
            {
                "title": "Malikana sifat ke adjectives German zabano mai",
                "content": "<p>Yeh ek jaiza hai malikana sifat ke adjectives ka: </p> <p>ich -> I -> mein (my)</p><p>du -> you (informal) -> tumhara (your)</p><p>Sie -> you (formal) -> Aapka (your)</p><p>er -> he -> uska (his)</p><p>sie -> she -> uski (her)</p><p>es -> it -> uska (his)</p><p>wir -> we -> humara (our)</p><p>ihr -> you (informal) -> tumhara (your) </p>"
            }
        ],
        "id": 83
    },
    {
        "unit_name": "Unit 16",
        "learning_content": [
            {
                "title": "Possessive adjectives in the nominative case",
                "content": "<p> Azad case mein, muarraf kazaya ki termination masculine ya na-mutanasib naam se pehle nahin milti. Agar naam zaanana ya jama hota hai, to -e zaat ke maalik se joda jata hai:</p><br><p>Das ist mein Bruder. (Yeh mera bhai hai.)</p><br><p>Das ist meine Mutter. (Yeh meri maa hai.)</p><br><p>Das ist mein Auto. (Yeh meri car hai.)</p><br><p>Meine Geschwister wohnen in Berlin. (Mere bhaion aur behnon ki rehaish Berlin mai hai.)</p>"
            },
            {
                "title": "Possessive adjectives in the accusative case",
                "content": "<p>Aap yaad hoga mukhtasar case mein, jahan masculine nouns ke liye azad article ein se einen mein tabdeel hojata hai. Maalik ki zaat waisa hi patter follow karta hai aur jab masculine noun ke samne aata hai to -en shamil karta hai. Feminine aur jama forms extra -e shamil karte hain:</p><br><p>Sie triﬀt ihren Bruder. (Woh apne bhai se milti hai.)</p><br><p>Sie triﬀt ihre Schwester. (Woh apni behen se milti hai.)</p><br><p>Sie sieht ihr Kind. (Woh apne bachay ko dekhti hai.)</p><br><p>Sie triﬀt ihre Freunde. (Woh apne dosto se milti hai.)</p>"
            },
            {
                "title": "Possessive adjectives in the dative case",
                "content": "<p>Dative case mein, maalik ka zaat termination -em le leta hai jab masculine ya na-mutanasib naam ki taraf hawala karta hai aur agar naam zaanana hai to -er. Jama mein -en shamil karen:</p><br><p>Er spricht mit seinem Bruder. (Woh apne bhai se baat karta hai.)</p><br><p>Er spricht mit seiner Schwester. (Woh apni behen se baat karta hai.)</p>"
            }
        ],
        "level": "A1",
        "id": 84
    },
    {
        "unit_name": "Unit 16",
        "learning_content": [
            {
                "title": "He talks to his child.",
                "content": "<p>Wooh apnay bachay say baat kar raha hai.</p>"
            },
            {
                "title": "He talks to his parents.",
                "content": "<p>Wooh apnay maa baap say baat kar raha hai.</p>"
            },
            {
                "title": "Possessive adjective endings in the genitive case",
                "content": "<p>Shuru ki satah par, aap galiban genitive case mein malikana sifatoon ka istemal nahi karain ge, lekin aap unhein likhay huay matn ya recording mein dekhain ge. Muzakar aur monas sifat k liye -es khitamatein hain, aur mo'anis aur mukhtalif aqsaam k liye -er.</p>"
            },
            {
                "title": "This is the friend of our son.",
                "content": "<p>Yeh hamaray baitay ka dost hai.</p>"
            },
            {
                "title": "This is the friend of our daughter.",
                "content": "<p>Yeh hamari beti ka dost hai.</p>"
            },
            {
                "title": "The friends of our children are very nice.",
                "content": "<p>Hamare bachon ke dost bohot achay hain.</p>"
            },
            {
                "title": "Spelling variation for euer",
                "content": "<p>Note that euer (‘your’, informal plural) is slightly differently spelled when connected with a female noun or plural: Ist das eure Mutter? Sind das eure Eltern?</p>"
            },
            {
                "title": "Is it your mother?",
                "content": "<p>Kia yeh aap ki maa hai?</p>"
            },
            {
                "title": "Are these your parents?",
                "content": "<p>Kia yeh aap k maa baap hain?</p>"
            },
            {
                "title": "Summary of possessive endings",
                "content": "<p>Yahaan malikana khitmat k liye ikhtisar hai:</p>"
            }
        ],
        "level": "A1",
        "id": 85
    },
    {
        "unit_name": "Unit 16",
        "learning_content": [
            {
                "title": "Possessive Pronouns",
                "content": "<p>Aapko possessive pronouns samajhne honge. Ye hain: 'my', 'our', 'your' (singular, informal), 'your' (plural, informal), 'your' (singular, formal), 'your' (plural, formal), 'his', 'her', 'their', 'its'.</p>"
            },
            {
                "title": "Exercise 16.2",
                "content": "<p>Aapko nominative case main missing endings fill karni hogi. Kuch cases main koi endings ki zaroorat nahi hogi. Maslan:</p><p> 'Wie ist Ihr _____ Adresse? – Mein _____ Adresse ist Falkenweg 12.' iska sahih jawab hoga, 'Wie ist Ihre Adresse? – Meine Adresse ist Falkenweg 12.'.</p>"
            },
            {
                "title": "Exercise 16.3",
                "content": "<p>Aapko in logon ke baare main yeh likhna hoga ke wo kya dhoondh rahe hain, examples ko follow karte hue. Yeh accusative case ka istemaal karen. Maslan: 'Claudia → Tasche (f) → Claudia sucht ihre Tasche.', 'Matthias → Führerschein (m) → Matthias sucht seinen Führerschein.'</p>"
            }
        ],
        "level": "A1",
        "id": 86
    },
    {
        "unit_name": "Unit 16",
        "learning_content": [
            {
                "title": "<h1>Exercise 16.4<h1>",
                "content": "<p>Aap ne mukhtalif jumlayin translate karne hain. Yeh jumlay hain:</p> <p>1.<br> Yeh mera walid hai.<br> 2.<br> Yeh meri walida hai<br> 3.<br> Jörg apna credit card dhoond raha hai.<br> 4.<br> Susanne apni driving licence dhoond rahi hai.<br> 5<br> Hum apne doston se milte hain.<br> 6.<br> Sebastian apni walida se baat kar raha hai.<br> 7.<br> Arianne apne bhai se baat kar rahi hai.<br> 8.<br> Bachay apne dada dadi se baat kar rahe hain.</p>"
            },
            {
                "title": "<h1>Checklist<h1>",
                "content": "<p>1<br> Kya aap german me tamam possessive pronouns jante hain? <p>2<br> Possessive pronouns ke endings ka kis se ittefaq hona chahiye? <p>3<br> Kaun sa possessive pronoun apni spelling ko tabdeel karta hai jab uska istemal feminine nouns ya plural me hota hai?</p>"
            },
            {
                "title": "",
                "content": ""
            }
        ],
        "level": "A1",
        "id": 87
    },
    {
        "unit_name": "UNIT SEVENTEEN: Wonderland e Verbs",
        "learning_content": [
            {
                "title": "Reﬂexive verbs kyaa hain?",
                "content": "Reﬂexive verbs woh actions/verbs hotay hain jin ma aik shakhs khud par koi amal kar raha ho. English ma iska examples hain: ‘Maine apna aap ko dho lia.’ ‘Usne apne liye aik naya computer khared lia.’<br>"
            },
            {
                "title": "Reﬂexive verbs ki istemal ki frequency",
                "content": "Reﬂexive verbs German zuban ma English se zyada istemal hoti hain. Aksar ye roz marra ki activities ki taraf ishara karti hain, isliye jab aap apni daily routine ke bare ma batana chahte hain, to ye bohat mufeed hoti hain.<br>"
            },
            {
                "title": "Ahem Reﬂexive verbs",
                "content": "Ye kuch aam tor par istemal hone wale reﬂexive verbs hain jo German zuban ma hain:<br>                     sich amüsieren: Apne aap ko enjoy karna<br>                     sich anziehen: Kapray pehenna<br>                     sich ausziehen: Kapray utarna<br>                     sich beeilen: Jaldi karna<br>                     sich duschen: Khud ko naha leyna/ Naha lena<br>                     sich entscheiden: Faisla karna<br>                     sich entschuldigen: Maafi mangna<br>                     sich kämmen: Apne Baal saaf karna<br>                     sich rasieren: Daarhi/Bal saaf karna<br>                     sich schminken: Makeup lagana<br>                     sich treﬀen: Milna<br>                     sich umziehen: Kapray badalna<br>                     sich waschen: Khud ko dho leyna/ Dho lena "
            }
        ],
        "level": "A1",
        "id": 88
    },
    {
        "unit_name": "Reﬂexive pronouns",
        "learning_content": [
            {
                "title": "Reﬂexive Pronouns Introduction",
                "content": "<p>Aik reflexive verb hamesha aik reflexive pronoun kay sath hoti hai, aik aisa lafz jesa ke 'myself', 'yourself', 'himself' aadi. Ziyadatar reflexive verbs accusative pronouns laytay hain: mich, dich, sich, uns, euch aur sich. Yahan hum bataye gay hain ke 'sich waschen' (jis ka matlab hota hai 'to have a wash') ke sath yeh kese kaam kertay hain:</p>"
            },
            {
                "title": "Usage of Reﬂexive Verbs",
                "content": "<p>Yahan or bhi misalain hain ke reﬂexive verbs kese kaam karti hain:</p><ul><li>'Ich beeile mich.' matlab 'I hurry (up).' </li><li>'Du duschst dich jeden Tag.' matlab 'You have a shower every day.' </li><li>'Er rasiert sich.' matlab 'He shaves (himself).' </li><li>'Wir treﬀen uns mit Steﬃ und Boris.' matlab 'We meet Steﬃ and Boris.'</li><li>'Amüsieren Sie sich?' matlab 'Are you enjoying yourself?' </li></ul>"
            },
            {
                "title": "When to use a dative pronoun",
                "content": "<p>Reﬂexive verbs normally take the accusative pronoun. Tabdeeli sirf tab hoti hai jab aap kuch specific karna chahtay hain, maslan, kaunsi clothes aap pehan rahe hain ya aap apne jism ke kis hisay ko saf kar rahay hain. Phir naya item direct object ban jata hai sentence ka, aur reflexive pronoun - as the indirect object - takes the dative form:</p><ul><li>'Ich ziehe mich an.' => 'Ich ziehe mir eine Jacke an.' matlab 'I put on a jacket.'</li><li>'Ich wasche mich.' => 'Ich wasche mir die Haare.' matlab 'I wash my hair.'</li><li>'Kämmst du dich?' => 'Kämmst du dir die Haare?' matlab 'Are you combing your hair?' </li></ul>"
            },
            {
                "title": "Overview of all dative pronouns",
                "content": "<p>Yeh hai tamaam dative pronouns ki overview.</p>"
            }
        ],
        "level": "A1",
        "id": 89
    },
    {
        "unit_name": "Unit 17",
        "level": "A1",
        "learning_content": [
            {
                "title": "Separable verbs",
                "content": "  jab koi reﬂexive verb separable hota hai, tu pronoun ﬁnite verb ke bad ati hai or preﬁx jumle ke aakhir mein jata hai:   anziehen → Wo kapre pehnte hain (Wo apne aap ko tayar karti hai). umziehen → Wo dressing room mein kapre change karte hain. (wo dressing room mein apne aap ko change karte hain)."
            },
            {
                "title": "More useful expressions",
                "content": " Ye zara observe karien ke in mein commonly used expressions mein reﬂexive verbs ka involvement kesa hai:  sich das Gesicht waschen  to wash one’s face sich die Hände waschen  to wash one’s hands sich die Zähne putzen  to brush one’s teeth sich die Nase putzen  to blow one’s nose   Apne hathon ko dhoen!  Main apne daant saaf karta hon.  Wo apna naak saaf karta hai."
            }
        ],
        "id": 90
    },
    {
        "unit_name": "Unit 17",
        "learning_content": [
            {
                "title": "1",
                "content": "<p>Mai ne shower liya.</p>"
            },
            {
                "title": "2",
                "content": "<p>Mai ne apne daant saaf kiye.</p>"
            },
            {
                "title": "3",
                "content": "<p>Mai ne apne kapde pehn liye.</p>"
            },
            {
                "title": "4",
                "content": "<p>Mai ne apne baal kangi ki.</p>"
            },
            {
                "title": "5",
                "content": "<p>Mai ne jacket pehni.</p>"
            },
            {
                "title": "6",
                "content": "<p>Mai jaldi kar raha tha.</p>"
            },
            {
                "title": "Checklist",
                "content": "<ul><li>Reﬂexive verbs hamesha kis ke saath aate hain?</li><li>Commonly used reﬂexive verbs ka reference kya hai?</li><li>Most reflexive pronouns usually kis case ko lete hain?</li><li>What happens to the reﬂexive pronoun when you add information on what it is that you are washing or putting on?</li></ul>"
            }
        ],
        "level": "A1",
        "id": 91
    },
    {
        "unit_name": "UNIT EIGHTEEN",
        "learning_content": [
            {
                "title": "Manfiyat",
                "content": "<p>Manfi bayanon ko banana k liye mukhtalif tariqe hote hain, yeh depend krta hai aap adjective, verb ya phir noun se deal kr rahe hain.</p>"
            },
            {
                "title": "English mai Manfiyat",
                "content": "<p>English mai, aap aam tor pe ‘not’ ka istemal adjectives aur verbs k sath krte hain, aur verbs ko bhi zyadatar 'to do' ki zaroorat hoti hai:</p><br><p>‘The house is not very nice.’ Yani ghar acha nahi boaht.</p><br><p>‘They don’t (do not) drink coffee.’ Yani vo log coffee nahi peete.</p><br> <p>Nouns thore se straightforward nahi hoty; inka mana (negation) mukhtalif shapes mai ataa hai jaise ke ’no’, ‘do + not’, ‘not’ ya ‘not any’:</p><br><p>‘There are no sausages left.’ Yani koi sausage bachi nahi hai.</p><br><p>‘He doesn’t have children.’ Yani, uske paas bachey nahi hain.</p><br><p>‘I haven’t got have any money.’ Yani paas koi paise nahi hain.</p>"
            }
        ],
        "level": "A1",
        "id": 95
    },
    {
        "unit_name": "Unit 18",
        "learning_content": [
            {
                "title": "Kein ka istemaal",
                "content": "<p>'Kein' ka istemaal aam taur par nouns ke saath hota hai:</p> <p>Mai paas ek gari hai.</p> <p>Mai paas koi gari nahi hai.</p> <br>"
            },
            {
                "title": "Nicht ka istemaal Adjectives aur Verbs ke saath",
                "content": "<p>'Nicht' ka istemaal English ke 'not' ke barabar hota hai. Iska use adjectives ya verbs ke connection mein hota hai:</p> <p>Nicht + adjective</p> <p>Ye CD mehngi nahi hai.</p> <p>Ye ghar zyada khubsurat nahi hai.</p> <p>Nicht + verb</p> <p>Wo nahi aa rahi.</p> <p>Mai ab cigaratte nahi peeta.</p>"
            },
            {
                "title": "Nicht ka position",
                "content": "<p>Shuruaati darje par nicht ka position samjhna thoda confusing ho sakta hai. Neeche diye gaye directions aapki madad kar sakte hain isko samajhne me:</p> <p>- Present tense me nicht usually ﬁnite verb ke baad aata hai: <br> Wah nahi aa rahi hai. <br> Wo cinema ko dekhne nahi jata.</p> <p>- Iske pehle time ka expression ho sakta hai: <br> Wah aaj nahi aa rahi hai.</p> <p>- Present perfect tense me jo haben ke saath banta hai, nicht uske saamne aata hai: <br> Mai ne ye book nahi khareedi hai.</p>"
            }
        ],
        "level": "A1",
        "id": 92
    },
    {
        "unit_name": "Unit 18",
        "learning_content": [
            {
                "title": "Kein ka istemal",
                "content": "<p>German mein sentence ko negative bananay k liye ek important word hai kein, jo normally aik noun k sath link hota hai:</p><ul><li>Kein Problem. - Koi Issue nhi.</li><li>Das ist keine Antwort - Yeh kisi bhi jawab ka muqabla nahi kar sakta.</li><li>Ich habe keine Zeit. - Mujhe waqt nahi hai.</li></ul><p>German mein aik noun ko negate karne k liye apko sirf kein ka istemal karna paray ga, jo english mein ‘no’, ‘not a(n)’, ‘not any’ ya phir ‘do not have’/‘haven’t got’ k barabar hai.</p>"
            },
            {
                "title": "Kein ke endings",
                "content": "<p>Kein behaves exactly like the indeﬁnite article (ein, eine, ein). It must agree in gender (masculine, feminine, neuter), number (singular, plural) and case (nominative, accusative, dative, genitive) with the noun:</p><ul><li>Er hat keinen Bruder. (accusative, masculine)</li><li>Sie hat keine Schwester. (accusative, feminine)</li><li>Er hat kein Kind. (accusative, neuter)</li><li>Sie hat keine Geschwister. (accusative plural)</li></ul><p>Yahan aik overview hai kein k tamam endings ka:</p><p>Jaisa k ap dekh sakte hain, wo ein k endings k sath identical hain – siwaye plural k, jahan wo possessive k endings ko follow kar rahay hain, for instance mein.</p>"
            },
            {
                "title": "Phrases jahan nicht ya kein istemal ho sakta hai",
                "content": "<p>Kuch phrases hote hain jahan ap ya to nicht ya phir kein ka istemal kar sakte hain. Un mein shamil hain:</p><ul><li>Ich spreche nicht/kein Deutsch. - Mein german nahi bolta.</li><li>Er ist nicht/kein Ingenieur. - Wo engineer nahi hai.</li><li>Ich fahre nicht/kein Auto. - Mein car nahi chalata.</li></ul>"
            }
        ],
        "level": "A1",
        "id": 93
    },
    {
        "unit_name": "Unit 18",
        "learning_content": [
            {
                "title": "Exercise 18.1",
                "content": "<p>Negative form mein sentences banayen <b>nicht</b> ka use kar ke. Yeh yaqeeni banayen ke aap <b>nicht</b> ko sahi jagah pe lagaye.</p>"
            },
            {
                "title": "Example",
                "content": "<p>Peter arbeitet gern. → Peter arbeitet nicht gern.</p>"
            },
            {
                "title": "Exercise 18.2",
                "content": "<p>Tamam sawalon ka negative response dein <b>kein</b> ka sahi roop istimal kar ke.</p>"
            },
            {
                "title": "Example",
                "content": "<p>Ist das ein Porsche? → Nein, das ist kein Porsche.</p>"
            }
        ],
        "level": "A1",
        "id": 94
    },
    {
        "unit_name": "Unit 18",
        "learning_content": [
            {
                "title": "Exercise 18.3",
                "content": "Mutarajjim karein aglay jumlay.<br/>1 Luke nahi peeta.<br/>2 Sheher khubsurat nahi hai.<br/>3 Computer sasta nahi hai.<br/>4 Ye door nahi hai.<br/>5 Paul ke paas cycle nahi hai.<br/>6 Unke paas car nahi hai.<br/>7 Uske paas koi waqt nahi hai.<br/>8 Arnd ke paas koi paisa nahi hai.<br/>9 Ye acha khayal nahi hai.<br/>10 Main French nahi bolta."
            },
            {
                "title": "Checklist",
                "content": "t1 Nicht kab istemal karte hain?<br/>t2 Kein kab istemal karte hain?<br/>t3 Kein kis tarah noun ke sath mutafiq hona chahiye?<br/>t4 Kya aap kuch jumlay yaad hain jahan aap ya to nicht ya kein istemal kar sakte hain?"
            }
        ],
        "level": "A1",
        "id": 95
    },
    {
        "unit_name": "UNIT NINETEEN",
        "learning_content": [
            {
                "title": "Comparative and superlative",
                "content": "<p>Jab aap cheezon ka muqabla karte hain, aap keh sakte hain keh kuch chote, bade, saste, ya zyada mahenge hain (muqabla) ya phir woh sab se chota, sab se bara wagaira hain (behtareen).</p>"
            },
            {
                "title": "Usage in English",
                "content": "<p>Angrezi mein, muqabla '–er' jod kar chote sifat ko ya 'more' lafz ka istemal karke banaya jata hai: <br/>Ye laptop sasta hain. <br/> London Paris se bohat ziyada dilchaspi hai. <br/> Behtareen banane ke liye aap ya to ‘-est’ jodte hain ya phir 'most' lafz istemal karte hain: <br/> Ye laptop sab se sasta hain. <br/> London sab se ziyada dilchaspi shehar hai.</p>"
            }
        ],
        "level": "A1",
        "id": 96
    },
    {
        "unit_name": "Unit 19",
        "learning_content": [
            {
                "title": "Mutabadil ingizaish",
                "content": "Ziyada tar sifatien sirf -er ko imtiaz men shamil karti hain. Jaisa ke, chhota (klein) ban jata hai chhoter (kleiner), tez (schnell) ban jata hai tezer (schneller), badsoorat (hässlich) ban jata hai badsoorater (hässlicher), aur boring (langweilig) ban jata hai boringer (langweiliger)."
            },
            {
                "title": "Anomalous Shapes",
                "content": "Aksar sifatien aik bayanati pattern ko follow kartien hain. Sirf chand istisnaon ka hona zaroori hai. For example, acha (gut) behter (besser) ban jata hai, aur bohat (viel) zyada (mehr) ban jata hai."
            },
            {
                "title": "Adding -er and adding umlaut + -er",
                "content": "Aksar aik he awaaz wali sifatien jo ke a, o, ya u ke sath hoti hain, woh bhi aik umlaut ko shamil karti hain. Mutabadilat ki misal ke taur par, uncha (hoch) uncha tar (höher) ban jata hai, lamba (lang) lamba tar (länger) ban jata hai, mazboot (stark) mazboot tar (stärker) ban jata hai, garam (warm) garam tar (wärmer) ban jata hai."
            }
        ],
        "level": "A1",
        "id": 97
    },
    {
        "unit_name": "Unit 19",
        "learning_content": [
            {
                "title": "Comparative and Superlative Adjectives",
                "content": "Berlin München se barha hai.  Berlin Munich se bara hai.  Rhein Themse se lamba hai.  Rhein Thames se lambi hai.  <p> Bayaanbardaari lafz am ke saath aur -sten wali sifat ke saath mukammal hoti hai.</p>  t<p> Aik he sillabe wale ashkal k saath -sten ke sath sath amlyat daraj za'il namonon mei mojood hai:</p><p> jung → am jüngsten (sab se kam)</p>  t<p> groß → am größten (sab se ziada, sab se lamba)</p>  t<p> lang → am längsten (sab se lamba)</p>  t<p> warm → am wärmsten (sab se garam)</p>"
            },
            {
                "title": "Irregular forms of Adjectives",
                "content": "<p>Wo sifaat jo aam pattern pe amal nahi karti, un mei daraj zail shamil hain:</p>  t<p> hoch 'high' ke liye superlative am höchsten 'highest' hai</p>  t<p> teuer → teurer (ziada expensive)</p>  t<p> dunkel → dunkler (darker)</p>  t<p> klein → am kleinsten (smallest)</p>  t<p> schnell → am schnellsten (fastest)</p>  t<p> hässlich → am hässlichsten (ugliest)</p>  t<p> langweilig → am langweiligsten (most boring)</p>  t<p> gut → am besten (best)</p>  t<p> viel → am meisten (most)</p>"
            }
        ],
        "level": "A1",
        "id": 98
    },
    {
        "unit_name": "Unit 19",
        "learning_content": [
            {
                "title": "Gern ka Istemal",
                "content": "<p><br>Jo kaam aapko pasand ho ya jo cheez aapko sab se zyada pasand ho, usay bayan karne ke liye gern adverb ka tashbeehi aur afzal shakl ka ilm hona zaroori hai, jo ke bohat ghair mutadil hai.<br></p>"
            },
            {
                "title": "Comparatives aur Superlatives ka Istemal Pehlay Naam ke Samne",
                "content": "<p><br>Is Unit ke misaal mein, hum tashbeehi aur afzal shakl ke istemaal par guftagu karte hain jo naam ke baad aatay hain. In shaklon ke endings tabdeel ho sakhti hain jab woh kisi naam se pehlay aate hain. Unit 25 dekhen.<br></p>"
            },
            {
                "title": "Comparatives aur Superlatives Ka Practice",
                "content": "<p><br>Bernd bohat parhta hai.<br></p><p>Frauke ziada parhti hai.<br></p><p>Jörg sab se zyada parhta hai.<br></p><p>Main pani peene ka shokeen hun. Main coffee peene ko tarjih deta hun. Main sab se zyada pasand karta hun beer peena.<br></p>"
            }
        ],
        "level": "A1",
        "id": 99
    },
    {
        "unit_name": "Unit 19",
        "learning_content": [
            {
                "title": "Exercise 19.4",
                "content": "<p>Translate the following sentences:</p> <br> <p>1. London ki size Paris se barri hai.<br>2. Rhine ki length Danube se ziyada lambi hai.<br>3. Jens ki age Susan se ziyada hai.<br>4. Boris ki samajh Claus se ziyada achi hai.<br>5. Gabriella sabse samajhdar hai.<br>6.Hawai jahaz ki keemat train se ziyada hai.</p> </br>"
            }
        ],
        "level": "A1",
        "id": 100
    },
    {
        "unit_name": "Unit 19",
        "learning_content": [
            {
                "title": "Content 7",
                "content": "Ralf Michael se zyada aahista drive karta hai. <br>"
            },
            {
                "title": "Content 8",
                "content": "Kitab Film se behtar hai. <br>"
            },
            {
                "title": "Checklist",
                "content": "1. Comparative kis tarah banaya jata hai? <br> 2. Superlative kis tarah form kiya jata hai?<br> 3. Long adjectives ya adverbs k liye comparative ya superlative ka koi khas form hai ?<br> 4. Adjective ya adverb k stem mai tabdeeli kab hoti hai ?<br> 5. Pronunciation asaan bananay k liye kya tabdeeliyan ki jati hain? <br>"
            }
        ],
        "level": "A1",
        "id": 101
    },
    {
        "unit_name": "Unit Bees: Modal Verbs",
        "learning_content": [
            {
                "title": "Modal Verbs Kiya Hain?",
                "content": "Modals wo verbs hain jo ek sentence main kisi khaas 'mood' ko express karti hain; jaisa ki aap kuch kar sakte hain, chahiye kuch karne ko ya kuch karna hi chahiye."
            },
            {
                "title": "Modal Verbs In English",
                "content": "English main, modal verbs aam taur pe ek sath use hoti hain ek main verb ke sath infinitive main: 'Agar aap free hain, to aap hamare sath aa sakte hain.'"
            },
            {
                "title": "Modal Verbs In Detail",
                "content": "Dürfen – may/to be allowed to       <br> Modal dürfen use hota hain izazat express karne ke liye."
            }
        ],
        "level": "A1",
        "id": 102
    },
    {
        "unit_name": "Unit 20",
        "level": "A1",
        "learning_content": [
            {
                "title": "Dürfen - May/Permitted",
                "content": "<br>You are allowed to smoke here yani aap yahan dhoom-sakerne Shree ki ejazat hai. <br><br>Darf ich Ihnen helfen? matlab kia main app ki mudad kar sakta hoon. <br><br>Jab 'nicht' kay sath istemal hota hai, toi dürfen ka matlab hota hai kuch jo aap karny kay liyay majboor nahi hain:<br>Sie dürfen hier nicht rauchen yani aapko yahan dhoom-sakerne ki ejazat nahi hai.<br>Man darf hier nicht fotograﬁieren yani aapko yahan photo lene ki ejazat nahi hai."
            },
            {
                "title": "Können – Can/To be able to",
                "content": "<br>Kannst du mir helfen? yani kya tum meri madad kar sakte ho?<br>Er kann sehr gut Salsa tanzen yani woh bohat acha Salsa dance kar sakta hai."
            },
            {
                "title": "Müssen – Must/To have to",
                "content": "<br>Ich muss jetzt gehen yani mjhe ab jana hai.<br>Er muss am Wochenende arbeiten yani usy haftey ke akhir mein kam karna parega."
            }
        ],
        "id": 103
    },
    {
        "unit_name": "Unit 20",
        "learning_content": [
            {
                "title": "Müssen - Don’t have to",
                "content": "<p>When used with the negative nicht, müssen does not convey the meaning of <br>prohibition as in English, but means ‘don’t have to’.</p>"
            },
            {
                "title": "Dürfen + nicht - Must not",
                "content": "<p>To say ‘you must not’, use dürfen + nicht:<br> Du darfst nicht rauchen.<br> You must not smoke.</p>"
            },
            {
                "title": "Sollen – To be supposed to, should, ought to",
                "content": "<p>The modal sollen means ‘to be supposed to’ or ‘should’:<br> Sie sollen mehr Sport treiben.<br> You should do more sport.</p>"
            },
            {
                "title": "Wollen – Want",
                "content": "<p>The modal wollen usually expresses an intention or desire and corresponds to<br> the English ‘to want to’:<br> Ich will nach New York ﬂiegen.<br> I want to ﬂy to New York.</p>"
            }
        ],
        "level": "A1",
        "id": 104
    },
    {
        "unit_name": "Unit 20",
        "learning_content": [
            {
                "title": "Modal Verbs Explanation",
                "content": "<p>Dehaan 'will' aur 'would' Urdu may be 'chahna' aur 'chahye ga' hota hai. Lekin German zubaan mein in ka istemaal mukhtalif tareeqay se hota hai jo ap ko samjhaaiye gaye hain.</p> <p><strong>Important Note:</strong> <em>'will' ka matlab 'wollen' hota hai magar is ka istemal future tense banaane k liye nhi hota. Ye German mein 'werden' istemal hota hai. Misal k tor par 'woh germany jaaye gi' ko german mein 'Sie wird nach Deutschland fahren' kaha jata hai.</em></p>"
            },
            {
                "title": "Examples on Mögen/Möchten",
                "content": "<p><strong>mögen/möchten</strong> yani <em>like/would like</em> ka istemal logon, khanae, jagahon aur activities k hawaly se hota hai:</p> <p>Example: <em>'Mujhe Barbra Streisand pasand hai', 'Unhe Paris pasand hai', 'Usay Tennis pasand hai'</em></p>"
            },
            {
                "title": "Use of Mögen/Möchten without a second verb",
                "content": "<p>Ye aksar apne subjective form, möchten, mein istemal hota hai jiska matlab <em>would like to</em> hota hai. Misal k tor par: <em>'woh kaam karna chahta hai', 'woh nayi gaari khareedna chahta hai'</em></p><p>Ye zamir mögen aksar dosray verb k bagher istemal hota hai. Misal k tor par: <em>'mujhe aik glass beer chahiye, please.'</em></p>"
            }
        ],
        "level": "A1",
        "id": 105
    },
    {
        "unit_name": "Unit 20: Modal verbs used with another verb",
        "learning_content": [
            {
                "title": "Jaisa ke English mai, modals kaam aam tor par dosray verb ke sath istemal hote hain",
                "content": "Woh bahut achhi tango nach sakte hain. Tumhein zyada khelna chahiye. Jab ham English aur German ke modals par nazar dalte hain to ek bari farq samne aata hai. English mai, modal verb aur mukhya verb ek sath rehte hain; jab ke German mai, modal verb aur mukhya verb alag ho jate hain."
            },
            {
                "title": "Modal aur separable verbs",
                "content": "Jab aap modal verb ka istemal separable verb ke sath kartay ho to separable verb ek sath rehta hai aur vo sentence ke akhir mai jata hai."
            },
            {
                "title": "Overview of all modal verbs and their endings",
                "content": "Yahaan sabhi modal verbs aur unke endings ka ek overview hai. Yaad rahe, jab aap unhein seekhne ki koshish karte hain to kuch patterns samne aate hain."
            }
        ],
        "level": "A1",
        "id": 106
    },
    {
        "unit_name": "Unit 20",
        "learning_content": [
            {
                "title": "Irregular Patterns for Modal Verb Endings",
                "content": "Kya modal verb endings ke liye irregular patterns hai?"
            },
            {
                "title": "Main Verb in a Sentence with a Modal Verb",
                "content": "Modal verb wale sentence mein main verb kahan hoti hai?"
            },
            {
                "title": "How to Use Mögen?",
                "content": "Mögen ka istemaal kaise karte hain?"
            },
            {
                "title": "Translation of Sollen",
                "content": "Sollen ka tarjuma kaise karenge?"
            },
            {
                "title": "Translation of ‘must not’",
                "content": "‘Must not’ ka tarjuma kaise karenge?"
            }
        ],
        "level": "A1",
        "id": 107
    },
    {
        "unit_name": "UNIT TWENTY-ONE",
        "learning_content": [
            {
                "title": "Moajooda Mukammal Waqt (The present perfect tense)",
                "content": "<p>Mazi ke waqt ki English aur German main do mukammal tenses hoti hein, jo ke moajooda mukammal waqt (The present perfect tense) aur asaan mazi (simple past tense) kehtay hein.</p>"
            },
            {
                "title": "Mukhtalif Istemaal (Different usages)",
                "content": "<p>English main aap moajooda mukammal waqt ka istemaal karte hein agar koi mazi ka waqia abhi tak mojooda se kafi qareeb hai aur 'just' jaise kuch khaas alfaz ke saath: 'Main ne abhi us se baat ki hai'. Aur zyada tar situations ke liye aap asaan mazi ka istemaal karte hein: 'Mene aakhri dafa us se do saal pehle baat ki thi'.</p>"
            },
            {
                "title": "Bazat aur Ghair Bazat Feal – Aik Jaiza (Regular and irregular verbs – an overview)",
                "content": "<p>German ki zyadatar fealon ke liye aap moajooda mukammal waqt bana sakte hain 'ke paas hona' ya 'haben' + mukammal mazi ka feal: 'gehört' + 'haben' = 'suni hui hai'; 'getrunken' + 'haben' = 'pee hui hai'. </p><p>Moajooda Mukammal Waqt: <br>Main ne us se baat ki hai. <br>Asaan Mazi Waqt: <br>Main ne us se baat ki.</p>"
            }
        ],
        "level": "A1",
        "id": 108
    },
    {
        "unit_name": "Unit 21",
        "learning_content": [
            {
                "title": "Regular, Irregular Verbs and Their Usage",
                "content": "<p>Jaisa ke English mein, kuch verbs regular (jaise 'have listened'/sunna) hote hain aur kuch irregular (jaise 'have drunk'/peena) hote hain German mein. Kuch verbs mein 'sein' ka finite form use hota hai 'haben' ke bajaye, plus past participle:</p> <p>Ich bin nach Paris gefahren. (Main Paris chala gaya hoon).</p>"
            },
            {
                "title": "Formation and Details of Regular Verbs",
                "content": "<p>Regular verbs (yaani weak verbs) ka present perfect tense banane ke liye, 'haben' ka present tense use hota hai + past participle. Participle banane ke liye, verb ke stem ka use hota hai (infinitive minus -en) aur 'ge-' shuru mein aur '-t' end mein add hota hai.</p>"
            },
            {
                "title": "Finite Verb 'Haben' and Its Usage",
                "content": "<p>Jab aap is structure ko sentence mein use karte hain, 'haben' ke endings personal pronoun ke saath match karni chahiye – yeh sentence mein finite verb hoti hai. Past participle change nahi hota. Dekhiye 'spielen' (to play) ka complete present perfect tense: </p> <p>ich habe gespielt (main ne khela hai)</p><p>wir haben gespielt (hum ne khela hai)</p><p>du hast gespielt (tum ne khela hai)</p><p>ihr habt gespielt (aap ne khela hai)</p><p>Sie haben gespielt (woh khela hai)</p><p>Sie haben gespielt (Unho ne khela hai)</p><p>er/sie/es hat gespielt (woh khela hai)</p><p>sie haben gespielt (woh khela hai)</p>"
            },
            {
                "title": "Word Order in Sentences",
                "content": "<p>Aap examples se dekh rahe honge ki 'haben' sentence mein dusre position par hota hai, jab ke past participle sentence ya clause ke end mein jata hai: </p><p>Sie hat ein neues Kleid gekauft. (Usne nayi dress khareed li).</p><p>Gestern habe ich Tennis gespielt. (Kal main ne tennis khela).</p>"
            },
            {
                "title": "Infinitive Past Participle Formation",
                "content": "<p>kauf-en → ge-kauf-t (khareedna → khareed liya)</p> <p>spiel-en → ge-spiel-t (khelna → khela)</p> <p>sag-en → ge-sag-t (kehna → kaha)</p>"
            }
        ],
        "level": "A1",
        "id": 109
    },
    {
        "unit_name": "Unit 21 - Irregular verbs in more detail",
        "learning_content": [
            {
                "title": "Formation",
                "content": "Irregular verbs (jise hum mazboot verbs bhi kehte hain) zyadatar cases mein stem ke aaghaz mein ge- ka istemal aur akhir mein -en laga kar apna past participle banate hain: Irregular verbs ka aksar tar stem vowel change hota hai."
            },
            {
                "title": "Word order",
                "content": "Jaisa ke regular verbs ke saath hota hai, past participle sentence ya clause ke akhir mein hota hai:       <br>   Hast du den neuen Bond-Film gesehen? Kya aapne nayi Bond film dekhi?       <br>   Wir haben eine neue Wohnung gefunden. Humne eik naya flat dhoond liya.        <br>   Maike hat mir sehr geholfen. Maike ne mujhe bohat madad ki.        <br>   Sie haben zu viel Bier getrunken. Unhon ne bohat zyada beer peeli."
            },
            {
                "title": "Mixed verbs",
                "content": "Wahan ek verb group bhi hai (jo ke aksar mixed verbs ke naam se jaana jata hai) jis mein stem change hota hai lekin -t lagaate hain bajaye -en ke. Sabse ahem hain:        <br>   inﬁnitive ge + stem + t       <br>   bring-en → ge-brach-t       <br>   denk-en → ge-dach-t       <br>   wiss-en → ge-wuss-t"
            }
        ],
        "level": "A1",
        "id": 110
    },
    {
        "unit_name": "Unit 21",
        "learning_content": [
            {
                "title": "Present Perfect Tense with Sein",
                "content": "<p>The present perfect tense mai, motion verbs ne sein leti hai. Motion ya state change jesi verbs, present perfect ko sein ke finite form aur verb ke past participle ke sath form karti hain. Yahan kuch aisi misalein di gai hain:</p>                    <ul>                   <li>Fahren (to go, to drive) → Ich bin nach Paris gefahren.</li>                   <li>Fliegen (to fly)</li>                   <li>Gehen (to go, to walk)</li>                   <li>Kommen (to come)</li>                   <li>Laufen (to run)</li>                   <li>Schwimmen (to swim)</li>                   </ul>                   <p>Zahir hai keh zyadatar participles -en mai khatam hote hain, lekin kuch exceptions bhi hote hain jaise ke - gereist.</p> "
            },
            {
                "title": "More Verbs with Sein",
                "content": "<p>The following verbs also form the present perfect tense with sein and are irregular:</p>                   <ul>                   <li>Wie lange seid ihr in den USA geblieben? (How long have you stayed in the States?)</li>                   <li>Sie ist Lehrerin geworden. (She’s become a teacher.)</li>                   <li>Bleiben → geblieben to stay</li>                   <li>Sterben gestorban to die</li>                   <li>Werden → geworden to become</li>                   </ul>"
            }
        ],
        "level": "A1",
        "id": 111
    },
    {
        "unit_name": "Moajuda Mukammal Zaman kay haben aur sein ka istemal",
        "learning_content": [
            {
                "title": "Auxiliary Verbs Haben aur Sein ki Participle Forms",
                "content": "<p>Haben aur sein ko auxiliary verbs ke tor par zyada ahmiyat di jati hai jab mojooda mukammal zaman ka dastoor banaya jata hai. Lekin inke participle forms janna bhi bohat zaruri hai.<br/>Haben ki past participle form gehabt hai:<br/>Er hat keine Zeit gehabt.<br/>(Usne koi waqt nahi diya)<br/>Sein ki past participle form irregular hoti hai – gewesen:<br/>Wo bist du gewesen?<br/>(Tum kahan the?)</p>"
            },
            {
                "title": "Verbs with stem endings in -d or -t",
                "content": "<p>Un verbs ka khayal rakhna zaruri hai jin ke stem mein -d ya -t hota hai. In verbs ko participle banane ke liye extra -e ki zarurat hoti hai:<br/>Hast du wieder so viel geredet?<br/>(Kya tum phir se itna zyada baat karte the?)<br/>Er hat viel gearbeitet.<br/>(Usne bohat kaam kiya hai)</p>"
            },
            {
                "title": "Verbs with an inseparable prefix and Verbs ending in -ieren",
                "content": "<p>Verbs ke inseparable prefix jaise ke be-, er-, -ver, -zer ke saath ge- nahi lagaya jata.<br/>Er hat das Essen bezahlt.<br/>(Usne khanay ka bill ada kar diya hai)<br/>Wir haben das Auto verkauft.<br/>(Humne car bech di hai.)<br/>Ich habe meinen Terminkalender verloren.<br/>(Maine apna diary kho diya hai)<br/>Verbs ending in -ieren (for example studieren and passieren) also do not add ge- at the front:</p>"
            }
        ],
        "level": "A1",
        "id": 112
    },
    {
        "unit_name": "Unit 21",
        "learning_content": [
            {
                "title": "Separable verbs",
                "content": "Separable verbs form the past participle like other regular or irregular verbs,<br> but the preﬁx stays at the front:<br>Regular: preﬁx + ge + stem + t<br>Irregular: preﬁx + ge + stem + en<br>Here are some examples:<br>Hast du das Bier aufgemacht?<br>Have you opened the beer?<br>Die Eltern haben eingekauft.<br>The parents have done the shopping.<br>Bist du wieder früh aufgestanden?<br>Have you got up early again?<br>Wir haben drei Stunden ferngesehen.<br>We’ve watched television for three hours."
            },
            {
                "title": "Working with verb lists",
                "content": "Most German coursebooks, grammars and dictionaries have a list of irregular verbs in which the past participles are given. Verbs which form the present perfect tense with sein are usually indicated with a ‘v.it’. We recommend that you use these lists regularly and learn the most important verbs by heart. As with most other grammar points – the more you practise, the more progress you will make with your language learning."
            },
            {
                "title": "Additional Information",
                "content": "For more information on the simple past tense and when to use it in German see Unit 22."
            }
        ],
        "level": "A1",
        "id": 113
    },
    {
        "unit_name": "Unit 21",
        "level": "A1",
        "learning_content": [
            {
                "title": "Herr Witte worked until nine o’clock.",
                "content": "Herr Witte naukay tak kaam karte thay."
            },
            {
                "title": "She bought a new CD.",
                "content": "Usne aik naya CD khareeda."
            },
            {
                "title": "Michael studied in Berlin.",
                "content": "Michael ne Berlin mein parhaya."
            },
            {
                "title": "They paid by credit card.",
                "content": "Unhone credit card se ada kiya."
            },
            {
                "title": "He went to the cinema.",
                "content": "Wo cinema gaya."
            },
            {
                "title": "They watched television.",
                "content": "Unhone television dekha."
            },
            {
                "title": "When did you get up?",
                "content": "Tum kab uthay?"
            },
            {
                "title": "What did you do yesterday?",
                "content": "Tumne kal kya kiya?"
            },
            {
                "title": "Checklist",
                "content": ""
            }
        ],
        "id": 114
    },
    {
        "unit_name": "UNIT TWENTY-TWO",
        "learning_content": [
            {
                "title": "Sadah Maazi (The simple past tense)",
                "content": "<p> Sadah maazi tehzeeb yani German men ek main tense hai jo maazi ke waqiyat ki bayani k liye use hota hai. Jahan mojooda kaamil tense zyada tar bol-chal ki zaban men istemal hota hai, wahan sadah maazi zyada tar likhi german men istemal hota hai. Grammar ki kitabon men isy aksar preterite (Präteritum) ya imperfect (Imperfekt) kaha jata hai.</p>"
            },
            {
                "title": "Baa Qaida Aur Ghair Qaida Verbs (Regular and irregular verbs)",
                "content": "<p> Angrezi men, sadah maazi men verbs ya to baa qaida hotay hen ya ghair qaida:<br/>• Baa Qaida verbs sirf 'ed' jorein gay, infinitive men (‘play’ → ‘played’)<br/>• Ghair Qaida verbs zyada tar aap k vowels badal jate hen (‘see’ → ‘saw’)... German men bhi ek aisi hi pattern hai:<br/>• Ziyada tar baa Qaida verbs apnay stem men muqarara ikhatajaji shamil kar letay hen (spielen → ich spielte)<br/>• Kafi saaray ghair qaida verbs apnay stem ko badal detay hen (sehen → ich sah)<br/>Ghair qaida verbs ke sath sath thore se mukhtalif ikhatajaji bhi hen<br/>Tamaam forms agay ki paragraphs men byan kiye gaye hen. </p>"
            },
            {
                "title": "Baa Qaida Verbs Detail (Regular verbs in detail)",
                "content": "<p> Baa Qaida verbs ki sadah maazi tashkeel k liye, stem len aur munasib ikhtataji shamil kerain. </p>"
            }
        ],
        "level": "A1",
        "id": 115
    },
    {
        "unit_name": "Unit 22",
        "learning_content": [
            {
                "title": "Examples",
                "content": "<p>Jab woh bacha tha, usne Berlin mein reha.</p><p>Kal usne aik naya CD kharida.</p>"
            },
            {
                "title": "Variations",
                "content": "<p>T, N, ya D ke sath jam'a huwai verbs ko asan tarikay se pronounce karne ke liye extra E ki zarurat hoti ha</p> <p>[antworten → She didn’t answer]</p><p>[regnen → Yesterday it rained./Yesterday it was raining]</p><p>[reden → He talked for one hour.]</p>"
            },
            {
                "title": "Irregular verbs in detail",
                "content": "<p>German, irregular verbs English ki tarah simple past ko form karti hain jis main aik stem vowel change hota ha jis ke mukablay main verb khatm hotay hain simple past tense main jo present tense main khatam hotay hain, alawa ich aur er/sie/es, jahan koi ending nahi hote hai</p><p> [Helvetica> sehen → she saw], [schreiben → she wrote], [gehen → I went].</p>"
            }
        ],
        "level": "A1",
        "id": 116
    },
    {
        "unit_name": "Unit 22",
        "level": "A1",
        "learning_content": [
            {
                "title": "Examples",
                "content": "<p>Kal mai ne aik film dekhi.<br>Usne aik khat likha.<br>Wo restaurant gae.</p>"
            },
            {
                "title": "Mixed Verbs",
                "content": "<p>Kuch verbs hote hain jo apna stem vowel change kar dete hain, lekin unke pass -te endings hoti hain jaise regular verbs ki hoti hain. Inhe hum mixed verbs kehte hain. Sabse zaroori hain:<br>Sochna, Lana, Janna, Janna, Jalna</p>"
            },
            {
                "title": "Examples",
                "content": "<p>Usne apne chhuttiyon ke bare mein socha.<br>Mujhe ye nahi pata tha.</p>"
            },
            {
                "title": "Haben, Sein and the Modal Verbs",
                "content": "<p>Halenke simple past tense zyadatar written German mein use hota hai, lekin ye spoken language mein bhi hota hai. Khas taur par haben aur sein aur modal verbs ke liye. Yahan woh aik tafseel ke sath hain:<br>Haben aur Sein<br>Dono verbs quite irregular hote hain simple past tense mein. Yahan ek overview hai:</p><p>Ich<br>Tu<br>Sie<br>Er/Sie/Es<br>Wir<br>Ihr<br>Sie<br>Sie</p>"
            }
        ],
        "id": 117
    },
    {
        "unit_name": "Unit 22",
        "level": "A1",
        "learning_content": [
            {
                "title": "Jumlay Ki Misaalain",
                "content": "<p>Ye kuch misaal hain:</p> <p>‘I didn’t have any time.’ mein Urdu mein hoga ‘Mujhe waqt nahi tha’.</p> <p>‘He was terribly hungry.’  Urdu mein hoga ‘Wo buhat bhooka tha’.</p> <p>‘He was in London last year.’ Urdu mein hoga ‘Wo pechle saal London mein tha’.</p> <p>‘Where were you?’ Urdu mein hoga ‘Tum kahan thay?’.</p>"
            },
            {
                "title": "Simple Past Tense mein Modal Verbs",
                "content": "<p>Modal verbs bhi ‘mixed’ verbs ki tarah behave kartay hain. Inka stem vowel change hota hai (ü → u,ö → o) lekin inhain -te endings miltein hain. Ye aik jayeza hai modal verbs ka simple past tense mein:</p> <p>‘I wasn’t allowed to go to the cinema.’ Urdu mein hoga ‘Mujhe cinema janay ki ijazat nahi thi’.</p> <p>‘He couldn’t make it.’ Urdu mein hoga ‘Wo kar nahi saka’.</p> <p>‘We had to work.’ Urdu mein hoga ‘Humein kaam karna para’.</p>"
            },
            {
                "title": "Sikhne Ka Tareeqa",
                "content": "<p>Aik beginner ke tor par, aap shayad simple past tense ko sirf aik ‘receptive’ skill ke tor par istemaal karenge – jab aap German ke text parhte hain jahan aapko sirf alfaz pehchane hain. Jaise ke English mein, ziada tar verbs do main groups mein aate hain: regular or irregular verbs jo mukhtalif patterns follow karte hain. Halanke, verbs forms ko theek se seekhne ka behtareen tareeqa hai verb lists ke saath kaam karna, jo aapko is book ke end mein ya kisi achi dictionary mein mil sakti hain. Try to learn the most commonly used verbs by heart and practise as much as you can – you will soon find that you are much more confident when you are dealing with the simple past tense.</p>"
            }
        ],
        "id": 118
    },
    {
        "unit_name": "Unit 22",
        "level": "A1",
        "learning_content": [
            {
                "title": "Exercise 22.1",
                "content": "<p>Yeh aik mukhtasar hissa hai mashhoor German fairy tale Schneewittchen (Snow White) se. Text ko parhain aur underline karain tamam verbs simple past tense main. Pehlay do aap k liye kiye gaye hain.</p> <p></p> <p>Regular, irregular ya phir mixed hain underlined verbs, unhein classify karain given columns main. Kya aap infinitive bhi dhoond saktay hain har verb ka?</p>"
            },
            {
                "title": "Exercise 22.2",
                "content": "<p>In verbs k full simple past tense likhain (sab k liye: ich, du, Sie, er/sie/es, wir, ihr, Sie, sie): (1) spielen; (2) kaufen; (3) wohnen.</p>"
            },
            {
                "title": "Exercise 22.3",
                "content": "<p>Sahi endings supply karain. Kuch cases main ending ki zaroorat nahi hogi.</p> <p>Misal k tor pe: Er trank eine Flasche Bier.</p> <p>1: Main Prague main one week k liye reh gaya tha.</p> <p>2: Kya tum ne football match dekha television par?</p> <p>3: Usne kal cinema gaya tha.</p> <p>4: Khane k baad hum ne coffee peeli.</p> <p>5: Aunty Schneider pehli dafa Scotland gayi thi.</p>"
            }
        ],
        "id": 119
    },
    {
        "unit_name": "Unit 22",
        "learning_content": [
            {
                "title": "Exercise 22.4",
                "content": "Translate the following sentences. <br/> 1. Kal mein tennis khela. <br/> 2. Mein ne aik cup coffee khareeda. <br/> 3. Bachpan mein main Frankfurt mein rehta tha. <br/> 4. Mein cinema gaya. <br/> 5. Mein Germany mein aik hafte reha. <br/> 6. Yeh pichle saal tha."
            },
            {
                "title": "Checklist",
                "content": "1. Simple past tense kab use karte hain? <br/> 2. Kis verbs ne simple past tense zyadatar maamlaat mein use kia? <br/> 3. Simple past tense k liye verb endings kya hain? <br/> 4. Modal verbs aur regular verbs k liye simple past tense kaise banate hain?"
            }
        ],
        "level": "A1",
        "id": 120
    },
    {
        "unit_name": "UNIT TWENTY-THREE",
        "learning_content": [
            {
                "title": "Mustaqbil ka zamen",
                "content": "<p>Mustaqual ki baat karne ke liye, tum mustaqbil ka waqt istemal karte ho. Anglici me iska izhar karne ke mukhtalif tareeqe hein. Tum 'going to' + fail ke saath aik structure istemal kar sakte ho, kuch qareb ke mustaqbil ki hawale se, ya tum 'will' + fail istemal kar sakte ho. Jab the context se wazeh hota hai ke aap mustaqbil ki taraf hawale de rahe hein, tum barabar pale waqt ki shakal ko bhi istemal kar sakte ho: 'Aj sham me ghar se kam kar raha hoon.'</p>"
            },
            {
                "title": "German me do mukhtalif shaklen",
                "content": "<p>German me bhi mustaqbil ki events ki hawale se different ways hein.<br><ul><li>Asan tarika aur ziada tar istemal hone wala tariqa hai present time istemal karne ka.</li><ul><li>Dusra option hai werden + infinitive istemal karne ka:.</li></ul><p>Yahan dono forms tafsil se hein.</p>"
            }
        ],
        "level": "A1",
        "id": 121
    },
    {
        "unit_name": "Unit 23",
        "learning_content": [
            {
                "title": "Anaiyayion ki samaj booj karna",
                "content": "As you can see, there are often bits of information in the sentence which suggest the future. In the ﬁrst example above, the word heute ‘today’ indicates that the event will be taking place later in the day. The second and third examples are even clearer: 'in den Ferien’ ‘in the holidays’ and ‘zum Abendessen’ ‘for supper’ clearly state that the event referred to will take place in the future."
            },
            {
                "title": "Mustakbal ki taraf isharay dainay wale fraze",
                "content": "There are many such expressions. Whenever you are using one of these words, you can quite easily use the present tense because it is evident that you are not speaking about the present. Some examples are given. - Soon: Jald - Later: Bad me - Tomorrow: Kal - In 10 minutes: 10 mint me - In a week: Aik hafte me - Tonight: Aj raat - Next Month: Agle mahine"
            },
            {
                "title": "Warden + inﬁnitive ki istemal",
                "content": "The other way of talking about future events uses grammatical forms which are similar in English and in German. Look at the examples given above."
            }
        ],
        "level": "A1",
        "id": 122
    },
    {
        "unit_name": "Unit 23",
        "learning_content": [
            {
                "title": "Future tense in English and German",
                "content": "<p>Main zara call karonga aap ko. Kya aap ghar pe honge? Woh saara hafta der tak kaam karega. Film Europe mein release hogi. Woh log August mein ghar shift karenge.</p> <p>English mein future tense will aur main verb ki infinitive form ka istemal karta hai. Jab k German mein future tense ki formation werden aur main verb ki infinitive form se hoti hai.</p> "
            },
            {
                "title": "Usage of werden + infinitive in German",
                "content": "<p>German language is tareeky ko written German mein, prediction karte waqt, probability indicate karte hue, ya kisi point ko emphasize karne ke liye istemal karti hai.</p> <p>Examples jaise ke: Kal barish hogi. Woh log shayad Mallorca jayenge. May mein main A levels ka imtihan du ga.</p>"
            },
            {
                "title": "Points to watch out for",
                "content": "<p>Jab aap future tense bana rahe hote hain werden + infinitive ke saath, tab aapko do points par dhyaan dena hota hai. Werden ek irregular verb hai. Is ke saare forms yaad karne chahiye.</p> <p>Jin mein irregularities include hoti hain: werden ka stem vowel change hota hai du aur er/sie/es ke saath: e → i: du wirst, er/sie/es wird. Du ke form mein stem se d drop ho jata hai: du wirst. er/sie/es ke saath koi additional ending nahi hoti: er wird.</p>"
            }
        ],
        "level": "A1",
        "id": 123
    },
    {
        "unit_name": "Unit 23",
        "learning_content": [
            {
                "title": "Lafzi Tarteeb",
                "content": "<p><strong>Asal verb</strong> hamesha infinitive mein hota hai, aur yeh jumley ya clause ke akhir mein rakha jata hai. <strong>Werden</strong> finite verb form hai aur yeh doosre position mein hota hai:</p><ul><li>Der Film wird in Europa rauskommen.</li><li>Sie werden im August umziehen.</li></ul> <p>Aap pehle hi is principle se waqif hain modal verbs aur present perfect tense ke sath.</p>"
            },
            {
                "title": "Angrezi Bolne Walon Ke Liye Tips",
                "content": "<p>Jaisa ke saare tenses mein hota hai, German mein future tense ka progressive form ('I will be working') nahi hota. Sirf 'normal' future German mein use hota hai: </p><ul><li>Ich werde arbeiten.</li></ul><p>Future ke bare mein baat karte hue modal verb wollen + infinitive ka istemal na karen. Ich will arbeiten ka matlab 'I will work' nahi hota. Iska matlab hota hai 'I want to work'.</p>"
            }
        ],
        "level": "A1",
        "id": 124
    },
    {
        "unit_name": "UNIT TWENTY-FOUR",
        "level": "A1",
        "learning_content": [
            {
                "title": "Prepositions",
                "content": "<p>Prepositions aam tor par istemal honey walay alfaz hain jaisay ‘from’, ‘on’, ‘with’, ‘under’, Jo jumlay kay mukhtalif hisson kay darmiyan taluq qaim kartay hain. Wo agahi faraham karsaktay hain:</p> <ul><li>Direction: 'Main Germany se hoon.'</li> <li>Position: 'Kitab Meez par hai' ya </li><li>Time: 'Woh aath baje aegi.'</li></ul>"
            },
            {
                "title": "Using prepositions in German",
                "content": "<p>English aur German mein prepositions ka function bohat milta julta hai. German mein complicates banay is baat ki wajah se hai kyun ke prepositions aam tor par kisi certain case ki zaroorat hoti hai. Jumlay Jaisay ke 'Ich bin aus Deutschland' 'Main Germany se hoon' mein koi issue nahi hota kyun ke article nahi hota. Lekin kisi bhi dusaray structures mein jahan preposition article ya possessive se pehle ati hai, aap ko preposition govern karne wale case aur is se hosaktay huye changes ka pata hona chahiye.</p>"
            },
            {
                "title": "Prepositions and cases – an overview",
                "content": "<p>German mein prepositions ko un cases ki zaroorat ke mutabik mukhtalif groups mein banta ja sakta hai.</p><p>Prepositions + accusative case</p><p>Prepositions jo hamesha accusative case ke sath aatay hain un ki important examples hain für ‘for/in favour of’ aur gegen ‘against’:</p><p>Ich bin gegen den Plan.<br> Main is plan ke khilaf hoon.</p>"
            }
        ],
        "id": 125
    },
    {
        "unit_name": "Unit 24: Prepositions + dative case",
        "learning_content": [
            {
                "title": "Zu ‘to’, mit ‘with’ and von ‘from’",
                "content": "Ye aksar istemal hone wale prepositions hain jo dative case ko govern karte hain:<br />       Halanki yahan aik misaal di gayi hai lekin iss misaal ko german mai translate na karen. <br />Mit 'with' ko roman urdu mai 'sath' keh sakte hain. <br /> <br />       Aik dusra group aisa bhi hai jaise in ‘in’, auf ‘on’ aur vor ‘in front of’ jo ya to accusative ho sakte hain ya dative, ye is bat par depend karta hai ke emphasize movement par hai ya position par."
            },
            {
                "title": "Prepositions + accusative case in more detail",
                "content": "Niche diye gaye prepositions hamesha accusative case ke bad atay hain: <br /> bis until <br />durch through <br />für for <br />gegen against, around <br />ohne without <br />um around, at <br />Inki meaning aur usage English aur German mai bohot similar hai, niche kuch misaalein di gayi hain:"
            },
            {
                "title": "Um, Gegen and other prepositions",
                "content": "Yaad rahe ke gegen waqt ke liye bhi refer kar sakta hai: gegen acht Uhr matlab ‘around eight o’clock’. <br />Um directions ke liye use hota hai – um die Welt matlab ‘around the world’ – aur waqt ke liye: um fünf Uhr matlab ‘at ﬁve o’clock’."
            }
        ],
        "level": "A1",
        "id": 126
    },
    {
        "unit_name": "Unit 24",
        "learning_content": [
            {
                "title": "Mafoom: Mufrad maamruf mai izafat in the accusative case",
                "content": "<p>Mufard, malikana ya mufrad mumaraba kein jo maadgi nouns ki taraf ishara karta hai, wo -en mai khatam hota hai:<br /> Kya hum park ke through jate hain? <br /> Main kabhi apne alarm ke bina safar nahi karta. </p><p><u>Mukhtasar forms</u><br /> Note kijiye ke kuch suraton mai takaddus aur mukammal mumaraba das ko jodte hain: durchs = durch das; fürs = für das.</p>"
            },
            {
                "title": "Prepositions + dative case in more detail",
                "content": "<p> Darj bala takaddus hamesha dative case ke sath require hota hai:<br /> aus = from, out of<br /> außer = apart from<br /> bei = at, near<br /> gegenüber = opposite<br /> mit = with, by (for means of transport)<br /> nach = after, to<br /> seit = since, for<br /> von = from<br /> zu = to</p>"
            },
            {
                "title": "Endings in the dative case",
                "content": "<p><u>Mufrad mumaraba dative case ke liey zaruri endings hain -em samet male aur ghair maidaan nouns aur -er samet feminine nouns:</u><br /> Wo train se chali jati hai. (m)<br /> She goes by tube. (f)<br /> Wo cycle se chali jati hai. (nt)</p> <p><u>Mukhtasar forms</u><br /> Note: kuch suraton mai takaddus aur mukammal mumaraba ko milaya jata hai: bei dem often becomes beim, von dem becomes vom, zu der becomes zur and zu dem becomes zum.</p>"
            }
        ],
        "level": "A1",
        "id": 127
    },
    {
        "unit_name": "Unit 24",
        "learning_content": [
            {
                "title": "Usage in both languages",
                "content": "Bauol zubanon ka istemal. Yaddasht rakhye kay bohot saray prepositions English kay baraber hain, magar kuch jaghoun pe German ka istemal buhat alag hota hai. Jaisay, kisi ki mulaqaat ka zikr kerney kay liye, German mei aus istemal hota hai, jaisay: 'Sie kommen aus Berlin.' jiska matlab hai 'Wo Berlin se aatay hain.'<br>  German mei 'bei' istemal hota hai kisi jagah ko specify kerney ya bataney kay liye keh aap kisi kay pass, unki mulaqaat ya unke sath thahr rahey they, jaisay: 'Potsdam liegt bei Berlin.' yani 'Potsdam Berlin kay nazdeek hai.'<br> Safar ki wasayel ki taraf isharah kerney kay liye, German mei mit istemal hota hai jaisay: 'Er fährt mit dem Auto.' yani 'Wo car se safar ker raha hai.'<br> Rastay ya jaghah key directions poochnay per zu istemal hota hai German mei, magar jab hum shehar ya ziyadah tar mumalik ki taraf isharah kertay hain to humay nach ki zarorat hoti hai. In tamam misalon mei, humain muwafiq preposition German mei seekhni hoti hai."
            },
            {
                "title": "Prepositions + accusative or dative in more detail",
                "content": "Kab accusative aur kab dative istemal kerna hai? German mei kuch prepositions ya to accusative ya dative case letay hain, is per depend kerta hai keh emphasis harkat per hai ya position per. Aap shayad is level per in ka sab se ziyada istemal kerenge. German mei 'in' kay sath accusative case aur dative case ka istemal hota hai jab harkat ya position ka zikr hota hai."
            }
        ],
        "level": "A1",
        "id": 128
    },
    {
        "unit_name": "Unit 24",
        "learning_content": [
            {
                "title": "Prepositions",
                "content": "<p> Yahan kuch tarha ke prepositions diye gaye hain: <br>                      at (pe), <br>                      on (pe, par), <br>                      behind (peche), <br>                      next to, beside (kay baghal mein, kay sath), <br>                       over, above, across (upar, par), <br>                       under, among (neechay, beech mein), <br>                       in front of, before (samnay, pehle), <br>                       between (darmiyan mein). </p>"
            },
            {
                "title": "Examples of usage of prepositions",
                "content": "<p> Yahan kuch misaalien di gayi hain jin mein prepositions ka istemal kia gaya hai: <br>  t               Mein kitab ko table par rakhta hoon.  <br>  t               Kitab table par hai. <br>  t               Woh poster ko wall pe laga raha hai. <br>  t               Poster wall pe hai. <br>  t               Woh CDs ko shelves par rakh rahi hai. <br>  t               CDs shelves par hain. </p> "
            },
            {
                "title": "Prepositions + Genitive Case",
                "content": "<p> Kuch prepositions hain jo genitive case kay sath istemal kiye jatay hain. Sab se zaruri yeh hain: <br>  t               despite (ke bawajood), <br>  t               during (doran), <br>  t               because of (ki wajah se), <br> instead of (ki bajaye). </p>"
            }
        ],
        "level": "A1",
        "id": 129
    },
    {
        "unit_name": "Unit 24",
        "learning_content": [
            {
                "title": "Learning tip",
                "content": "<p>Mutahassir na hon prepositions ki bareekiyat se. Shruati satah per aap un sab ko istemal nahi karenge. Ek achay course book mein unhe groups mein taqseem kiya jata hai takay yaad rakhna aapke liye asan ho.<br> Koshish karen ke muqami istemal ke aitbar se unhe yaad karein, ta ke aapko pata ho jab unhe istemal karna hai, aur yaqeeni banayein ke aapko pata hai ke kon sa preposition kon sa case leta hai.</p>"
            },
            {
                "title": "Summary",
                "content": "<p>Yeh ek khulasa hai:</p><p>Maqami istemal ke liye, English title aur content ko Roman Urdu mai behtar aur asan parhnay ke liye tahreer karain.</p>"
            },
            {
                "title": "Exercise 24.1",
                "content": "<p>Neechay diye gaye list se muwafiq preposition muhaiya karain. Pehla kam aap ke liye kr diya gya hai.<br>Agar content exercise ki tarha hai jo user ko test kar raha hai toh sirf khali object return karain sirf taleemi content return karain.</p>"
            }
        ],
        "level": "A1",
        "id": 130
    },
    {
        "unit_name": "Unit 24",
        "learning_content": [
            {
                "title": "Exercise 24.4",
                "content": "<p>Translate the following sentences:</p>  <ul> <li> Wo hum mansoobah ke khilaf hain. </li> <li> Hum Park se guzar rahay hain. </li> <li> Mein aam tor par car se jata hun. </li> <li> Hum aik restaurant tak ja rahen hain. </li>  <li> Railway station kaisey jaoun? </li>  <li> Kya aap cinema ke saath anay wale hain?</li> <li> Weekend ke liye mein Berlin ja raha hun. </li> </ul>"
            },
            {
                "title": "Checklist",
                "content": "<p>Yad kar sakenge aap ke maqaddama ke sath prepositions accusative case ka estemal karte hain aur kaun se dative estemal karte hain? </p> <p>  Aise kai prepositions hain jo ya to accusative ya dative case ka estemal kar sakte hain. Accusative aur dative ke beech matlab me kya antar hai? </p> <p> Kya aap beim, ans, im jaise sankshipth roop yaad kar sakte hain Jo khade ke liye hain? Kya aap aise sankshipt roop ke aur udaharan de sakte hain? </p>"
            }
        ],
        "level": "A1",
        "id": 131
    },
    {
        "unit_name": "UNIT TWENTY-FIVE",
        "learning_content": [
            {
                "title": "Adjective endings",
                "content": ""
            },
            {
                "title": "Adjectives kiya hain?",
                "content": "Adjectives woh alfaz hote hain jo ek noun ke baare main mazeed malomaat dete hain. Jaise 'Ye naya computer hai.': 'Ye exhibition dilchasp hai.': 'Ye kitaab bore kar rahi hai.'"
            },
            {
                "title": "Usage in English",
                "content": "Jaisa ke aap in examples se dekh sakte hain, ek adjective ya toh noun ke baad ya uske pehle a sakta hai. English main isse koi masla nahi hota, kyun ke adjective kabhi apne form ko change nahi karta."
            },
            {
                "title": "Adjective endings in German",
                "content": "German main aam taur pe, adjective ka position bohot farq karte hai."
            },
            {
                "title": "Adjectives after nouns",
                "content": "Agar adjective noun jo describe kar raha hai uske baad aata hai, toh wo change nahi hota jaise 'Computer naya hai' aur 'Exhibition dilchasp hai.'"
            },
            {
                "title": "Adjectives preceding a noun take specific endings",
                "content": "Agar adjective noun ke pehle ata hai, to aap usme ending dalte hai. Niche diye gaye examples dekhe: 'Computer naya hai. Ye naya computer hai.'"
            }
        ],
        "level": "A1",
        "id": 132
    },
    {
        "unit_name": "Unit 25",
        "learning_content": [
            {
                "title": "Samajhnay ki nuktay",
                "content": "<p>Jaisa keh aap jan chukay honge, zaroori khatma noun ki jins ko darshata hai. Lekin doosre nuktay samajhne ki zaroorat hai: case or ye ke adjective kya nae irrada (ein, eine) se mila hua hai ya muqarrara irrada (der, die, das) se ya phir kisi bhi noun se pehlay baghair article ke. Ye thora pechida lag sakta hai lekin asal mein bohat sara khatmay aik jesay hotay hain or kuch neklay jaa saktay hain. </p>"
            },
            {
                "title": "Na maloom irrada ke saath sifat",
                "content": "<p>Aap ne abhi dekha hai nominative case mein sifat khatmay kaisay kaam kartay hain:</p><ul><li>Yeh aik naya computer hai.</li><li>Yeh aik dilchasp numaish hai.</li><li>Yeh aik boring kitab hai.</li></ul><p>Ghaur kijiye ke muqarrara article (der, die, das) ki kami mein, sifat muqarrara article khatmay leta hai (-er, -e, -es) or noun ko 'mark' karta hai, yaani isay mardana, femimine ya khushki hota hai.</p>"
            },
            {
                "title": "Ilzami Case",
                "content": "<p>Ilzami case mein khatmay nominative jaisay hotay hain, siwa mardana noun ko bayan kernay wali sifat, jis mein -en shamil kia gaya hai:</p><ul><li>Claudia nay aik naya computer khareeda hai.</li><li>Woh aik dilchasp numaish mein ja raha hai.</li><li>Woh aik boring kitab parh raha hai.</li></ul>"
            }
        ],
        "level": "A1",
        "id": 133
    },
    {
        "unit_name": "Unit 25",
        "level": "A1",
        "learning_content": [
            {
                "title": "Dative case",
                "content": "Dative case mein adjective endings asan hain - ve sab -en shamil karte hain. Articles mein zaruri tabdeelian zarur karein. Maslan: <br/> 'Mit einem neuen Computer' ko english mein hum kehte hain 'With a new computer one can work faster.' Ya phir, 'Sie trafen sich auf einer interessanten Ausstellung.' ka english tarjuma hoga 'They met at an interesting exhibition.'"
            },
            {
                "title": "Possessives and kein",
                "content": "Yaad rakhein, yeh tamam endings tab bhi lagti hain jab adjective ki peechay possessives (mein, dein, sein vagera) ya manfi kein ho. Maslan:<br/> 'Das ist mein neuer Computer.' ka english tarjuma hoga 'This is my new computer.' Aur, 'Das ist keine gute Ausstellung.' ka english tarjuma hota hai 'This is not a good exhibition.'"
            },
            {
                "title": "Plural forms",
                "content": "Wazeh rahe ke indefinite article 'a'/ein plural ke liye istemal nahi ho sakta. Possessives aur kein ke baad, tamam adjectives -en shamil karte hain. Nechay di gayi table se mazeed tafseelat hasil karein."
            },
            {
                "title": "Summary – adjective endings after the indeﬁnite article",
                "content": "Yeh an overview hai tamam adjective endings ka indefinite article ke baad. Hum ne genitive case ke liye endings bhi shamil ki hain, halanki aap unka istemal shayad baad mein karenge."
            }
        ],
        "id": 134
    },
    {
        "unit_name": "Unit 25",
        "learning_content": [
            {
                "title": "Adjective Rules i.e Adjectives with no articles",
                "content": "<p>Naam ke baghair istemaal hone wale adjectives ka pattern indefinite article ke pattern jaisa hota hai. In fact, yeh Nomitative aur Accusative singular mein identical hote hain, jahan noun ke liye adjective 'marker' ki tarah kaam karta hai:</p>"
            },
            {
                "title": "Nominative Case",
                "content": "<ul><li><i>Deutscher Wein ist oft süß</i>: German wine hamesha meethi hoti hai.</li> <li><i>Italienische Pizza ist sehr populär</i>: Italian pizza buhat popular hai.</li><li><i>Tschechisches Bier schmeckt gut</i>: Czech beer achi hoti hai.</li></ul>"
            },
            {
                "title": "Accusative Case",
                "content": "<ul><li><i>Er mag deutschen Wein</i>: Woh German wine pasand karta hai.</li><li><i>Sie liebt italienische Pizza</i>: Usko Italian pizza pasand hai.</li><li><i>Er trinkt viel tschechisches Bier</i>: Woh buhat Czech beer peeta hai.</li></ul>"
            },
            {
                "title": "Dative Case",
                "content": "<ul><li><i>Fisch passt zu deutschem Wein</i>: Fish German wine ke saath achi lagti hai.</li><li><i>Was hältst du von italienischer Pizza?</i>: Italian pizza ke baare mein aapka kya khayal hai?</li><li><i>Von tschechischem Bier bekommt man keinen Kater</i>: Czech beer se aapko hangover nahi hoga.</li></ul>"
            },
            {
                "title": "Plural Forms",
                "content": "<p>Nominative aur Accusative cases mein plural 'e' add karte hain, aur dative case ko 'en' ending ki zaroorat hoti hai. Iske aur tafseelat ke liye neeche diye gaye table dekhein.</p>"
            }
        ],
        "level": "A1",
        "id": 135
    },
    {
        "unit_name": "Unit 25 – Adjective Endings Without Articles",
        "level": "A1",
        "learning_content": [
            {
                "title": "Adjective Endings in Nominative Case",
                "content": "<p>Jab muarif (der, die, das) mange hote hain to wo wazahat se sangya ki ling (gender) ko 'mark' karte hain. Tamam visheshan '-e' jodte hain:</p> <p>Der blaue Rock sieht gut aus. (Neela skirt acha lag raha hai.)</p> <p>Die grüne Jacke steht ihr. (Us par hara jacket acha lagta hai.)</p> <p>Das blaue Hemd kommt aus Italien. (Neeli kameez Italy se hai.)</p>"
            },
            {
                "title": "Adjective Endings in Accusative Case",
                "content": "<p>Jab nominative mein samaanantaran roopta hote hain, mardana sangya ke bad '-en' joda jata hai:</p> <p>Heute trägt sie den blauen Rock. (Aaj woh neela skirt pehna hua hai.)</p> <p>Sie mag die grüne Jacke. (Usko hara jacket pasand hai.)</p> <p>Er kauft das blaue Hemd. (Woh neeli shirt khareed raha hai.)</p>"
            },
            {
                "title": "Adjective Endings in Dative Case and Plural Forms",
                "content": "<p>Dative mein visheshan '-en' jodte hain:</p> <p>Sie trägt ihren Mantel mit dem blauen Rock/der grünen Jacke/dem blauen Hemd. (Usne apna coat neele skirt/hare jacket/neeli shirt ke sath pehna hua hai.)</p> <p>As in the dative, all plural forms add '-en'. See the table below for more details.</p>"
            }
        ],
        "id": 136
    },
    {
        "unit_name": "Unit 25",
        "learning_content": [
            {
                "title": "Maeyaar-baaz modiﬁers",
                "content": "Maeyaar-baaz 'dieser' ‘this’, ‘these’, jeder ‘each’, ‘every’ aur welcher ‘which’, ‘what’ follow the pattern of the deﬁnite article and require the same adjective endings. <br>For example:<br>This blue skirt costs only 20 euros. (Ye neeli skirt sirf 20 euro ki hai.) <br> Each new shirt comes from London. (Har nai shirt London se aati hai.)"
            },
            {
                "title": "Comparative and superlative adjectives",
                "content": " Jab ek noun ke saamne hain, to comparative and superlative adjectives apne endings change kar lete hain.<br>For example:<br> They bought a bigger house. (Unho ne ek bara ghar khareeda.) <br> The best wine comes from Italy. (Behtareen wine Italy se aati hai.)"
            },
            {
                "title": "Definite article ke baad adjective endings",
                "content": "Ye ek overview hai sab adjective endings ke baare mein after the deﬁnite article.<br> For example:<br>den blauen Rock (Neela skirt)<br> die grüne Jacke (Hara jacket)<br> das blaue Hemd (Neeli shirt)<br> die neuen Schuhe (Naye shoes)"
            }
        ],
        "level": "A1",
        "id": 137
    },
    {
        "unit_name": "Unit 25",
        "learning_content": [
            {
                "title": "Exercise 25.4",
                "content": "Mandarja zail jumlay ka tarjuma karen:<br/>1. Salam-o-Alaikum.<br/>2. Shab bakhair.<br/>3. Yeh ek khoobsurat din hai.<br/>4. Usne ek dilchasp kitab khareedi hai.<br/>5. Nayaa computer bohat mehnga tha.<br/>6. Mujhe neelay suit ka shaq hai.<br/>7. Main kaale jootay pehanta hoon."
            },
            {
                "title": "Checklist",
                "content": "1. Sifat Naam ke pehle aur baad mein rakh sakte hain. Kaun se sifat naam ko shuru karna chahiye?<br/>2. Tum definite article ke baad adjective endings yaad rakh sakte ho?<br/>3. Tum indefinite article ke baad adjective endings yaad rakh sakte ho?<br/>4. Tum yaad rakh sakte ho, jab koi article istemal na ho to adjective endings kia honi chaiye?"
            }
        ],
        "level": "A1",
        "id": 138
    },
    {
        "unit_name": "UNIT TEES CHHE (UNIT TWENTY-SIX)",
        "learning_content": [
            {
                "title": "Numbers and Dates",
                "content": "<p>Numbers aur dates har zubaan mein ahem hote hain. English aur German mein numbers ki formation aur use mein bohot similarity hoti hai, lekin German mein ordinal numbers (like ‘ﬁrst’, ‘second’ etc.) ko use karne k liye adjectives ki tarha endings ki zaroorat hoti hai.</p>"
            },
            {
                "title": "Numbers",
                "content": "<p>German mein 0 se 20 tak k cardinal numbers yeh hain:</p> <ul> <li>0 null</li>  <li>1 eins</li> <li>11 elf</li> <li>2 zwei</li> <li>12 zwölf</li> <li>3 drei</li> <li>13 dreizehn</li> <li>4 vier</li> <li>14 vierzehn</li> <li>5 fünf</li> <li>15 fünfzehn</li> <li>6 sechs</li> <li>16 sechzehn</li> <li>7 sieben</li> <li>17 siebzehn</li> <li>8 acht</li> <li>18 achtzehn</li> <li>9 neun</li> <li>19 neunzehn</li> <li>10 zehn</li> <li>20 zwanzig</li> </ul></p> <p>English ki tarah German mein bhi 'zehen' yaani 'ten' use hota hain 13 se 19 numbers form karne k liye. Yahan note karen k sechzehn aur siebzehn mein s aur en respectively drop kar diya jata hain.</p>"
            }
        ],
        "level": "A1",
        "id": 139
    },
    {
        "unit_name": "Numbers 20–100",
        "learning_content": [
            {
                "title": "Das Tens",
                "content": "<p>20 se zwanzig, 30 yani dreiβig, 40 yani vierzig, 50 yani fünfzig, 60 yani sechzig, 70 yani siebzig, 80 yani achtzig aur 90 yani neunzig. Notice karo ki dreiβig z ki bajaye ß se spell kiya jata hai. Is tara sechzig main s ko drop kar dia jata hai aur siebzig main en ko.</p>"
            },
            {
                "title": "20 se upper Numbers",
                "content": "<p>20 se upper numbers bananay ke liye pehle unit number aata hai, phir und aur uske baad dasweh. Yeh English se different hai jaha pehle tens aata hai aur phir single number: jaise twenty-one. German mai yeh literally tarjuma kiya jata hai one-and-twenty.</p><p>21 yani einundzwanzig, 32 yani zweiunddreißig, 44 yani vierundvierzig, 56 yani sechsundfünzig etc.</p><p>20 se upper numbers main eins ne s ko drop kar dia jata hai (jaise einunddreißig, einundvierzig, etc.).</p>"
            },
            {
                "title": "100 aur uske upper Numbers",
                "content": "<p>Number banane ke liye pehle hundred ki tadaad do, phir tens aur units add karein jaisa upar explain kiya gya hai:</p><p>100 yani (ein)hundert, 202 yani zweihundertzwei, 310 yani dreihundertzehn, 456 yani vierhundertsechsundfünfzig, 889 yani achthundertneunundachtzig</p><p>Modern German main normally hundert ke bad und nhi jodtay. Yehi applies hota hai 1000 se uper numbers main:</p><p>1020 yani (ein)tausendzwanzig, 7455 yani siebentausendvierhundertfünfundfünfzig, 450000 yani vierhundertfünfzigtausend</p>"
            }
        ],
        "level": "A1",
        "id": 140
    },
    {
        "unit_name": "Unit 26",
        "learning_content": [
            {
                "title": "Lambhay Alfaaz aur Adad",
                "content": "Aap ne shayad note kiya ho ga ke German mein tamam adad aik hi lafz ke tor par likhay jatay hain. Sirf aik million se zayada ke adad alag-alag likhay jatay hain.   <br> Misal ke tor par, eine Million einhunderttausend (1  100 000) aur zehn Millionen achthunderttausend (10 800 000)."
            },
            {
                "title": "Tarikhain - Tarteeb Adad",
                "content": "German mein tarikhain (pehla, dosra waghera) kehne ke liye:   <br> • -te bhi shamil karain numbers up to 19 tak   <br> • -ste bhi shamil karain numbers from 20 tak.   <br> Ye adad ('pehla', 'dosra' waghera) ko ordinal numbers kehte hain. Kyunki ordinal numbers aam taur par aik noun ke bare mein ziada maloomat dete hain (misal ke tor, 'February ka pehla'), to woh munasib adjective ending laite hain. Aksar agar aik ordinal number ke aage dative case mein preposition ho, to us par dative ending lagati hai, -n shamil karke:   <br> • am vierzehnten Mai (Chauda May ke)   <br> • am dreißigsten April (tees April ke)"
            },
            {
                "title": "Pehla se Unnees Tak ke Tarteeb Adad",
                "content": "Adad unnis tak pehlay se shaamil karain -te:   <br> • erste (pehla)   <br> • zweite (dosra)   <br> • dritte (teesra)   <br>• vierte (chotha)   <br> aur isi tarha aage chaltay jain.   <br> Heute ist der sechste Mai. (Aaj chh May hai.)"
            }
        ],
        "level": "A1",
        "id": 141
    },
    {
        "unit_name": "Unit 26",
        "level": "A1",
        "learning_content": [
            {
                "title": "Thoday se be-mutabiq forms",
                "content": "Note karein kuch thoday irregular forms: der erste (‘the ﬁrst’), der dritte (‘the third’) and der siebte (‘the seventh’). <br>"
            },
            {
                "title": "Beeswi onward k liye tareeqa kar",
                "content": "Twentieth se agay tamam numbers k liye -ste shamil karein:<br> einundzwanzigste, einunddreißigste.<br> Jaise ke, <i>'Heute ist der fünfundzwanzigste Mai.'</i> Ka tarjuma hota hai 'Aaj May ki 25vi tarikh hai.'"
            },
            {
                "title": "Taarikh k sath ordinal numbers",
                "content": "kisi bhi tareekh par kuch hota hai, to german me 'am' ka istemal hota hai. <i>'Am'</i> par dative ending lagti hai. <i>'Am'</i> (an + dem) k bad dative case ati hai, isi liye -te aur -ste endings me extra -n shamil hona zaruri hai."
            },
            {
                "title": "Mazeed izharat",
                "content": "Mazeed istemal hone wale harf jar jo ke dative case ke sath jate hain wo hain 'seit' matlab 'since'/'from', 'von' matlab 'from', 'zu' matlab 'until'."
            },
            {
                "title": "German me saal ka zikar",
                "content": "Saalon ka hawala dete hue, German 'in' ka istemal nahi karta jaise English me hota hai."
            }
        ],
        "id": 142
    },
    {
        "unit_name": "Unit 26",
        "learning_content": [
            {
                "title": "Berlin's Wall and Goethe's Birth Year",
                "content": "Die Berliner Mauer girya 1989 mein. Berlin ki Dewaar 1989 mein gir gayi thi. Ye 1989 ko likhne ka ek tariqa hai. Goethe 1749 mein paida hue the. Yani ke siebzehnhundertneunundvierzig. Ye bhi im Jahre se kaha ja sakta hai lekin ye kuch zyada hi shaan daar hota hai: Goethe wurde im Jahre 1749. Goethe baras 1749 main paida hue the."
            },
            {
                "title": "Exercise 26.1",
                "content": ""
            },
            {
                "title": "Important Events and Festivals in Germany",
                "content": "Yahan Germany ke kuch important events aur festivals diye gaye hain. In numbers ko der erste, der zweite waghera ke structure mein write out karain. Jaise 'the first', 'the second' etc."
            }
        ],
        "level": "A1",
        "id": 143
    },
    {
        "unit_name": "Unit 26",
        "learning_content": [
            {
                "title": "Content: 6",
                "content": "Woh saat January ko paida hui thi.t7tMain twenty-eight February ko Munich ja raha hoon.t8tOktoberfest bees September ko shuru hota hai."
            },
            {
                "title": "Checklist",
                "content": "1 Kya aap twenty ke baad numbers kaise form karte hain? English se kya difference hai? t2 Aap tarikh kaise batate hain? t3 Kisi din kuch hone par tarikh mein kya badal jata hai? t4 Saal ke hawale se English German se kaise alag hai?"
            },
            {
                "title": "Questions",
                "content": ""
            }
        ],
        "level": "A1",
        "id": 144
    },
    {
        "unit_name": "UNIT TWENTY-SEVEN - Conjunctions and clauses",
        "level": "A1",
        "learning_content": [
            {
                "title": "Conjunctions Kya Hain?",
                "content": "<p>Agar aapke paas ek se zyada clause hain, to usually clauses ek linking word se connected hote hain. Ye linking words 'conjunctions' hain. Ye 'and', 'or', 'but', 'because' jaise words hain.</p>"
            },
            {
                "title": "Conjunctions se Clauses ke Darmiyan Rishtey",
                "content": "<p>Mukhtalif conjunctions do clauses ko connect karne ka tareeqa batate hain. Misal ke taur par, aap 'and' ka istemal kar ke simply (ya zyada) clauses ko jod sakte hain, ya phir dusre clause mein pehle clause ke liye wajah batane ke liye 'because' ka istemal kar sakte hain.</p>"
            },
            {
                "title": "Zyada Ahem Rishton ka Jaaiza",
                "content": "<p>Yaha kuch examples hain:<br><br>                     Clause 1: 'He works for Siemens'<br>                     Conjunction: 'and'<br>                     Clause 2: 'she works for Ford'<br><br>                     Clause 1: 'Will you come at six tonight'<br>                     Conjunction: 'or'<br>                     Clause 2: 'aren’t you free then'<br><br>                     Clause 1: 'They’ve lived in England for seventeen years'<br>                     Conjunction: 'but'<br>                     Clause 2: 'they’ve only been in London for a year'<br><br>                     Clause 1: 'He hasn’t answered'<br>                     Conjunction: 'because'<br>                     Clause 2: 'he doesn’t speak German'</p>"
            }
        ],
        "id": 145
    },
    {
        "unit_name": "Unit 27",
        "learning_content": [
            {
                "title": "Do Mukhayya Giroh: Milawat or Zere Tasht",
                "content": "<p>German mein, hum Milawat or Zere Tasht ko do bari giroh mein taqseem kar sakte hain. <br/>Milawat conjuction jaise ke 'aber' (magar) or 'oder' (ya) jin ka maamooli taur par do mukhayya jumley milate hain or in per lafz ki tarteeb ka koi asar nahi hota. Inhe hum Milawat Giroh kehte hain. <br/> Zere Tasht jumlon ki misal 'dass' (wah) or 'obwohl' (halan ke) hai. Is giroh ke fiqra aam taur par aik zere tashte jumla taqreeb karate hain or muqarar fiqra ko jumla ke akhir mein bhejte hain. <br/> Koi mantiq nahi hai ke kuch fiqra aik mukhayya jumla ka izhar karte hain or dusre aik zere tashte jumla ka. Aap ko inhe yaad karne ki zaroorat hai.</p><br/>"
            },
            {
                "title": "Milawat Fiqra Tafseel se",
                "content": "<p>Sab se aham milawat fiqra hain: <br/> und (or) <br/> aber (magar) <br/> oder (ya) <br/> denn (kyon ke) <br/> sondern (magar, aik manfi bayan ke baad) <br/> In tamam fiqron ka kaam english fiqron ke siwa karne wala hai. In ka matlub or istemaal agle daakhle mein wazeh kiya gaya hai.</p>"
            }
        ],
        "level": "A1",
        "id": 146
    },
    {
        "unit_name": "Unit 27: Co-ordinating conjunctions in use",
        "learning_content": [
            {
                "title": "Und",
                "content": "Und wohi istamal kia jata hai jaisay English main 'and' hota hai. Ye do aldoolaat ko jorhta hai, unko 'shamil' karta hai:<br> Agar subject diye gaye do jotay main same hain jo 'und' se connect hain toh aap doosray jotay main isko repeat kar sakte hain (magar zaroori nahi hain ke repeat karain).<br>"
            },
            {
                "title": "Aber",
                "content": "Aber English main 'but' ki tarha istamal hota hai. Doosri aldoohlat pehli aldoohlat ke mukhalif malomat rakhti hai:<br> Note karen ke 'aber' ke saamne hamesha comma hota hai.<br>"
            },
            {
                "title": "Oder",
                "content": "Oder English main 'or' ki tarha kaam karta hai. Doosri aldoohlat ek mutabadil izhaar karti hai:<br> Iss stage pe, jab aap kuch sujhaw dete hain ya jab aap sawal kar rahe hote hain tab aap 'oder' ka zyada istamal karte hain.<br>"
            }
        ],
        "level": "A1",
        "id": 147
    },
    {
        "unit_name": "Unit 27",
        "learning_content": [
            {
                "title": "Denn",
                "content": "<p>'Denn' angrezi zaban ke 'because' jaise kaam karta hai. Yeh jalasey introduce karta hai jo pehle jalasey ke liye wajah detey hain:</p>t<p>Always remember, 'denn' se pehle hamesha comma ata hai.</p>"
            },
            {
                "title": "Sondern",
                "content": "<p>'Sondern' ek negative ke baad 'but' ka idea express karta hai. 'Sondern' ke zikar ke waqt hamesha comma lagaya jata hai. Yeh negative jalasey(contradicting that negative information) ke baad istemal hota hai 'but' ke sense mein</p>"
            },
            {
                "title": "Subordinating conjunctions",
                "content": "<p>Subordinating conjunctions ki tarah ke 'dass' yaani 'that', 'obwohl' yaani 'although' ya 'wenn' yaani 'when' introduce a subordinate clause and send the finite verb to the end. Yeh kuch examples hain:</p>"
            }
        ],
        "level": "A1",
        "id": 148
    },
    {
        "unit_name": "Unit 27",
        "learning_content": [
            {
                "title": "Dass",
                "content": "Dass angrezi 'that' ki tarhan istemal hota hai jesy k verbs k baad jesy k 'glauben' yani 'believe', 'meinen' yani 'be of the opinion' aur 'denken' yani 'think' ya phir reported speech k doran (for example, 'sagen' yani 'say' ya 'berichten' yani 'report') ke bad:"
            },
            {
                "title": "Obwohl",
                "content": "Obwohl ka istemal aik qualification ya contrast express karne k liye hota hai. Angrezi equivalent 'although' hai:"
            },
            {
                "title": "Weil",
                "content": "Weil istemal hota hai angrezi 'because' k liye. Ye 'denn' ke jesa hai lekin ye zyada tar bol chal ki German me istemal hota hai. Halaan k 'denn' aur 'weil' ka mtlb bilkul wesa hi hai."
            }
        ],
        "level": "A1",
        "id": 149
    },
    {
        "unit_name": "Unit 27",
        "learning_content": [
            {
                "title": "Als se istemaal",
                "content": "<p>'Als' ka istemaal maazi ke waqt mein kiye jatay hain, jaisa ke ek waqia ya lambay arsay ke liye: </p> <ul> <li>Hum wahan nahin the, jab Jens ko hadsa hua. </li> <li>Main Canada mein rehta tha jab main bacha tha. </li> </ul>"
            },
            {
                "title": "Wenn ka istemaal",
                "content": "<p>'Wenn' ka do tariqay se istemaal hota hai. Ek English 'if' ke mutabiq hota hai: </p> <ul> <li>Agar aap iska shauq rakhte hain, to hum cinema ja sakte hain.</li>  <li>Main aapki madad nahin karunga agar aap mehnat nahin karte hain.</li> </ul> <p>Dosra istemaal maazi mein baar baar hote huye cheezon se mutaliq hota hai: </p> <ul> <li>Jab bhi usay waqt mila, woh hamesha cinema jata tha.</li> <li>Woh ghar jaate the jab unke paas paisa khatm ho jata tha.</li> </ul>"
            },
            {
                "title": "Wenn ka istemaal (Bar bar maazi mein ya haal mein)",
                "content": "<p>Yahan kuch misaalen hain jab 'wenn' ka istemaal bar bar maazi ya haal mein hota hai: </p>t<samp> <li>Woh kabhi farigh nahi hota jab uski girlfriend visit karti hai.</li>  <li>Hum ghar mein rehte hain jab barish hoti hai. </li> <li>Hum school nahin jaate the jab hawa 25 darje se zyada garam hoti thi. </li> </ul>"
            }
        ],
        "level": "A1",
        "id": 150
    },
    {
        "unit_name": "Unit 27: Commas ka Istemal",
        "learning_content": [
            {
                "title": "Do verbs in a subordinate clause",
                "content": "Agar subordinate clause mein ek se zyada verb ki form hai, to finite verb – Jis verb ka form badle – bilkul akhri position pe move hojata hai. Yani:   Max ko aaj afsos ke sath cancel karna parega (Max muss heute leider absagen)  → Jis ki wajah Max ko cancel karna para(weil Max absagen muss).   Main ne uska number bhool gaya (Ich habe seine Nummer vergessen) → Jis ki wajah main uska number bhool gaya(weil ich seine Nummer vergessen habe).  Aksar finite verb ya to modal verb hoti hai ya phir auxiliary verb (haben ya sein)."
            },
            {
                "title": "Starting with a subordinate clause",
                "content": "German mein common hota hai ke sentence subordinate clause se shuru kiya jaye. Is case mein subordinate clause k finite verb k akhir mein hoti hai aur main clause ki finite verb uske clause ki front pe move hojati hai. Yani:   Kyun k wo Berlin ka ek dost rakhti hai, is liye wo german sikh rhi hai. (Weil sie einen Freund aus Berlin hat, lernt sie Deutsch).  Jab masalan jab wo bacha tha, wo bohot football khelta tha. (Als er ein Kind war, spielte er viel Fußball)  Ye dono finite verbs aik dusre k sath khari hoti hain aur in k beech comma hota hai."
            },
            {
                "title": "Conjunctions aur clauses – Main points",
                "content": "Yahan kuch points yaad rakhne hain about conjunctions aur clauses:  • Agar aap do clauses link kar rahe hain und se aur subject dono mein same hai, to aapko doosre clause mein repeat karne ki zaroorat nahi.  • Denn aur weil dono ka matlab ‘because’ hota hai.  • Wenn aur als ka matlab thora german mein alag hota hai, lekin english inko differentiate nahi karti sirf ‘when’ use karti hai.  • Subordinate clause mein, finite verb hamesha akhir mein hoti hai.  • Aksar comma hota hai conjunctions se pehle jo introduce karte hain subordinate clause aur pehle aber aur denn."
            }
        ],
        "level": "A1",
        "id": 151
    },
    {
        "unit_name": "Unit 27",
        "learning_content": [
            {
                "title": "Jab aap dosray jumlay main mozo nakal sakty hain?",
                "content": "<p>Tab ap nay kuch bhi nahi nakalna hota. Isi tareeqay se aap doosray jumlay main sirf wo alfaz istemal kijye jin ki aap ko zaroorat ho aur baqiyan nakal kiye begair chor dain.</p>"
            },
            {
                "title": "Konse ataat aik matheeti jumlay ki ibtidaa karti hain?",
                "content": "<p>Is jumlay ki ibtidaa Ataat say hoti hai. Ataat yani wo lafz ya fraz jab istemal hota hai to jumlay ka matlab ya us ki samajh badal jati hai.</p>"
            },
            {
                "title": "Matheeti jumlay main muqarrar feal kia hota hai?",
                "content": "<p>Jab aap kisi feal ya kaam ki baat kartay hain jis kay barey main aap pehle say jaan rakhtay hain. Ya phir kisi aisi baat ki tasdiq kartey hain jis ka aap ko ilm ho. To esay feal ko muqarrar feal kehtay hain.</p>"
            },
            {
                "title": "Wenn aur Als ka matlab kia hota hai?",
                "content": "<p>'Wenn' ka lafzi mana jab hota hai aur 'Als' ka lafzi mana 'Jaisa' hota hai. Dono alfaz apni jagah pe istemal hote hain.</p>"
            },
            {
                "title": "Denn aur Weil main farq kia hai?",
                "content": "<p>'Denn' aur 'Weil' dono ka lafzi matlab 'Kyunki' hota hai. Lekin in dono alfazon ka istemal alag alag context main hota hai.</p>"
            }
        ],
        "level": "A1",
        "id": 152
    },
    {
        "unit_name": "UNIT TWENTY-EIGHT",
        "learning_content": [
            {
                "title": "Alfaz ka tarteeb",
                "content": "English main alfaz ka tarteeb bohat sakhti se muqarar hai. Asal pattern yeh hota hai keh pehlay subject aata hai, phir verb aur uskay baad object ya digar elements (S–V–O)."
            },
            {
                "title": "Position of the verb",
                "content": "German ki sentences main verb ka position bohat aham hai. Agar sentence main do verb form hote hain to aik akhir main chala jata hai (infinitive ya participle), jabkeh doosra – finite verb – dosray number par rehta hai. Subordinate clauses main finite verb ko akhir main bheja jata hai."
            },
            {
                "title": "Time – Manner – Place",
                "content": "Aik aur rule hai jo sentence ke mukhtalif elements ki sequencing se mutalliq hai. Time expressions hamesha manner (yani kisi kaam ko kaise kia jata hai) se pehle aate hain aur phir place (jagah) ki tafseelat aati hain."
            }
        ],
        "level": "A1",
        "id": 153
    },
    {
        "unit_name": "German Grammar Basics",
        "learning_content": [
            {
                "title": "Verb ki Position",
                "content": "<p>German mein, basic rule ye hota hai k verb statement mein hamesha second position pe hoti hai. Aam taur pe, German ki basic pattern English jesi hoti hai: subject – verb – object ya koi or elements.</p>"
            },
            {
                "title": "German mein Flexibility",
                "content": "<p>German word order English se zyada flexible hai. Aap subject k ilawa kai elements ko first position pe rakh sakte hain. Time ya location k description ko first position pe rakhna aam baat hai.</p>"
            },
            {
                "title": "Subject–verb inversion",
                "content": "<p>Agar subject first position pe nahi hai, to wo verb k foran baad rakh diya jata hai. Is German grammar feature ko 'subject–verb inversion' kaha jata hai. English speakers k liye ye masla ban sakta hai, q k English sentence mein subject hamesha verb se pehle hota hai: ‘Next week we go to Italy with my parents.’ German mein, agar aap ne time expression ko first place pe rakha hai to finite verb hamesha subject se pehle ati hai.</p>"
            }
        ],
        "level": "A1",
        "id": 154
    },
    {
        "unit_name": "Unit 28",
        "learning_content": [
            {
                "title": "Sentence Starting with Other Words",
                "content": "<p>Kisi sentence ko <strong> emphasize </strong> krnay k liye hum finite verb se pehle kisi dusri element ko rakh sakte hain. <br> Agar aap ye zaor dena chah rahay hain k aap apnay parents k sath Italy ja rahay hain kisi aur k sath nahi, to aap pehlay element mein ye daalain k aap k parents k sath ja rahay hain.</p>"
            },
            {
                "title": "Common Words or Expressions frequently used at start",
                "content": "<p>Iss tarah kuch aur words ya phrases hain jo sentence k shuru mein istemaal hotay hain:<br> <strong> danach (jis k matlab hota hai agay), dann (jis k matlab hota hai phir), deswegen (jis k matlab hota hai isi liye), glücklicherweise (jis k matlab hota hai khushqismati se), leider (jis k matlab hota hai afsos se), manchmal (jis k matlab hota hai kabhi kabhi), zum Glück (jis k matlab hota hai khushqismati se).</strong> </p>"
            },
            {
                "title": "Two verbs in a Sentence",
                "content": "<p>Ek sentence mein do verb forms bhi ho sakti hain. Agar yeh hota hai, to ek verb form – jo finite verb hota hai – dosray position mein jata hai, jab k dosra verb form (jo infinitive ya participle hota hai) clause k end mein hota hai. <br> German mein is principle ko Satzklammer ‘sentence bracket’ kaha jata hai, jo literal matlab hota hai k do verb forms sentence ko ‘bracket’ kartay hain.</p>"
            }
        ],
        "level": "A1",
        "id": 155
    },
    {
        "unit_name": "Unit 28",
        "learning_content": [
            {
                "title": "Petra aglay saal Australia chali jayegi",
                "content": "Petra aglay saal Australia chali jayegi. <br> <br>"
            },
            {
                "title": "Moajooda kamal tenses",
                "content": "Kal hum cinema gaye thay. <br> Unho ne mujhe aath baje phone kiya tha. <br>"
            },
            {
                "title": "Alag karnay wale verbs",
                "content": "Bachay chuttiyon me televion ziada daikhtay hain."
            },
            {
                "title": "Haan ya na sawalat aur hukum",
                "content": "Kya tum kal mere saath cinema jaoge? <br> Kya tum mujhe ice cream khareedoge? <br>"
            },
            {
                "title": "Hukum",
                "content": "Mujhe kitab dedo! <br> Darwaza kholo! <br>"
            },
            {
                "title": "Matlooba jumlay se pehle mukammal jumla",
                "content": "Agar tum kal aoge, tum mujhe madad kar saktay ho. <br> Kyun ke usay dil nahi tha, wo cinema nahi gaya. <br>"
            }
        ],
        "level": "A1",
        "id": 156
    },
    {
        "unit_name": "Unit 28",
        "learning_content": [
            {
                "title": "Subordinating Clauses: Finite Verb Position",
                "content": "<p>Zar Talibon mai bhi fikar verb akhir mein hoti hai. Lekin, yahan qanoon thora mukhtalif hai. Zar talibon mein yeh qanoon nahi lagu hota keh fikar verb ko dosra position pr hona chahye. Bajaye eske, wo clause ke akhir mein jati hai. Zar talibon ko 'weil', 'wenn', 'dass', wagairah jaisay zarbaton se shuru kiya jata hai.</p>"
            },
            {
                "title": "Zayada se Zayada Verbs in Subordinating Clauses",
                "content": "<p>German mai aik bohat mash'hoor qanoon hai, wo hai verbs shape talay jama karne ka qanoon. Yeh waqia, jab aap perfect tense ya modal verb use kar rahe hain, zar talibon ke akhir mai hota hai.</p> <p>Clause ke end mai verbs ki tarteeb ka rule bohat asan hai: verb ke sath verb ending – jo keh finite verb hai - clause ke akhir pr rakhein.</p>"
            },
            {
                "title": "Aik Sentence ko Subordinating clause ke sath Shuru Karna",
                "content": "<p>Yeh bhi mumkin hai keh aik sentence ko aik zar taliyah ke sath shuru kiya jaye. Jaisa ke aap umeed kar rahe honge, zar taliyah ke fikar verb uske taliyah ke akhir mai jati hai, magar fikar verb mukhya taliyah mai apne taliyah ke aglay pr chali jati hai.</p> <p>Do fikar verbs ek doosre ke bagal mein hoti hain, jo keh aik comma se alag hoti hain.</p>"
            }
        ],
        "level": "A1",
        "id": 157
    },
    {
        "unit_name": "Unit 28",
        "learning_content": [
            {
                "title": "Waqt, Tareeka, Jagah",
                "content": "<p>Jaisa keh hum nay pehlay dekha, waqt ya jagah ya kisi bhi dosray element ka izhar aasani say sentence ke pehli position mein ho sakta hai agar aap kisi khas item par zyada tawajjo dena chahtay hain.<p>"
            },
            {
                "title": "Bunyadi Usool",
                "content": "<p>Magar, wahan kuch guidelines hain jinhay verb kay baad anay walay elements follow kartay hain. Aam taur par woh is tarteeb ko follow kartay hain:</p><p>- Waqt (kab?) <br> - Tareeka (kesay?) <br> - Jagah (kahan/kahan tak?)</p><p>Waqt - Tareeka - Jagah kay rule ke mutabik, waqt ka description baaki do elements say pehlay ana chahiye.</p>"
            },
            {
                "title": "Dosray combinations",
                "content": "<p>Aksar teeno elements maujood nahi hotay. Magar, baqi items ki tarteeb Waqt - Tareeka - Jagah kay usool ko follow karti chahiye:</p>"
            },
            {
                "title": "Mozu-verb inversion",
                "content": "<p>Agar koi element pehli position par ata hai, tu subject - verb inversion (finite verb kay baad subject anay ka rule) apply karnay na bhulen:</p>"
            }
        ],
        "level": "A1",
        "id": 158
    },
    {
        "unit_name": "Unit 28",
        "learning_content": [
            {
                "title": "Exercise 28.4",
                "content": "<p>Mutarjam keejiye mandarja zail sentences ko:</p> <ol> <li>Main tumhein phone karunga jab main tayyar hojao.</li> <li>Usay ghar jana chahiye kyun ke bohat der hogayi hai.</li> <li>London aik dilchasp shehar hai haalaanke yeh bohat mehnga hai.</li> <li>Main bus se jana chahta tha kyun ke yeh sasta hai.</li> <li>Haalan ke uski maa Germany se hai, lekin usko koi German zubaan nahi aati.</li> <li>Kyun ke Munich bohat khubsurat hai, bohat se log wahan rehna chahte hain.</li> <li>Jab mere pass ziyada waqt hoga main aik saal Austria ya Germany mein guzarunga.</li> </ol>"
            },
            {
                "title": "Checklist",
                "content": "<p>German ka lafzi tarteeb kafi flexible hai, lekin aam taur par aap ko doosre position par kia milta hai?</p> <p>Panj mausam batayen jo aik matahet jumle ka aghaz kar sakte hain.</p> <p>Aap ka mozoo-al-feal kis wakt ulta hota hai?</p> <p>Farme me kis rule ka amal hota hai?</p> <p>Kya aap jis mein bataya jata hai ke kahan, kaise ya kab kuch hua hai us ka koi khas tarteeb hai?</p> <p>Konsi suraten hoti hain jin mein aap ko aik se ziyada mukammal feal aik saath milte hain?</p>"
            }
        ],
        "level": "A1",
        "id": 159
    },
    {
        "level": "A1",
        "unit_name": "KEY TO EXERCISES AND CHECKLISTS",
        "learning_content": [
            {
                "title": "UNIT 1 Checklist",
                "content": "<li>Aap sentences shuru mein aur tamam nouns ke liye capital letters use karte hain.</li> <li>Umlauts mehtab hona zaroori hain kyun k inhon ne lafzon ki pronunciation aur ma`ni ko badal dia.</li> <li>English gender biological hota hai (log mard ya aurat hotay hain, aur cheezein, concepts aur ideas neuter hotay hain). German gender grammatical hota hai (cheezen mardana, zanana ya neuter ho sakti hain).</li>  <li>Verbs badalti hain: ich gehe ya sie gehen. Articles badaltay hain, for example jab noun sentence ka object hota hai. Adjectives noun ke mutabiq badalti hain.</li> <li>Verb ka position.</li> <li>Nahi, sirf ek tense hai.</li>"
            },
            {
                "title": "UNIT 2 Exercise 2.1",
                "content": "<li>ich -e, du -st, Sie -en, er -t, wir -en, ihr -t, Sie -en, sie -en</li>"
            },
            {
                "title": "Exercise 2.2",
                "content": "<li>1 wohnst, wohne;</li> <li>2 studierst, studiere;</li> <li>3 hörst, höre;</li> <li>4 lernst, lerne;</li> <li>5 trinkst, trinke</li> <li>1 Wo wohnen Sie?</li> <li>2 Was studieren Sie?</li> <li>3 Welche Musik hören Siegern?</li> <li>4 Welche Sprache lernen Sie im Moment?</li> <li>5 Was trinken Sie gern?</li>"
            },
            {
                "title": "Exercise 2.3",
                "content": "<li>1 heiße;</li> <li>2 Kommst;</li> <li>3 wohnt;</li> <li>4 geht;</li> <li>5 heißen;</li> <li>6 heiße;</li> <li>7 machen;</li> <li>8 studiere;</li> <li>9 kommt;</li> <li>10 macht;</li> <li>11 wohnt;</li> <li>12 kommen;</li> <li>13 gehen;</li>"
            }
        ],
        "id": 160
    },
    {
        "unit_name": "UNIT 3",
        "learning_content": [
            {
                "title": "Exercise 3.1",
                "content": "1 Main Kam Kar Raha Hun, Aap Kam Kar Rahay Hain, Woh Kam Kar Raha Hai, Hum Kam Kar Rahay Hain, Tum Kam Kar Rahay Ho, Aur Woh Kam Kar Rahay Hain;<br>2 Main Naach Raha Hun, Tum Naach Rahay Ho, Woh Naach Raha Hai,<br>Hum Naach Rahay Hain, Tum Naach Rahay Ho, Aur Woh Naach Rahay Hain;<br>3 Main Ka Naam Hai, Tumhara Naam Hai, Uska Naam Hai, Humara Naam Hai, Tumhara Naam Hai, Aur Unka Naam Hai;<br>4 Main Safar Kar Raha Hun, Tum Safar Kar Rahay Ho, Woh Safar Kar Raha Hai, Hum Safar Kar Rahay Hain, Tum Safar Kar Rahay Ho, Aur Woh Safar Kar Rahay Hain."
            },
            {
                "title": "",
                "content": {}
            },
            {
                "title": "Exercise 3.3",
                "content": "1 Uska Naam Hans Homann Hai.<br>2 Woh Wien Se Hain.<br>3 Woh Austrian Television Ke Liye Kam Karta Hai.<br>4 Woh Deutsch, English Aur Spanish Bolta Hai.<br>5 Woh Khoobsoorat Novels Parhna Pasand Karta Hai.<br>6 Woh Gari Bhi Chalata Hai."
            },
            {
                "title": "",
                "content": {}
            }
        ],
        "level": "A1",
        "id": 161
    }
]
